[
    {
        "post_title": "Why Ironwood $IRWD will Make Your Port Hard (Your Next 3x Biotech/Pharma Play)",
        "text": "So before you go sleuthing through my profile, my 10+ year old account got nuked recently over some mildly controversial comments...So now I have this baby account and I'm not a bot and just want to put that out there first.  \n  \nAnyway, onto the DD...\n\nI'll keep this short, over the past few weeks, IRWD has seen two pieces of news that aren’t huge on their own, but together meaningfully improve the stock.\n\nLinzess sales blowout\n\n* \\-Q3 Linzess sales came in at **\\~$315–350M vs. \\~$250M expected**\n* \\-Ironwood receives **\\~33% of Linzess sales**\n* \\-That translates to **\\~$104M in revenue this quarter**, up from **\\~$85M last quarter**\n* \\-That’s roughly **+$20M per quarter**, or **\\~$80M annually**, above expectations\n* \\-This was a much larger jump than anticipated and strengthens profitability going forward\n\nPediatric label expansion\n\n* \\-Linzess received FDA label expansion for pediatric patients\n* \\-This makes Linzess the first drug available for this pediatric indication\n* \\-Expands the addressable market with limited competition\n* \\-Should further support future sales growth\n\nIn Summery\n\n* \\-Both updates are clearly bullish\n* \\-Revenue is already strong and now has an added tailwind\n* \\-There’s currently very little bearish news in the near term\n* \\-The next key catalyst will be the **upcoming quarterly report**, especially any updates on the pipeline\n* \\-There is mostly upswing with a potential of 2x-3x in the next 6 months. \n\nThat's it, pretty simple and easy play that I can see. \n\nNot financial advice — do your own DD. Good luck!\n\n  \nMy positions: [https://ibb.co/mrc8HRdp](https://ibb.co/mrc8HRdp)"
    },
    {
        "post_title": "DD: Alaska Airlines ($ALK) – Long dated puts on undisclosed loyalty thefts, and a $180M accounting anomaly",
        "text": "Ticker: $ALK\n\nPositions (proof: [https://imgur.com/a/f1NhZi9](https://imgur.com/a/f1NhZi9) ):\n\n\\- 400x ALK Apr 17 2026 $32.50 Puts @ $0.59\n\n\\- 250x ALK Apr 17 2026 $37.50 Puts @ $1.09\n\n\\- 500x ALK Apr 17 2026 $40.00 Puts @ $1.45\n\n\\- 200x ALK Apr 17 2026 $45.00 Puts @ $2.63\n\nTotal premium at risk: \\~$175k\n\n# Thesis: Crime Scene Investigation\n\nListen up bozos.\n\nYou know what is out of fashion? Competence.\n\nYou know what is in fashion? Organized crime syndicates stealing off Americans to give plane tickets to foreigners so they can fly into JFK in Business Class for $35.\n\nAnd you know who is letting it happen? Alaska Airlines - they know *all about it* but refuses to tell anyone because they are terrified of their own stock chart.\n\nThis isn't an airline. It is a distressed fintech with planes attached, run by cowards who are actively helping criminals cross the border to save their quarterly bonus.\n\n**I am Short Alaska Airlines. Here is the dirt.**\n\nBut if your smooth-brains don't want to read or think, just jam this [report](https://drive.google.com/uc?export=download&id=1YTOzp03oH-S21mcY0ZlbcXdRwcxd9ICq) into your AI and ask it if this is the ravings of a lunatic? It will tell you to short at the double.\n\n# 1. The \"Penalty Box\" Infinite Loop (Tech is F*cked)\n\nIn 2022, some poor guy had his mileage account drained so a random dude could travel in luxury. It was a last-minute ticket, and the hackers changed the notification email so the victim never knew until it was too late. ALK agreed to give his points back as a \"one-time courtesy,\" but then punished the **victim** by permanently banning them from booking online. They have to call a phone line (open 9-5) to use their own points forever.\n\nFast forward 4 years to 2026.\n\nThey haven't fixed a single line of code. It is the exact same robbery. Exact same response. Only now, hackers are running a train on Alaska.\n\nLook at the scoreboard:\n\n370 confirmed hacks on public forums in 2025.\n\n\"370? Who cares?\" you ask, wiping Cheeto dust on your wife's boyfriend's couch.\n\nListen to me. More than half of those came from the absolute nerdiest end of mile-sniffers. 41 came from a niche Chinese-language chat room (US Card Forum) with only 12,000 weekly visitors.\n\nThat is the tip of the iceberg. If 41 guys in a tiny Chinese forum got hit, the real number across the 12 million normies who don't check their accounts daily is in the **tens of thousands**.\n\nAn airline with tech so jacked they can't even stop randomers on the other side of the world from switching your email has no place in the modern world.\n\n# 2. The \"This is America\" Factor\n\nNow, I'm not a complete moron. I know how this works. Leaking 100,000s of data points and letting your best customers get beaten up as scapegoats? Ha, this is America. Nobody will care about that. Equifax leaked the whole country and the stock went up.\n\nBut this is more than that.\n\n# 3. The Accounting Riddle\n\nThings gets worse. The filings around the loyalty program have got lumps all over them too.\n\nALK Market Cap: $5.5B. ALK Loyalty Scheme Value: $12B (2024 investor day said so).\n\nBungle the loyalty scheme, the easiest free money printer you can dream of, and everything goes with it.\n\nWatch how they show the world they have no control of it.\n\nThe Q2 2025 Surprise:\n\nALK suddenly booked a $180M spike in loyalty liabilities out of nowhere. No revenue match. Just $180M dropped from the sky.\n\nThe Receivables Game:\n\nIn the same quarter, their receivables from Bank of America (their credit card daddy) spiked $195M.\n\nTranslation: Did Alaska tried to bill BofA for points for no reason. If they did it looks like BofA told them to pound sand. No explanation so who can say\n\nThe Real Puzzle:\n\nBy Q3, $120M of that receivable vanished from \"Current Assets\" and wormed its way into \"Other Non-Current Assets.\"\n\nLooks like something is being put in the basement hoping the SEC won't check the storage locker. Spoiler: They will.\n\n# 4. The Unapprehended Traveler (The Kill Shot)\n\nThis is the part that should put someone in handcuffs.\n\nAnd make the stock rock soon.\n\nRight now - literally today - there is almost certainly a foreign national jetting in on some poor Alaskan's hard-earned miles. So hard-earned that our hero victim actually spotted it! He called up Alaska! *\"Hey! There is a thief in seat 4A flying to Seattle right now!\"*\n\nThe thief must be a daredevil to take that risk, right? Wait until CBP takes him out back...\n\n**NOPE.**\n\nIt doesn't happen. The thief isn't brave; he's safe. **Because Alaska never tells anyone.**\n\nThere are cases where victims begged Alaska to call the police on a fraudster *who was literally in the air*, and Alaska refused.\n\nWhy?\n\nBecause an arrest creates a Police Report.\n\nA Police Report creates a Public Record.\n\nA Public Record proves a Data Breach.\n\nA Breach crashes the Stock.\n\nThey are choosing to facilitate organized crime and border violations just to keep the share price propped up.\n\nHow you think the Trumpisters gonna play this when they find out...\n\n# The Play\n\nThe assets are unexplained ($180M apparition). The tech is broken (no 2FA). The governance is cowardly (hiding the breach).\n\nPositions (proof: [https://imgur.com/a/f1NhZi9](https://imgur.com/a/f1NhZi9) ):\n\n\\- 400x ALK Apr 17 2026 $32.50 Puts @ $0.59\n\n\\- 250x ALK Apr 17 2026 $37.50 Puts @ $1.09\n\n\\- 500x ALK Apr 17 2026 $40.00 Puts @ $1.45\n\n\\- 200x ALK Apr 17 2026 $45.00 Puts @ $2.63\n\nTotal premium at risk: \\~$175k\n\nEDITED TO ADD:\n\n# DON'T FORGET - YOU DON'T HAVE MANY BRAIN CELLS. DON'T WASTE THEM AND WANG THE FULL THESIS DOWN YOUR LOCAL AI -  [HERE](https://drive.google.com/uc?export=download&id=1YTOzp03oH-S21mcY0ZlbcXdRwcxd9ICq)"
    },
    {
        "post_title": "I Love Red Pussy Cats",
        "text": "\nSecretary of Defense, Hegseth’s drone dominance orders are favoring drone stocks and is a clear no brainer. \n\nThe order removed prior DOD policies from 2021 and 2022 that restricted the U.S. military from buying drones and components made by Chinese companies. It also assigns to combat units authority to buy, test and train with small UAS drones that comply with statutes, according to reports.\n\n\"While our adversaries have produced millions of cheap drones before us we were mired in bureaucratic red tape,\" Hegseth said in the video online. \"Not anymore.\"\n\nThe memo aims to bolster U.S. drone manufacturing by \"approving hundreds of American products\" for military purchase. It also calls to leverage private capital that supports the industry. The DOD plans to arm combat units with a \"variety of low-cost drones\" made by American engineers and AI experts.\n\nThe order will also expand the Blue List of DOD-approved unmanned drones, components and software, as part of a collaboration between the Defense Innovation Unit and the Defense Contract Management Agency, according to reports. The DOD in 2020 established an effort called Blue UAS, which is the process for certifying commercial drones for military use.\n\n\"Modern battlefield innovation demands a new procurement strategy that fuses manufacturers with our front line troops,\" the memo said.\n\nLastly, the DOD plans to integrate drones into relevant combat training starting next year, which includes force-on-force drone wars.\n\n\"Lethality will not be hindered by self-imposed restrictions, especially when it comes to harnessing technologies we invented but were slow to pursue,\" Hegseth wrote in the memo.\n\nThe announcement builds on a June 6 executive order from the White House to invest in drone technology and integrate it into the national airspace.\n\nIn December alone, they delivered 641 systems/drones part of the SRR contract, which the budget has increased from 70M to 800M. And further announced Q4 preliminary guidance of 25M resulting in over 1,800% YoY revenue.  \n\nFollowing news today, RedCat’s Black Widow just got approved for the NATO NSPA Catalogue signaling NATO countries likely to purchase RedCat’s drones. \n\nThey recently did an offering for 170M that got gobbled up by tutes and they exercised underwritten options a few months ago. \n\nIn December alone, they delivered 641 systems/drones. And further announced Q4 preliminary guidance of 25M resulting in over 1,800% YoY revenue. \n\nThere is also speculation that RedCat’s Black Widow involving its visual navigation thanks to Palantir strategic partnership was used to help capture Maduro with its anti-jamming technology. \n\nThey are also tapping in the USV, which I’m sure you’ve heard about as many russian vessels were taken down by these sea drones. Guess which compared acquired that exact product known as the Magura7 and started production in its brand new facility in Georgia? Yup. RedCat. \n\n\n\nTLDR: Drone warfare is here. American drone dominance is here. Plan to outpace China which means $$$$$ for drone industry. RedCat won SRR contract beating 30+ competitors for it. Meeting the supply demand for the contract. \nHas connections to current administration. Approved for NATO. Tapped into USV industry. Speculating to be used for the capture of Maduro. 1,800% YoY increase in revenue\n\nI am 15k shares long. "
    },
    {
        "post_title": "Either I get rich, or we all die. My current trading thesis - REDUX",
        "text": "Mods took down my last post after 200k views. No idea why. Wasn't selling anything, wasn't pumping tickers, just sharing my thinking. Whatever. Trying again with more focus on the macro and less on specific positions since apparently that's a problem.\n\n**What I think is happening:**\n\n* Trump needs the market to rip into midterms. That's it. That's the whole thing. Everything else flows from there.\n* Tax cuts, deregulation, defense spending, rate cuts, cash handouts to the base. He needs wins he can point to, and stock market go up is the easiest win there is.\n* Meanwhile nobody wants to test him right now. Maduro got snatched. That sent a message. Iran's not going to do anything crazy. Putin's going to wait and see. China's playing nice for the moment.\n* That buys a window where risk assets can run.\n\n**Then last night happened:**\n\n* DOJ opened a criminal investigation into Jerome Powell. The stated reason is testimony about some building renovation at the Fed. The actual reason, according to Powell himself, is that Trump wants lower rates.\n* Powell posted a video Sunday night. Direct quote: \"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president.\"\n* He said that. On camera. The Fed Chair publicly accused the President of using the DOJ to intimidate him into cutting rates.\n* Gold hit record highs overnight. Dollar sold off. Futures dumped. \"Sell America\" trade came back.\n* But by midday stocks had mostly recovered. Same pattern as Liberation Day tariffs. Selloff, panic, stabilization, back to business.\n\n**What this means:**\n\n* Short term: volatility. Markets don't like Fed independence being threatened. Chop ahead.\n* Medium term: probably bullish? If Trump gets his rate cuts, whether by breaking Powell or replacing him in May, that's rocket fuel for stocks. Bad for the dollar, bad for inflation eventually, but good for equities through 2026.\n* Long term: this is where it splits into two very different futures.\n\n**Path one, the pump:**\n\n* Trump gets what he wants. Rates come down. Housing unfreezes. Consumer spending picks up.\n* Defense budget passes. $1.5T proposed. Counter-drone, AI infrastructure, domestic manufacturing all eat.\n* Deregulation everywhere. Crypto rips. Tech rips. Everything rips.\n* Market pumps into midterms. People with risk assets do well.\n\n**Path two, the collapse:**\n\n* Trump doesn't stop at pressuring the Fed. He breaks it. Foreign investors lose faith in US institutions.\n* \"Sell America\" stops being a one day trade and becomes a trend. Bonds, dollar, and stocks all falling together.\n* Or he goes further. Starts taking territory, seizing assets from other countries, because the spending isn't sustainable otherwise. World wants to respond but can't, at first, because US military dominance.\n* Internal resistance builds. Coup, paralysis, who knows. Or we stumble into a real conflict. China moves on Taiwan. Russia escalates. Iran miscalculates.\n* Everything falls apart.\n\n**Here's the thing though:**\n\n* Even in path two, some stuff still works. Defense doesn't go down during wars. AI infrastructure still matters. Critical minerals become more critical, not less.\n* Unless it goes nuclear. Then none of this matters and we all have bigger problems than our portfolios.\n\n**Signals I'm watching:**\n\n* Fed independence. If Powell gets indicted or pushed out early, major red flag. Multiple \"Sell America\" days in a row means it's real.\n* Defense budget. $1.5T passes, defense names keep working. Stalls or gets blocked, time to reassess.\n* Supreme Court on Lisa Cook. Arguments this month on whether Trump can fire Fed governors. He wins, Fed independence is done.\n* Credit card cap. Trump floated 10% today. Banks cratered. If this happens, he's willing to break things for short term juice.\n* Foreign treasury holders. China and Japan start dumping in size, that's the real signal.\n* Gold. Already at records. Keeps ripping while stocks chop, smart money is positioning for something.\n\n**When I get out:**\n\n* Fed independence breaks and market prices it in over days, not hours\n* Defense budgets stall\n* Bonds, dollar, stocks all falling together for a week plus\n* Actual military conflict, not just talk\n\n**Where I'm positioned:**\n\n* Themes: defense, AI infrastructure, critical minerals, domestic semis, some housing\n* Mix of shares and longer dated options\n* Stuff that wins if Trump pumps, but doesn't completely die if things get ugly\n\n**Bottom line:**\n\n* Bull case: market pumps into midterms, I take profits in 2026\n* Bear case: system breaks, but defense and infrastructure still work because wars need supplies\n* Worst case: nukes, and nobody cares about stonks anymore\n\nI'm comfortable with those odds.\n\nhttps://preview.redd.it/8vloiyrehycg1.png?width=2001&format=png&auto=webp&s=8f126a3b7dc75338a4b693842129a96fa566b809\n\n"
    },
    {
        "post_title": "Figma Bull Case",
        "text": "**I don't know why my post got deleted earlier but I would like to re-post anyway.**\n\nJust sharing my big picture point of view on Figma and get other perspectives from the community here.\n\nI think Figma is no longer the same company that Adobe tried to acquire for $20B. It’s definitely grown bigger (in terms of ARR + suite of AI offerings) and more disruptive than ever in the age of AI.\n\nWhat O365 is for productivity, Figma is for creativity.\n\nBy creativity, I don’t mean just being a design collaboration tool like what most consider it as, but an end to end digital product creation platform which is the anchor to my bullish outlook for this company.\n\nIn my opinion, they have moved past Adobe, Sketch, and others as they are the clear industry leader now in the product design space and have now set their sights on Cursor, Lovable, and other AI coding platforms.\n\nMy big bet is they will win because those tools are largely single-player and code-first with no enterprise lock-in moat.\n\nThis was further solidified when I saw Google invested. Institutions are positioning and the stock seems to have found a floor despite lock-ups expiring.\n\nHere are my supporting theses:\n\n1. **Figma beat Adobe XD, Sketch, and others because it was a multiplayer platform by design, not because it packed more designer features.**\n\n* Browser native\n* Real-time collaboration\n* Design systems \n\nScalable product development is inherently collaborative. This is Figma’s premise, and this is why Cursor, Lovable, and others will hit the ceiling in enterprise environments.\n\n2. **Adobe offered $20B to acquire Figma in 2022, before AI coding platforms became cool.**\n\nAt that time: \n\n* ARR was rougely \\~$400M\n* Figma was just a design collab tool\n* AI wasn’t core to the product story yet \n\nFast forward:\n\n* ARR now \\~$1B+\n* Product suite has expanded massively\n\nThat it is valued below what Adobe was willing to pay then seems interesting. And what led me to frame this POV.\n\n3. **Enterprise Lock-in.** This may be the most under-appreciated part. The enterprise has standardized around Figma which means hiring for positions include (“must know Figma”) along with process and governance changes which are hard to break.\n\nSwitching becomes organizationally painful. This enterprise lock-in is a massive advantage and what will drive them to win despite the early advantages of AI coding platforms. Think how Microsoft Teams won vs Slack, in the end. But this time, with a much bigger value proposition in Figma in its coherent AI strategy and inherent multi-player strength that other platforms won’t be able to compete with. \n\nNot to mention the amount of legal, security, and privacy requirements they need to deal with in order to activate scale in an enterprise. Figma is already there. \n\n4. **Complete AI Co-Creation Suite.** While most companies slap AI on top, Figma does something far more intentional. It is taking the entire product development lifecycle and weaving every step together from ideation (**Figjam**), design & prototyping (**Design**), build (**Make**), and deployment (**Site**) of apps with AI, all with the affordance of human agency and curation in the process.\n\nOne commenter from my earlier post highlighted that Figma have acquired PayLoadCMS last year. This will help them accelerate a \"design to CMS-powered website\" workflow that will eat away from platforms like Wix, Squarespace, and WP.\n\nIf you think about what Cursor and Lovable did is hard. It is really not. What’s hard is integrating features in a way that feels complete, cohesive, and easy-to-use.\n\nHow many enterprises will risk having a disjointed design and development tooling ecosystem when they can have everything in one platform? \n\n5. **The role of the designer and developer are converging.** One way to look at it is, the pool of seats (i.e. TAM) became larger as designers get into engineering work while developers get into design.\n\nThis is powerful as the most value will always come from the most creative of endeavors, not the fastest created but looks cookie-cutter.\n\n6. **A potential acquisition target to big tech giants.** Now this is highly speculative but:\n\n* What if google wanted a true end-to-end product creation stack \n* What if Microsoft wanted to own creation beyond Office\n* What if Amazon wanted a creative + dev OS \n\nThere are very few platforms that sit in the intersection of enterprise, creation, collaboration, AI, and design systems. That scarcity matters. \n\nThe potential for big acquisition is not far-fetched.\n\n**Personal position:** I’ve been accumulating shares since the stock hit its floor at around \\~$34 and believes this will have a big move, once investors catch on to the true potential.\n\nAdding a screenshot of my position just to show that I have skin in the game, and I'm invested for the long-term.\n\nhttps://preview.redd.it/y6ibblhjjucg1.png?width=1510&format=png&auto=webp&s=46c3008b75de95c648a3c80540b0cb65ae6d3ad8\n\n"
    },
    {
        "post_title": "$RKT 99.99%: MBS God-Candle Lit at $23 🚀",
        "text": "9,020 shares. 99.99% of my account. Not a single share has moved since my [original YOLO](https://www.reddit.com/r/wallstreetbets/comments/1m6vxil/tastes_like_2021_again_130k_yolo_on_rkt_9999_of/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). 💎🙌\n\nI called this at $16. We’ve already lifted to $23, but I’m not even thinking about selling.\n\nThe \"MBS God-Candle\" just ignited. Trump just ordered a $200B mortgage bond buy, pushing 30-year rates under 6% overnight. The Trump administration is perfectly aligned with $RKT because housing affordability is a top agenda item. Institutional giants and advocates like Bill Pulte and Bill Ackman are already vocal about crushing these spreads to force affordability.\n\nThe real alpha for 2026 is Rocket’s transformation into a tech-driven financial powerhouse. By integrating the Redfin search funnel and Mr. Cooper servicing book, they now own the entire Search-to-Close lifecycle. As the market realizes Rocket scales like a SaaS company rather than a cyclical bank, I'm expecting massive multiple expansion.\n\nI like the stock even more than before. I still like rockets. See you regards on the moon. 🚀🚀🚀"
    },
    {
        "post_title": "Silver moonshot yolo on Pan American $PAAS",
        "text": "I'm young and naïve enough to think that this time's parabolic rise in silver is different from the short-lived prior runs like those from 2011 or the Hunt Brothers.\n\nMichael Lynch's work has shown that bullion banks, contrary to their behavior in prior silver spikes, have bought into strength this time around, as opposed to 'selling at the highs' in silver contracts: [https://econanalytics.substack.com/p/bullion-banks-are-a-key-driver-of](https://econanalytics.substack.com/p/bullion-banks-are-a-key-driver-of)\n\nI see this as akin to positioning around the 2008 subprime mortgage crisis, in which many banks initially caught off-sides on credit default swaps, then repositioned to take advantage of the mounting crisis, before the mortgage marks were allowed to hit the tape.\n\nThat the bullion banks are going long into this parabolic rise in silver suggests to me that this could be the prelude to a far more material revaluation in the silver price, after bullion banks have fully repositioned on the long side.\n\nFor further background on the fundamentals of the silver market, I highly recommend reading through Alexander Campbell's Substack, which he generously provides for free drawing upon his experience as commodities head at Bridgewater: [https://www.campbellramble.ai/p/my-meandering-path-to-silver](https://www.campbellramble.ai/p/my-meandering-path-to-silver)\n\n**Why Pan American Silver $PAAS?**\n\n[Handsome Silver Miners](https://preview.redd.it/2sos1n8ueqcg1.png?width=800&format=png&auto=webp&s=7d1db3b82eefef36084f6d782fd8fd8b055393c9)\n\nBecause Rick Rule likes the stock, this is the primary reason. Who is this guy Rick? I can personally attest that commodity stocks he likes have a tendency to levitate without bounds; it doesn't really matter if he uses technical analysis or voodoo magic to divine the trajectories of mining stocks, as long as it works.\n\n[Pan American Founder and real-life Indiana Jones global explorer](https://preview.redd.it/kc04vtineqcg1.png?width=400&format=png&auto=webp&s=c3a5cf554ce0a09d3e05c2150633b2b7cdb3c70a)\n\nThe secondary reason I choose Pan American is that in addition to being a fundamentally strong, high cash flow enterprise, $PAAS holds three massive non-producing silver mega-projects across LATAM: Navidad, Escobal and La Colorada Skarn. While these projects contain ludicrous amounts of silver, they have remained dormant for decades sitting on the company's books because of extraordinary capital intensity as well as regulatory & community based opposition, as a result their incredible value is not appropriately reflected in Pan American's valuation.\n\nHowever recent American big-stick resource 'diplomacy' across the Americas suggests a far more interventionist stance in promoting regional resource extraction irrespective of local opinions. This can be seen in recent American adventures in Venezuela, as well as rhetoric and kinetic asset repositioning around Colombia, Greenland and Mexico.\n\nGiven that silver has incredibly important applications in modern tech from high-performance batteries and solar panels needed to compete with Chinese power infrastructure, as well as silver's critical role in advanced weaponry such as patriot missiles and torpedoes, I would presume that future American adventures in Mexico and other LATAM jurisdictions will involve a certain predisposition towards securing and enabling silver production.\n\nIn terms of moving the needle on regional silver production in the relatively near term, Pan American's three major silver projects sit at the forefront of policy considerations. Escobal was a fully functioning, monster silver mine in decades past, mothballed only due to non-technical, social/legal considerations. La Colorada Skarn is a monster silver deposit right next to ongoing, world-class silver mining operations with excellent regional infrastructure and talent. Navidad is another monster silver deposit under a highly supportive, newly rationalized Argentinian government.\n\nIf America decides it needs to ramp up silver production anytime soon, which I believe should've been yesterday, Pan American Silver's trio of mega-projects may well be among the principal beneficiaries of such industrial policy.\n\n**Disclosure and positions**: I've been long the stock for a while and now hold a fair bit of calls. Take my opinions with a boulder of salt as I am not a financial professional in any capacity.\n\nhttps://preview.redd.it/bbrctcn5gqcg1.png?width=1602&format=png&auto=webp&s=48dcda0264b8aa5abaa88a55711b58113897aebf"
    },
    {
        "post_title": "KO DD: Defensive Cash-Flow Play in a Volatile Market",
        "text": "Picked up 500 shares of KO @ 67.45.\n\n**Thesis:** In a volatile macro environment, capital tends to rotate into defensive names with consistent cash flow. KO generates \\~$10B+ in annual FCF, has pricing power globally, and is a dividend aristocrat.\n\n**Valuation:** Trading \\~23x earnings, roughly in line with historical averages. Dividend yield \\~3%.\n\n**Catalysts:** Rate cuts, defensive rotation, pricing increases in emerging markets.\n\n**Risks:** Strong USD impacts international revenue, declining soda consumption in developed markets.\n\n**Position:** 500 shares @ 67.45 \n\nNot expecting moonshots — just steady returns (even a Swing trade is fine as long as I make small profit). Position attached. Who's with me?\n\nhttps://preview.redd.it/jo8100gsf4cg1.jpg?width=921&format=pjpg&auto=webp&s=dd45c886e797adc76bb2651f091fb0850bdfbec1\n\n  \n"
    },
    {
        "post_title": "Going balls deep on GOOG thanks to insiders on Polymarket",
        "text": "There was a post here a few weeks ago of the Google insider who predicted the day that Gemini 3 would drop and all of Google’s search trends. They were right.\n\nOn its own, that's nothing magical, but, they also predicted dozens of other markets correctly that could only be known using insider information.\n\nFor example:\n\n* \\#1 most searched movie on Google (8 cents -> 100 cents)\n* Gemini Flash not released by December 15 (23 cents -> 100 cents)\n* \\#1 most searched athlete (35 cents to 100 cents)\n* \\#2 most searched person (21 cents to 100 cents)\n\nThere’s only one explanation, they are a Google employee making bank off insider information.\n\nAnd it just so happens, a few days ago, the same account is back putting money on Gemini getting *at least* a 50% score on FrontierMath’s Benchmark.\n\nhttps://preview.redd.it/21r2mjjovtbg1.png?width=1018&format=png&auto=webp&s=bf1b72e9042f0f961002a4a8997b31253a5eb1f6\n\nSo… that’s all cool and shit but how do I profit? Well let me explain it for you simpletons:\n\nI'm loading up on GOOG calls at open, AI is \\*\\*\\*the\\*\\*\\* market cap driver right now, and with the Gemini 3.0 release, everyone knows Google is slightly ahea\n\nBut, if Gemini can score 70%+ on FrontierMath? That's a whole other ball game. That takes AI from helpful chat assistant to potentially publishing papers.\n\nhttps://preview.redd.it/9j6ely6mvtbg1.png?width=1076&format=png&auto=webp&s=998d5e6ddafc61f817107feb4dba4995b4f64342\n\nhis is a huge deal if this insider is right. They singlehandedly moved the odds from 8 cents to 45 cents. Conviction is balls deep and everyone knows they know something.\n\nEven if they're wrong, Google is mopping the floor with everyone else, it's not even a competition. I'll have to roll my calls over to LEAPs if they don't hit in the next month.\n\nLong live Google, death to NVDA, and thank you Google insider for the free loot.\n\nInsider profile: polymarket user @ beepboopzyx"
    },
    {
        "post_title": "FDS (FactSet): The Only FD That Won’t Blow Up Your Account",
        "text": "**TL;DR**\n\nFactSet is being valued as if its core business is weakening, despite decades of consistent, subscription-driven growth and high customer retention. The company continues to generate predictable cash flows through multiple market cycles, while current valuation reflects unusually low expectations. The opportunity here is it is mispriced as risk due to AI, but it will remain durable. \n\n**Background**\n\nFactSet sells financial data and analytics to institutional investors, asset managers, wealth firms, and corporates. Its product is embedded in client workflows, which makes switching painful and churn low. For this reason, retention stays high even when asset managers are under pressure, cutting headcount, or seeing AUM decline.  FactSet’s revenue doesn’t depend on optimism or inflows — it depends on necessity. Most revenue is subscription-based, which gives the business strong visibility and predictability.\n\nThat model has worked for a long time. FactSet has now grown revenue every year for over four decades.\n\n**Recent Earnings**\n\nIn its most recent fiscal year (ended August 31, 2025), FactSet reported:\n\n\t•     Revenue of $2.32B, up about 5% year over year\n\t•\tOrganic Annual Subscription Value (ASV) growth of ~5.7%\n\t•\tNet income of ~$597M, up ~11%\n\t•\tGAAP EPS of $15.55, up nearly 12%\n\t•\tContinued strong free cash flow, alongside dividends and share buybacks\n\nGuidance for FY 2026 calls for 4–6% organic ASV growth and revenue of roughly $2.42–2.45B.\n\n**Why Stock is Low**\n\nMargins have come under pressure, mainly from higher compensation and ongoing technology investment. FactSet, however, isn’t spending defensively — it’s spending to deepen the product and expand how clients use its data.\n\n**Why that Doesn’t Matter**\n\nA key point that gets overlooked is that FactSet owns and curates a large portion of its proprietary data. That matters in an AI-driven environment. Many competitors rely more heavily on third-party data, which limits pricing power and flexibility when new tools are layered on top. FactSet’s approach allows it to integrate AI into workflows without giving away the core asset that clients are paying for.\n\n**Position**\n\n\n\n\n"
    },
    {
        "post_title": "SentinelOne (S) Getting Flexed by CRWD – Holding 500 Shares, might go all-in, Here's Why",
        "text": "\n\nhttps://preview.redd.it/nbn26k51ppbg1.jpg?width=921&format=pjpg&auto=webp&s=5f6256bfd6da5954519af3453169289e73acf5e4\n\nDear Regards,\n\nHolding 500 shares of SentinelOne (S) at $14.57 avg. \n\n2Y chart's a dumpster fire, down from $30 highs, thanks to CrowdStrike's (CRWD) Falcon Flex eating their lunch.\n\nFalcon Flex TL;DR: CRWD's mix-and-match subscription model – fast deployment, lower costs, massive ARR growth ($4.92B, +23% YoY). Crushing competitors like S in endpoint security; MITRE tests show CRWD superior.\n\nThesis: S undervalued, strong AI tech with great clients like Tesla, but short-term pain. Holding for rebound or acquisition.\n\nPosition attached. Thoughts?"
    },
    {
        "post_title": "SEZL is the BEST setup for 2026: Flipping the Script on BNPL",
        "text": "TLDR: Sezzle (SEZL) is one of the best setup stocks going into 2026. \\~15 Forward P/E for 2026 w earnings growing \\~30%. Discounted due to subprime BNPL sentiment but it will push through. **I own SEZL and am buying at these levels.**\n\nIt is rare to find a company growing its top line at 76% while maintaining 28% net income margins, and it is even rarer to find it trading at just \\~14x forward earnings. Sezzle (SEZL) is that company. Sezzle provides flexible, consumer focused ‘Buy Now, Pay Later’ financing and credit-building tools specifically designed for the underserved market. While the headlines focus on subprime fears and regulatory noise, Sezzle has executed a profitable growth strategy, pivoting to a high-LTV subscription model that self-funds its own expansion. The setup here looks very attractive. You have a founder-CEO, Charlie, who has his entire net worth in the company, owning roughly 44%, 2.4 million pre-split shares (approx. 14.4m post split), and has never sold a share… plus, he regularly quotes Buffett and Munger:\n\nhttps://preview.redd.it/63d8cbn54kbg1.png?width=1179&format=png&auto=webp&s=87a401c25b749b3fd525cb5fe4f0fad0764ff665\n\n# BNPL vs Credit Cards\n\nProbably contrary to most, I am of the opinion that properly run BNPL is entirely more ethical and consumer supportive than credit cards, but the credit card industry has created a sentiment that using BNPL is somehow buying things that you can’t afford when in reality America lives on credit cards that now charge 28% as a standard when it used to be like 12-15%. The amount of headlines citing BNPL usage while ignoring that BNPL has existed for decades in the form of Credit Cards is mind blowing. Headlines citing BNPL use to buy groceries straight up ignore the fact that the majority of American shoppers are swiping their credit cards for everything.\n\nIf you polled me, nearly 100% of my spending would be using BNPL in the form of credit cards regardless of the fact that I pay them off weekly and do so for added purchase protection, travel rewards, etc.\n\nUnlike a credit card, SEZL refuses to allow additional BNPL purchases if there is an unpaid balance. They also have the ability to remove buying power instantly in the event of a downturn where credit cards typically need to give 45 day notice.\n\n# Consumer-Sided vs. Merchant-Sided\n\nA few years ago, Sezzle switched from the typical “merchant-sided” BNPL model which works primarily through the seller, to a consumer-sided model which differentiates them from competitors like Affirm. SEZL is inherently focused on being a consumer-friendly, consumer driven experience. They charge the consumer. SEZL’s pitch towards consumers is that it is a financial wellness tool - accessible, budget flexibility, and a way to build credit with Sezzle Up vs revolving Credit Card exposure. The app is extremely user friendly and is a promotional store that encourages return to app for browsing - offering promos, price comparisons, featured products etc.\n\n**Merchant Sided**: Driven by merchant access and promotion. Merchants participate to increase sales but the BNPL eats into merchant margins to provide a benefit and has inherently lower margins itself.\n\n**Consumer Sided**: SEZL flipped the script and essentially developed an underwriting and approval process for the consumer. It is consumer-driven rather than merchant-driven.\n\nBecause of this, Sezzle operates in the wallet of the consumer. Things like the Sezzle Anywhere subscription essentially allow it to be used anywhere Visa is accepted, rather than the consumer having to hunt for a merchant where SEZL is accepted.\n\nAnother notable difference to Affirm is that Affirm is focused primarily on merchant partners that have higher value ticket items. Affirm has much longer term product focus that rivals traditional loans etc with 6-12-24 month plans and interest. They do offer the traditional pay-in-4 but its focus is higher ticket. This is why their AOV is significantly higher than SEZL’s.\n\n# Customer\n\nSezzle targets subprime and near-prime consumers, a bit more ‘risky’ but they are very selective in who they approve and are serving a population that is underserved by both credit cards and other BNPL.\n\nThey utilize AI and new infrastructure to risk-assess users that traditional banks reject. SEZL allows users to opt-in for credit reporting and pitch it as a tool to build credit via Sezzle Up. They reward responsible use with increased access, but they have strict usage limits, you cannot use Sezzle if you have an unpaid or overdue balance.\n\nUnlike traditional credit cards that might give a $3,500 limit immediately, Sezzle starts with micro approvals of \\~$50 and allows users to increase their lines of credit with responsible usage. The company is big on promoting Sezzle as a budgeting tool to spread a single cost over 6 weeks, not a way to rack up revolving debt at 28% APR.\n\nSEZL says they differentiate themselves with proprietary non-FICO approval methods, monitoring, limits etc.. there is inherent risk here and it comes down to if that is legit or not - if it’s just talk during good times or it will hold up during tough times.\n\n# Financials\n\nManagement prides themselves on efficient growth, prioritizing profitable growth strategies. One of SEZL core principles though is extremely efficient cost control and expenses. They pride themselves on it to expand leverage. They are a huge turnaround story because their prior business model failed and they had to ruthlessly cut expenses and now they pride themselves on their efficient use of money. On the calls I’ve listened to he regularly refers to how certain companies just burn cash in the name of ‘expansion’\n\nIn Q2 Management recently noted:\n\n“With top line growth of 76% YoY, gross margins of 61% and a net income margin of 28%, we remain well ahead of the Rule of 40 and our own version, the Rule of 100, where we scored a 165 this quarter.”\n\nhttps://preview.redd.it/l7668uj94kbg1.png?width=1026&format=png&auto=webp&s=fd2ccad7ee085ec4ffbe96692e72e62be18d39b0\n\n**History of Raising Guidance**: Split-adjusted guidance for FY24 started at $2.00. It moved to $2.50-$3.00, then $3.25, and recently to $3.52. Preliminary guidance for next year is already at $4.35.\n\n**Valuation\\*:** We are looking at a \\~18.40 TTM and a FWD PE of 14.20 based on FY26 guidance of 4.35 EPS.\n\n**PEG Ratio:** SEZL is trading at a FWD PEG of 0.60. For reference, a PEG of <1 is generally considered undervalued. (PEG ratio is a valuation calculated by dividing a stock’s Price-to-Earnings (PE) ratio by its expected earnings growth rate, adjusting the PE to show whether a company is undervalued or overvalued relative to how fast it is expected to grow earnings.)\n\nhttps://preview.redd.it/uxmvxtoa4kbg1.png?width=1600&format=png&auto=webp&s=cfec125f54babf92714289c4d388a0bb52596354\n\nNOTE: the drop in Sezzle’s (SEZL) Q2 2025 TTM (Trailing Twelve Month) EPS drop is primarily due to a **one-time significant tax benefit in Q2 2024** rolling off the twelve-month calculation. **Operating Income actually grew by 116%** year-over-year (from $16.7M in Q2 ‘24 to $36.1M in Q2 ‘25).\n\nhttps://preview.redd.it/zqfsyuac4kbg1.png?width=1600&format=png&auto=webp&s=50344b30ce3ca167273f1981b2b661925a66ae1e\n\nhttps://preview.redd.it/7sxebcqc4kbg1.png?width=1600&format=png&auto=webp&s=cb19d03a17f2ef8fc5338f663d61f00b99104738\n\nhttps://preview.redd.it/b8ddc15d4kbg1.png?width=1600&format=png&auto=webp&s=0b554168416ac7e29abbe1bc39a92663bdde11cd\n\nUnderlying SEZL’s operational momentum is its balance sheet that separates it from more levered peers. As of Q3, SEZL reports a cash position of $134.7m vs $118m in debt for a net cash position of $16.7m and a healthy Total Debt/EBITDA ratio of 0.76. In addition, the company recently expanded its credit facility to $225m. With an interest coverage ratio of 17x and a Return on Equity of 90%, SEZL is using its capital to efficiently and profitably grow.\n\nWhile Affirm has recently become slightly GAAP profitable, Klarna has shifted back to a net loss. Sezzle differentiates itself with superior capital efficiency, a \\~36% Operating Margin and \\~27% Net Income Margin, providing a cushion against macroeconomic headwinds that its high-volume, thin-margin competitors do not possess.\n\nhttps://preview.redd.it/zn19cv6e4kbg1.png?width=1600&format=png&auto=webp&s=34578669288eaa2584a57455d27430e884e4abc8\n\nAdditionally, SEZL has crossed an inflection point and has been Free Cash Flow positive since Q1 2024 providing ample cash generation for growth and flexibility. To highlight SEZL’s focus on profitability, it is important to note that rapid growth fintech lenders typically have negative cash flow as they send cash out to merchants faster than they receive paybacks. This is not the case with SEZL, despite increasing Gross Merchandise Value by 58%, they continue to post positive cash flow. SEZL’s short payback period of 4-6 weeks allows it to fund organic growth without the need for external cash burn. They are successfully self-funding their 58% GMV growth.\n\nhttps://preview.redd.it/8oayna2f4kbg1.png?width=1600&format=png&auto=webp&s=60da9acfc454778a7184c5b8984b136e269622ab\n\n# Q3 Earnings\n\nI thought results and call were good. There was a slight uptick in provision for credit losses to 3.1%, but with SEZL new customers get higher provisions as they don’t have a history with the company, it’s almost like a CAC/marketing expense.\n\nCharlie clarified it’s right where they anticipate though, that On Demand also increased it a bit due to more new customers, but that their guidance has been clear and they are in line for full year. He basically said ‘we guided full year and we were under it Q1 and Q2 so that implies it will be higher in Q3 and Q4, that should be understood.’\n\n\n\nhttps://preview.redd.it/3fq201kg4kbg1.png?width=498&format=png&auto=webp&s=f059c78eacf910d0e7febae7283a0ec8993a1f64\n\nI also don’t hate small proactive upticks in credit loss provisions, I’d much prefer that than under provisioning for losses as any over provision results in smaller future provisions to balance them out.\n\nMonthly On Demand and Subs (MODS) grew 48% YoY Active consumers grew 11.4%. GMV grew 58.7%\n\nRevenue grew 67% YoY and adjusted net income was $25.4M this quarter, up 53% YoY.\n\n\n\nI also don’t hate small proactive upticks in credit loss provisions, I’d much prefer that than under provisioning for losses as any over provision results in smaller future provisions to balance them out.\n\nMonthly On Demand and Subs (MODS) grew 48% YoY Active consumers grew 11.4%. GMV grew 58.7%\n\nRevenue grew 67% YoY and adjusted net income was $25.4M this quarter, up 53% YoY\n\nhttps://preview.redd.it/tg1h40wi4kbg1.png?width=1179&format=png&auto=webp&s=3f90521cdbf37eb1c45260b4fbbbd086affaf449\n\nhttps://preview.redd.it/lgp4hf9j4kbg1.png?width=1179&format=png&auto=webp&s=c80c2087b6ccbfbf64aaabbf716f503da1eb2e11\n\nhttps://preview.redd.it/uzml2cmj4kbg1.png?width=1179&format=png&auto=webp&s=323fa99713ab0b927c16240d6d7d1ffdd74e16d4\n\n**Why is Revenue growing at >60% but active consumers by 12%?** Active consumers means they have made a purchase on SEZL. The real driver of revenue growth is subscriptions. It’s much more in line growth rate if you view it from that lens - 67% vs 48%. Last quarter it was 62% YoY MODS (monthly on demand and subs). They were marketing on demand big time as a driver they hoped would convert to subs faster. They noticed the conversion wasn’t happening as much as they liked so they cut back on the marketing spend to pivot going forward, noted as a reason for growth change. Refocusing on prioritizing subs. On demand is still accretive and is offered to people hesitant to subscribe but they want to focus more on lifetime value which is in a sub over on demand. In addition - SEZL mgmt lives by the idea of profitable growth. They stress it on all the calls. Q4 is also historically a supercharged growth quarter because holidays etc. so there will likely be a spike in user growth. I think of Active consumers as “the universe that has been introduced to Sezzle” - this pool was built with growth/exposure first in mind - and then they try to transition them into subscribers - growing the pool of high value long term value consumers. So the “active users” can slow down as long as MODS continues to grow as the margin of MODS is much higher than a transaction consumer. The gap remains 2971-784=2,187 Active Users that are not MODS/Subscribers. MODS is currently 26% of actives. Last year Q3 it was 19.8%. So they are eating into this pie, converting to higher value customers which is driving revenue and profit growth with leverage vs active customer growth.\n\nRevenue can grow faster than consumer base with more subscriptions, more transactions (avg purchase growing from 5.4 to 6.5x). Also, the more transactions the more merchant fees so if customers grow 10% but GMV grows 20% the increased volume results in greater revenue growth via transaction fees. GMV grew 58.7%, subscribers made 10x more transactions, and there is cross selling new products (fee for credit building product etc).\n\nSEZL’s Formula for Leveraged Growth: Base consumer growth + conversion to high value subscribers + cross selling products to increase customer LTV + increase usage/GMV + growing take rate = fuel for revenue growth at leverage greater than base consumer growth. Take rate is 11.2%, increasing 60bps YoY.\n\nWith a pivot to higher-margin subscriptions (MODS), a growing take rate (\\~13%), and a rapidly increasing EPS forecast, I feel Sezzle is fundamentally sound.\n\n# Q4/Q1 Accounting\n\nIt is important to note, SEZL has some funky Q4 Holiday Season accounting so it is important to bake it into expectations. There were previous sell-offs seemingly based on investor misinterpretations of this.\n\n**Q4:** In Holiday seasons there is typically **a m**assive GMV spike. Sezzle must provision for losses immediately in Q4 to account for the risk. This depresses the net income for the Q.\n\n**Following Q1,** Revenue is recognized when paid (fees/payments). Since Sezzle is a a 4-6 week BNPL payoff, the revenue from the Q4 holiday spend is actually received and recognized into Q1. Q1 often shows lower GMV but all-time high Revenue.\n\nGAAP accounting requires them to provision for losses in Q4 but not recognize the revenue until Q1. This creates weird QoQ comparisons, but if you look at the cost of transaction processing relative to revenue, gross margins remain north of 60%.\n\nhttps://preview.redd.it/momy2xjl4kbg1.png?width=978&format=png&auto=webp&s=e566298094dfa3d6d3308a24843577e327e4a567\n\n\n\n# Risks\n\nThere is a valid concern regarding consumer pressure and risks associated with subprime focused lenders/BNPLs. This negative sentiment seems to be particularly high lately with spillover from subprime auto and student loan debt headlines. IMO, BNPL is apples and oranges compared to those long-term debts. Obviously increased downward consumer pressure will ultimately affect all credit type products, but in the short term I think the impact is different.\n\nBNPL is very short term in nature - particularly SEZL - and as management would argue, they are “more of a budgeting tool to spread a single cost across 4 weeks,” rather than a traditional credit product.\n\n1. It’s much easier to pay $120 total over 4 weeks than it is to pay $500 car loan or $300 student loan.\n2. Short term in nature provides the ability to resolve in the short term. 4 $30 payments is much more achievable than a recurring $300 and $500 payment monthly for 12-36-indefinite months.\n3. BNPL is a conscious decision to spend $X amount of dollars in a single purchase vs having made a probably inappropriate long term commitment to something that is unaffordable.\n4. There is almost an anti-student loan sentiment with recent grad unemployment and also a build up of unexpected loan repayment following all the talks about forgiveness.\n5. BNPL can also be a symptom/result of those delinquency rates as people turn to non traditional credit as their traditional access is impacted, maxed, or unavailable. And in turn prioritize maintaining access to liquidity of ability to access BNPL for everyday needs by ensuring they pay it off as companies like SEZL do not allow follow up loans without payoff.\n\nUltimately - i am not arguing BNPL is immune but providing some insights on the lack of visible impact right now. I believe there’s a host of financial and psychological reasons from different perspectives that actually make BNPL resilient to the delinquency numbers we see in things like cars/student loans.\n\nAlso - pulling from an old Value Investors Club write-up on SEZL, the author noted that in a conversation with the SVP of IR reflected that: “Sezzle is not afraid of a recession. Their customer is already in distress. Moreover, they expect more people to use BNPL services if the economy goes bad. Because Sezzle’s target is subprime customer they are not afraid of Apple Pay Later or PayPal Pay-in-4 as competition.”\n\n\n\nhttps://preview.redd.it/jaz3eqvm4kbg1.png?width=1179&format=png&auto=webp&s=132bb12f85151297a3abebe31fab16cfaac4998b\n\nNonetheless, despite my above points, there is a real risk in the cyclical nature of BNPLs. A recession or prolonged consumer weakness will impact SEZL via GMV compression and credit degradation. SEZL’s revenue is directly tied to GMV and as such, if customer spending contracts, revenue growth could meaningfully decelerate. And while SEZL’s loss provisioning has remained sufficient in the 2.5-3% range, a true recessionary environment will put their underwriting process and credit provisions to the test. Fortunately, because of wide-spread negative sentiment regarding the subprime space, I feel much of this is presently baked into SEZL’s compressed multiple and the upside outweighs the downside risk.\n\nIf you are interested in SEZL, I think the current price provides a great entry point with significant upside potential, but keep in mind this stock has proven to be very volatile.\n\nAt these valuations SEZZLE is setup to be a potential multibagger.\n\n**ALSO - CFPB agrees BNPL negative sentiment is overstated:**  \nThe CFPB finds that \"BNPL imposes significantly lower direct financial costs on consumers than legacy credit products.\"\n\nhttps://preview.redd.it/t7uku0735kbg1.png?width=529&format=png&auto=webp&s=3e9956e22b13be2c06cb63f5d26de562a66c997c\n\nBNPL losses are now less than half of the legacy credit cards it replaces signifying the strength of the underwriting.\n\nCharge-offs went back to 2020 stimulus-check era lows, but lenders noted the decrease is driven by \"improved credit models\" and \"shifting focus on increasing usage by their existing customers.\"\n\nThis is SEZL exact model.\n\nhttps://preview.redd.it/8o423u365kbg1.png?width=1116&format=png&auto=webp&s=176a366455834d13c999f52641c53dfd740aa412\n\n**I own SEZL and am buying at these levels.**\n\n  \nEDIT: position\n\nhttps://preview.redd.it/cmk2fxztckbg1.png?width=1293&format=png&auto=webp&s=f372628ae8617984f6d635fb72b28c5985cf23a4\n\n"
    },
    {
        "post_title": "The Most Elaborate Perpetual Pump'n'Dump In Need of Shorting",
        "text": "One day I decided I needed a market edge and so I took a few 50mg Vyvanse broke them off and snorted them to get a faster kick. I then sat for 10 minutes waiting for a DD miracle but nothing happened...\n\nThe problem? Vyvanse is a prodrug and so snorting it won't speed up its effects. You see the Lisdexamphetamine is dextroamphetamine with an attached L-lysine (amino acid) that breaks off in your body using enzymes... thus creating this slow-release mechanism.\n\nI wasn't discouraged and so I took short acting expired Ritalin, crushed it into about 120mg worth of powder and used the same delivery process to give me \"the edge\".\n\n[The delivery process](https://i.redd.it/guhgylvldyag1.gif)\n\nI instantly got hit with \"Writers euphoria\", some people say they see colors, all I saw was a pump'n'dump right in front of my eyes reaching the top of its pump. Perfectly timed using behavioral psychology to create strong FOMO to anyone waiting for their next hit of market open.\n\n**If you haven't figured it out yet, I'm talking about SLS.**\n\nI will attack this pump'n'dump scheme from several different views and maybe some of you will join me on this **'short'** trip.\n\n# Buckle up buckeroos, we're gonna start with fundamentals\n\nCurrently this shitco is trading at a share price giving it a mkt. cap close to USD 600M. First thing that I ask is who is the customer?\n\nIt's a bunch of unlucky people who basically have at most 1-2 years to live with a somewhat uncommon form of cancer: Acute Myleoid Leukemia. If we look at how many people get it globally we're gonna arrive at roughly:\n\n1.5-2.0 persons / 100.000\n\nNow let's look at all cancers (this will be important):\n\n± 200 people / 100.000\n\n**.... HOLY FUCK THE VYVANSE IS KICKING IN.**\n\n( What I didn't realize was that the Vyvanse has still entered my bloodstream and started dislodging the dextroamphetamine into my bloodstream, I have now trasncended into a dopamine and neuroephidephrine fueled state of being.)\n\n\\-----  \nWhy am I mentioning all cancers? Well it's to disrupt the one thing that is being spread through all the pump'n'dump posts: That this is a replacement for **Keytruda** (which was sitting at 25B revenue with 80% gross margins). But here's the first misconception that is being omitted in all the SLS cult posts:\n\nKeytruda is all-purpose, while the shit that SLS is producing **is NOT**. You need to be tested for the presence of WT-1 antigen which is only done for blood disorders/cancers. You may find the presence elsewhere but it says absolutely nothing about it being usable for this (source: I know a few doctors).\n\nThis means that while Keytruda might target the 200 people out of 100... SLS drugs will barely target 1% of that.  Why do I say barely? Well because that these drugs are given to specific people... CDK-9 is effective only for people with a certain (less common) mutation and GPS is given (to my understanding) to people in remission.\n\nSo let's do simple math (before I make you even more depressed):\n\nUSD 25B ---> 1% ---> 250M (let's be optimistic and say that 80% are eligible) --> 200M\n\nBut wait it gets better... however right now my heart is pumping, pupils are needle-point sized and I need to lower the adrenaline in my bloodstream by doing the only sensible thing I learnt from Elon Musk... **low doses of ketamine.**\n\n[Unlocking my full potential](https://i.redd.it/apm2dh6tdyag1.gif)\n\nKeytruda gets administered constantly, unlike GPS which is like <20 injections. So that 200M you were looking at? Yea it's probably way lower.\n\nNow that we've got over the \"HOLY SHIT THIS THING IS WORTH BILLIONS\" let's focus on the flying ponies in front of my eyes warning me about the financials and the CEO's marketing/dilution pattern.\n\n# A Good Modern CEO is always Professional Bullshitter.\n\nIf you've ever worked as a Software Engineer you will always notice two flavors of your average SWE.\n\n1. The technical guy who actually knows shit\n2. The bullshitter who's liked, but does shit and yaps whole day\n\nThe first one if he's career driven will become a good CTO. The second one will become CEO.\n\nThis is true for every profession, reality is that CEO needs to be able to sell, especially bullshit, to keep investors happy and to bring them exit liquidity. It's all a zero-sum game. Nobody wins, especially not the poor cancer patients who are used for advertising just like white-monkeys are in China.\n\nThe CEO SLS is no different to other CEOs except that this guy is a master bullshitter. How do you become a master bullshitter? Ambiguity. Think of the (1) technical guy, he will always be precise in his formulations, because he knows what he's talking about. the (2) bullshitter will always be ambiguous because he wants to sound smart.\n\nThe CEO has a beautiful pattern of selling very ambiguous news, carefully wording them in a way that the SLS cult members (read bagholders and MLM leaders) parrot the \"actual\" but not-factual message to the masses. Just look up the recent posts on bagholder/p'n'd subreddits for SLS. It's all bullshit purposefully pushed by bots and marketing team.\n\nAfter the share price jumps high, the CEO cuts a financing deal that basically tanks the price into oblivion, not including the perpetual warrant inducement plan (which alone makes acquisition very unlikely).\n\nThe best part? The CEO gets paid heftily even though close to 50% shareholders want to lower his above-standard pay. And there's a good reason he's getting such high cash bonuses - he knows it's all bullshit.\n\nAll of this will mean that if this company gets acquired (which is unlikely) it will be sold at a discount and not a premium. Notice the pattern that even after so many dilutions the market drives the price close to $4 a share... with constantly increasing share count it's amplifying the speed at which the company's valuation grows even though they still haven't really presented anything substantial.\n\n# Let's Look at the Recent Catalyst\n\nSo what spiked the current share price above $4? Results of the REGAL study were postponed, which was seen negatively and so the CEO wrote a very ambiguous post saying something on the lines of:\n\n\"We're still waiting for more deaths so that we can conclude the study.\" Which is absolutely hilarious. Because it doesn't say anything about SLS specifically, yet people interpret it in a way that it does and that the SLS specific treatment is actually the good one (it may be, but given the pattern I doubt it will be statistically significant)\n\nThe study includes both BAT (best available treatment) and the SLS drugs. The deaths they are waiting for might well be the BAT ones, while the SLS patients have already died (grim I know). Their argument: Average BAT life expectancy is 8 months or whatever they're saying.\n\nSo why do people think it's \"good news\" for SLS? Because people think they understand statistics when they actually don't. Heck I studied it, specialized in it as a mathematician... and even I will never dare to say that I fully understand statistics. Reality is that the delay might be negative, neutral or positive.  \n**WHY?:**\n\n* Many factors come into patient selection - The study isn't the typical \"let's pick 130 people at day 1 and start our tests\" they come in different cohorts/groups\n* You have high odds of selecting the \"good group\" that could even survive 5 years with bad treatment (this can be 10-15%)\n* All the bull posts you see focus on using the average as proof that this study is going on longer than it should (which is a very misleading statistic, and using it like this is pure bullshit for gullible people)... Average needs to be understood in a way that you will have people who died after 3 months and people who lived those 5 years -> and that will average out, so just looking at number of occurred deaths is not enough to know if there is a statistical significance. Saying that the study is going longer than expected is absolute bullshit, because if you have the healthier group by accident they will survive longer, but it will also be reflected in the final statistical analysis.\n* A small sample size like this is prone to distortions, follow up studies will be needed to know if this really works or not, which btw will definitely lead to more cash burn.\n\n**But most importantly:**\n\n* BAT for AML has significantly improved... and by significantly I mean really significantly. The 8 month figure is somewhat outdated by now as it might be closer to 10-12 months. Increasing the actual statistical significance needed to be observed with GPS.\n\n# Unsustainable Cash Burn and More to Come\n\nThe cash burn of this company is insane and even if they succeed with their tests they will face even higher cash burn due to the necessary shit they need to do to get this drug approved and into production. Given their current free cash, it's more than likely that they will need to raise more money.\n\n# So Why Are You Bearish?\n\nWell I like to think of it in terms of probability / uncertainty, specifically conditional probability. (Let's denote P(event | A ) as Probability of Event conditioned by A happening) Asks yourself this, which probability is higher?:\n\n(1) P( Good News | CEO Bullshitted every single time AND Cash Burn bad )  \n(2) P( Bad News | CEO Bullshitted every single time AND Cash Burn bad )\n\nWhich is more likely to be true? (1) > (2) or (1) < (2)?\n\nI'm gonna go with the likelihood of bad news as probable... This doesn't mean that the drug won't work, I just am certain that they will have to raise cash no matter what and the valuation once actual funds take a look at the revenue projections won't be as high as the current valuation.\n\nThe fact that the Trump Admin is pushing for cheaper drugs, is also pretty negative for any biotech trying to get their life-saving medication out there... This isn't the \"age of biotech\" (un)fortunately.\n\nHence I'm buying puts.\n\n**NOTE:** I'm not a biochemist, I might be wrong and I'm betting only money that I'm willing to lose, so don't follow blindly, do your own DD. Also brace for this post being downvoted by the SLS gang and Indian bots. One last thing... a big middle finger fuck you to anyone who is trying to profit by using dying people as advertisement.\n\nhttps://preview.redd.it/xul15buwdyag1.png?width=892&format=png&auto=webp&s=292f3986d4e479518690dcee02953c68b4212c9d\n\n**My position is small, because I'm locked down in other trades, sharing mostly because I like to do equity research:**\n\nhttps://preview.redd.it/86f0tiv8eyag1.jpg?width=549&format=pjpg&auto=webp&s=971f62f43ea2409f69d90f4b226e6efcc0e59418\n\nEDIT: To the existing and new bots out there, the SLS cult and other believers, yes I will double down if the stock price goes up:) Answering here since I received \"very nice\" DM requests.  "
    },
    {
        "post_title": "Coupang $CPNG is Big Fuk",
        "text": "Disclaimer: This was prepared with the help of a Korean associate. Later we fed it in to AI for translation and formatting purposes.\n\nTL;DR:\nCPNG only trades in the U.S., but the crisis is entirely in Korea: lawmakers are talking perjury and suspension, the public is actively boycotting, and this is a newly profitable, logistics-heavy business that cannot survive disruption. U.S. investors are pricing a PR issue; Korea is treating this as a company-ending legitimacy failure.\n\nCoupang is fuk\n\nThis needs to be viewed as a Korean political and legitimacy crisis, not a U.S. tech stock hiccup — and Korean senators explicitly said that today.\n\nAt the National Assembly hearing, lawmakers directly addressed the gap between how this crisis is reported in Korea versus how it’s framed in U.S. outlets. Domestically, investigators are disputing Coupang’s disclosures, challenging sworn testimony, and raising perjury accusations. Internationally, it’s still framed as a data breach plus compensation. Senators openly questioned why foreign investors are seeing a materially softer narrative, and several explicitly warned that this information gap itself is becoming part of the problem.\n\nThat matters even more because Coupang only trades in the U.S. The Korean platform is owned by a Delaware holding company listed on the NYSE. There is no Korean stock price to reflect domestic outrage, no local shareholder pressure, and no market release valve. All price discovery happens in the U.S., while all political, regulatory, and consumer pressure is happening inside Korea. Lawmakers are clearly aware of this and unhappy about it.\n\nOn the ground, public reaction is not abstract. Lawmakers, civic groups, and labor organizations are openly calling for operational suspension, not just fines or apologies. Korean media coverage has shifted from “breach response” to “whether the company should be allowed to continue operating in its current form.” At the consumer level, large-scale boycott behavior (“탈팡”) is observable, with app-usage trackers and business press reporting declines in daily active users while competitors gained share. In Korea, boycotts are not symbolic — people actually leave platforms, especially when alternatives exist.\n\nThis is existential for Coupang because of its structure. The company only recently became profitable, after years of losses. It is a logistics-heavy business with thin margins that depends on uninterrupted volume, dense routing, and habit-driven repeat usage. A sustained boycott or even a temporary suspension would immediately reverse profitability. Drivers leave. Sellers leave. Customers retrain behavior. This is not a business you can pause and restart.\n\nTwo weeks ago, Coupang installed a U.S.-trained American lawyer as CEO to front the crisis. Domestically, that has been widely interpreted as insulating decision-makers behind U.S. legal optics rather than accepting Korean accountability. That perception has worsened public anger and reinforced the political narrative that the company is evading responsibility rather than confronting it.\n\nThis is why this trade is no longer about valuation, multiples, or growth trajectories.\nIt’s about whether a newly profitable, logistics-dependent company — openly boycotted, politically isolated, under criminal scrutiny, and facing calls for suspension — can survive in a country that actually follows through on public and state pressure.\n\nEven if it was about fundamentals they are shit anyways.\n\nU.S. markets are pricing a bad news cycle.\nKorea is treating this as a company-ending legitimacy failure.\n\nThat disconnect is the thesis.\n\nPositions: About 10k in May 21$ puts"
    },
    {
        "post_title": "How good actually was the WSB 2025 Outperformance: Statistical Analysis",
        "text": "Obviously a lot of traction of the outperformance of the [2025 WSB picks](https://www.reddit.com/r/wallstreetbets/comments/1puy95u/how_did_wsbs_stock_picks_of_2025_perform/). I wanted to do a slightly more thorough analysis to see if there was any real alpha here.\n\n**TLDR:** *evidence of excess returns, but the performance is best explained by a highly aggressive, factor-loaded portfolio in a strong market environment*\n\nTo evaluate alpha, I used standard asset-pricing models, including CAPM and the Fama-French four-factor model (market, size, value, and momentum). These models help distinguish returns driven by skill from returns driven by exposure to known risk factors such as growth, momentum, or small-cap bias.\n\nThe portfolio was an equal weighted basket of the 10 picks:\n\n* AMD\n* GOOG\n* HOOD\n* META\n* MSTR\n* PLTR\n* RDDT\n* RKLB\n* TSLA\n* WMT\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n(*Note: this analysis is through Nov 28, since Fama-French hasnt published daily returns for December*)\n\n**Descriptive Stats:**\n\n* **Portfolio Return**: 61.2%\n* **SPY Return**: 17.9%\n* **Portfolio Outperformance**: 43.3%\n* **Portfolio Vol**: 44.5%\n* **SPY Vol**: 20.2%\n* **Portfolio Sharpe | Sortino**: 1.85 | 2.82\n* **SPY Sharpe | Sortino**: 0.86 | 1.29\n\n***Interpretation:*** *significant outperformance, with significantly more volatility*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**CAPM Regression**\n\n* **Adj. R-Squared**: 0.718\n* **Market beta**: 1.88\n\n***Interpretation:*** *The portfolio had an extremely high beta. I.e. if the market goes up, all else equal you expect the portfolio to go up 1.88x the market. If it goes down, same thing in reverse*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**Fama-French Four Factor Regression**\n\n* **Mkt-Rf**: 1.59 *(very high market risk)*\n* **SMB**: 0.64 (small cap weighted)\n* **HML**: -0.73 *(strong growth bias)*\n* **MOM**: 0.51 *(significant momentum exposure)*\n\n***Interpretation:*** *Confirms that the portfolio was significantly weighted towards \"levered\" growth names*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**Conclusions:** nothing novel here, WSB tilts towards higher risk, momentum names. If the same exercise is done in 2026, you should expect outperformance if the market goes up and underperformance if the market goes down.\n\n*Sources/Methods: Fama-French Library, yFinance, Python*\n\n*Happy to answer any questions or provide code if people are interested in running it themselves*"
    },
    {
        "post_title": "The Entire AI Buildout (Google, NVDA, MSFT) Is dependent on this $700m Monopoly - $15 -> $150 PT.",
        "text": "I drew colossus from Starcraft 2 to represent laser beams. And prepared a whole thesis but kept getting automodded for \"low quality\".  So here's the more TLDR version of my thesis:  \n  \nThe Entire AI Industry is shifting to photonics from Google TPU to optical interconnects. \n\nThe entire AI \"Growth\" story ends in 2026 if there's no InP substrates + materials.  \n\nBUT GUESS WHO CONTROLS IT ALL? One Company: $AXTI. \n\nThere's two bottlenecks:\n\nInP Substrates -   \n  \n\\- Hyperscaler optics (TPU pods, etc)   \n\\- Optical transceivers (5g, data)   \n\\- LiDAR (robotaxis, drones, military)   \n\\-Optical Modules (interconnect clusters)   \n\\- Silicon photonics laser dies (Nvidia’s future co-packaged optics and Intel/Broadcom SiPh engines use InP CW laser arrays.)  \n  \nThis is a DUOPOLY  from  \n\\-AXTI (est. \\~30–35%)   \n\\-Sumitomo (est.\\~30%)   \n\\- JX Nippon (est. 10-15%)\n\nIndium Phosphide (the source material for everything): \n\nVital Materials - 35%   \nAXT - 25%  \n  \nBefore, this was a commodity with low TAM just for telecom.\n\nNow they're used for the entire AI buildout. \n\nJust to give u an example $AXTI -> $LITE -> $GOOGL TPU. without any of these members, the program shuts down.   \n  \nGoogle would literally pay $5B (50 TIMES prices + \\~$140m TAM from 2024) DIRECTLY to one of these suppliers -> hand to COHR just so their whole TPU program doesn't stall because Meta decided to buy them out. And this would only be a like a 3-4% added cost to their BOM because this thing was so cheap. If Meta does it first, then Google's TPU program stalls. If Google does it first Microsoft's ASIC problem stalls.   \n  \nTHE WORLD IS AT MAX CAPACITY RIGHT NOW (demand > supply by multiple factors pre-ramp) AND THIS IS GAME THEORY on materials supply chains. \n\nGuess who shows up twice in the WHOLE AI bottleneck? Both as the duopoly bottleneck and the duopoly bottleneck of the bottleneck\n\nAXTI.   \n  \nThis is the holy grail of supply chain analysis + materials research. Nobody's posted about this stock here in the past 5 years, you're welcome. \n\nAnyway I decided to max OTM some spare change on Calls last Friday, because there's a low chance this goes from $15 to $150 if we see the same memory supply stock in 2026. I will buy more shares on Monday when markets open up but wanted to share this at the start as proof. \n\nNFI, there's a chance China sends this to $0 with export controls so don't follow along I just wanted to share my thoughts. But if this goes to $0 so does the entire growth phase of the AI buildout.   \n  \nI just thought this could also easily be a $7B company given they control 1/3rd of the world's entire substrate capacity and then 1/4th of the world's entire materials used for AI buildout.  \n  \nIt's a monopoly in mining -> refining -> substrate production. And a duopoly for InP substrate production and Indium Phosphide. \n\n I just wanted to share as proof in case this becomes legendary.   \n  \nTLDR: THE ENTIRE AI INDUSTRY IS BOTTLENECKED TWO TIMES BY THE SAME COMPANY. \n\nFOUND THE SINGLE POINT OF FAILURE OF THE ENTIRE MANY TRILLION USD WESTERN AI BUILDOUT IS SOME $700m COMPANY CALLED AXTI, WORTH LESS THAN SOME PRE REVENUE LLM STARTUP. "
    },
    {
        "post_title": "Top Quality DD on ETH: High Conviction trade since my last DD on META (hand written not AI)",
        "text": "Alright, regards, if you had been following my last DD on META, you would’ve done really well. Since that DD post, my position has been up moderately + I’ve been getting really good yield on the covered calls written against my longer dated call (I bought back when I’m up 50% and sell another call when the stock rallies with climbing implied volatility). I will still follow my original trade plan in my previous DD post for exits and take profits. \n\n\n\nhttps://preview.redd.it/jy3xm39yge9g1.jpg?width=817&format=pjpg&auto=webp&s=1d127d8387c86d3a4be56e0ad3245b2803e3009e\n\n\n\nTLDR:\n\nFundamentally: Gold and Silver are mainly driven by money supply aka inflation. BTC and ETH are sharing this trend since they were gradually adopted by institutions and mainstream (around 2021 to present). I am arguing that BTC and ETH are acting more and more like commodities since then.\n\nMacro/Policy: The current administration is keeping inflation higher for longer. Bullish for commodities. \n\nThesis: Commodity will move higher with inflation and BTC and ETH in particular will experience a catch up trade as the current cycle isn’t over yet. Short/Medium term catalyst for ETH is the tokenization of stock security and long term catalyst for ETH is stablecoin market cap will 10x by 2030 (according to scott bessent).\n\n  \n\n\nDD starts here:\n\n\n\nI’m here today to make you all a bit more money for Christmas. ETH, some people call it digital silver, some people call it the backbone of Wall Street, some people call it a scam (I think quite a few of these people have lost money on it). Tom Lee has called it the macro trade of the decade, and more people are calling Tom Lee a con artist lately, while others are still amazed at his haircut. All the noise makes it hard to focus on the main issue - is Ethereum worth anything, or is it just fairy dust? \n\n\n\nIn my DD, I want to focus on the first principles of things so you won’t be reading an AI slop or some useless rambling of hopium. \n\n\n\n**What is value?** \n\nThe traditional value investing way of computing the intrinsic value of an asset is by looking at all the future cash flow this asset can yield. Which is why we can value a stock, because owning the stock is partially owning the future cash flow the company generates \n\nBy this metric, gold/silver/BTC/ETH are all the same - they have no intrinsic value as they don’t earn you any money just by holding them. Which leads us to the next question: why are gold and silver doing so well, while BTC and ETH are trading like hot garbage?\n\n  \n\n\n**What is price? How are commodities priced?**\n\nThere are many factors that influence the price of a commodity. The most common factors include: utility, scarcity, trust/credibility, cost to carry, supply and demand, and most importantly market sentiment (mass psychology). \n\n\n\nFor gold and silver specifically, they have limited in supply (on earth) and have been around for a long time where people have trust in them not only as commodities but also as currencies. In terms of utility,  Silver has various industrial utility due to its superior conductivity and gold has a stable demand in many industries shown in the graph below.\n\n\n\nhttps://preview.redd.it/7esvpu8yge9g1.png?width=643&format=png&auto=webp&s=640b729e19b50b04b2b63e341df4996959a14466\n\nHowever, if you just look at supply vs demand, you would realized they are not off by much and it’s not really the driver for gold price (same for silver).\n\nhttps://preview.redd.it/e9rdju8yge9g1.png?width=1485&format=png&auto=webp&s=5d782e6b28112369e9c962ab5abaef0899470575\n\nhttps://preview.redd.it/fsusju8yge9g1.png?width=1477&format=png&auto=webp&s=61646d30d24b79b60dfa7097f7613d49d6d2f4a2\n\n\n\n**What is the real driver for price?**\n\n\n\nAs mentioned earlier, gold and silver have been around long enough for people to trust them not just as commodities, but as currencies. So much so that they are considered risk-off assets (or save haven when shit hits the fan). Central banks build reserves with gold to maintain their monetary system credibility in and preserve national wealth against various economic risks.\n\n\n\nIn other words, gold and silver are strongly linked to fiat currency and we can use money supply as a proxy for gold and silver. (as shown in chart below)\n\nhttps://preview.redd.it/gne2ju8yge9g1.png?width=1600&format=png&auto=webp&s=0264f3cdf05c72fcffdeace0eb8392fc2344cd3d\n\n\n\nLike the stock market, gold and silver prices goes up with the increasing money supply (aka inflation). On top of that, gold and silver has demonstrated to be the safe haven when a crisis happens. Both gold and silver had a massive rally in 2011 during the global financial crisis as everyone thought the U.S. financial system was going to collapse and piled their money into gold and silver for safety. \n\n\n\n**What about BTC and ETH?** \n\nThere are certainly similarities for BTC and ETH when compared to gold and silver. For example, BTC also has a fixed total supply and is the world’s first ever decentralized payment network based on the blockchain (similar to gold, it became a much more volatile version of store of value).\n\n\n\nAnd ETH took blockchain a step further and became a global computing network that allowed programmers to build decentralized applications used to tokenize any assets (sounds like silver when it comes to utility). The photo below illustrates the market value of tokenized assets and transactions on the ETH network in 2024. While ETH only shares a tiny portion of the TAM in these transactions, ETH is definitely a leader in terms of the tokenization of assets. So far, 65% of stablecoin runs via ETH and according to Scott Bessant, the market cap of stablecoin will grow ten fold into 2030. So it definitely sounds like a ton of upside for this network.\n\n\n\nhttps://preview.redd.it/8k5no49yge9g1.png?width=849&format=png&auto=webp&s=49a44a83902c313cb69f5cea5466d9e81fa9987a\n\n\n\nWhile it sounded like a greenflag on paper, I consider the ETH supply to be a red flag. ETH bulls like to say ETH has a burning mechanism on a portion of the transactional fees that creates a deflationary effect on ETH (as projection chart shows below, the total supply of ETH is projected to decline in the coming years + ETH gives a dividend), I find this to be shady and don’t really buy it. On top of that, I think the switching cost is too high given ETH network has a pretty expensive transactional fee aka gas price. But if the supply projection holds true, ETH will be much closer to the digital silver.\n\n  \n\n\nhttps://preview.redd.it/r1tglv8yge9g1.png?width=850&format=png&auto=webp&s=d89317fe2bcb7376ecb745a354e88d6d0894a878\n\n\n\nRegardless of how many gold and silver traits BTC and ETH embodies, the correlation between BTC/ETH and M2 says it all. Both commodities are starting to show correlation with money supply and the stock market since 2021. And the reason why I picked this time frame is because both BTC and ETH started to gain adoption from the mainstream and institutions during the period. \n\n\n\nhttps://preview.redd.it/wsi50w8yge9g1.png?width=1704&format=png&auto=webp&s=8cc48832af48e785de1821f341e3b049df82edb6\n\n\n\nSo why does it feels like BTC and ETH are trading with the stock market like a risk on asset? \n\n\n\nThis explanation is based on an interview by Steve Eisman with Rahul Jindal, a FinTech strategist at Autonomous. Jindal explains that BTC and ETH began trading more like stocks after 2019 because the type of investor holding crypto changed. In the early years, crypto was mostly owned by early adopters who viewed it as a hedge against banks and fiat money, so it was less correlated with equities. After COVID, easier access through exchanges, large retail participation, and excess liquidity caused crypto to be held alongside stocks in investor portfolios. As a result, BTC and ETH became sensitive to money supply and risk appetite, which explains why they have moved closely with the stock market since 2021 rather than behaving like gold.\n\n\n\nThis does not mean BTC and ETH will always trade like high-beta stocks. As adoption matures and ownership shifts further toward institutions and long-term holders, their prices are more likely to be driven by supply constraints, network usage, and monetary demand rather than short-term liquidity cycles. Over time, this would allow BTC and ETH to behave more like commodities, where value is tied to money supply, instead of purely reacting to stock market sentiment.\n\n\n\n**The Inflationary Policy & Macro effects**\n\nTrump has taken extensive measures (manipulating the BLS jobs data and putting pressure on the Fed) to keep the USD weak and interest rate low (to maintain export advantage + service the 38 trillion debt) despite high level of inflation. The promotion of stablecoin also introduces more inflation as people around the globe can now purchase USD backed by treasury (kinda like the U.S can issue debt to the entire world). \n\n\n\nThe end of the quantitative tightening is another catalyst to at least support more liquidity coming into the equity and capital market. Which could be inflationary. \n\n\n\n**Short Term Catalyst for ETH: Tokenization**\n\nIn 2025, the tokenization of stocks reach several milestones, including: \n\n* SEC roundtables on tokenization; platforms like Ondo launch tokenized stocks outside the US.\n* BlackRock explores tokenized ETFs; industry leaders predict massive market growth.\n* Nasdaq files to list tokenized stocks by 2026; Knowpia enables tokenization ahead of Wall Street.\n\nAnd 2026 could see further acceleration to this adoption. CNBC reports stock tokenization running on the ETH network:\n\nhttps://preview.redd.it/mslrjv8yge9g1.png?width=903&format=png&auto=webp&s=2a16e3fa594ab47444ebaa5dba8247fc20315125\n\nTo visualize the true upsides of stock tokenization, the economists of Deutsche Bank offered some great insights on Tokenization below. So far, 90% of tokenized assets are stable coin (which ETH dominates) and the tokenization of stocks could really invite traffic to the ETH network\n\n\n\nhttps://preview.redd.it/88enfv8yge9g1.png?width=1185&format=png&auto=webp&s=fe41fa99bea383057a033c2c8d6513f08f5df34e\n\n\n\n**So why have BTC and ETH traded like hot garbage into year end?**\n\nSince late October, the stock market has been choppy rather than trending. Volatility stayed elevated and trend signals weakened, which caused systematic investors like CTAs and vol-targeting funds to reduce exposure. In this environment, BTC and ETH sold off during equity drawdowns but failed to rally on rebounds, not because of panic, but because risk appetite never fully returned. Positioning stayed light and investors remained cautious.\n\n\n\nSo this looks more like a pause than a breakdown. The stock market has stabilized and pushed to new highs into year-end, which suggests sentiment is still intact. Most notably, the AI sector has remained strong. Earnings from Nvidia and Broadcom were outstanding, showing that growth expectations have not collapsed. As equity volatility compresses and risk-on sentiment improves, this gives the market room to grind higher. If that happens, liquidity and positioning should rotate back into high-beta assets, which is bullish for BTC and ETH heading into early 2026.\n\n\n\nLooking at the ETH chart, the day candle is showing stabilization and I don’t see why it wouldn’t revisit ATH and break above $5,250 in Q1 2026.\n\nhttps://preview.redd.it/uc7g8x8yge9g1.png?width=1600&format=png&auto=webp&s=6523178952726fe7a00ee84149b6d1c2ccebc3f2\n\n\n\n**My expression for this bet: BMNR (I bought deep ITM BMNU calls so my breakeven is 0.4% at the time of purchase)**\n\nAs I think ETH could re-visit 5k in Q1 2026, BMNR is the perfect pick. I pick it for 3 reasons:\n\n1. No debt - so its much less of a fraud such as MSTR (which is also starting to price in not being included into S&P 500).\n2. Premium to NAV expansion - if my thesis plays out, Tom Lee will look like a genius again premium to NAV can revisit higher levels: 1.3x - 1.5x (which is why I picked BMNR over SBET because people give leaders a premium in the treasury holding company world).\n3. I think we are close to a reversal given crypto already being in a bear market with greed and fear recently being in extreme fear. (for reasons I mentioned earlier, the ETH network is doing great, far from a bear market - so the price being in a bear market zone is really just a gift).\n\n\n\nhttps://preview.redd.it/77d20y8yge9g1.png?width=1561&format=png&auto=webp&s=90feb8e9da2ea74e418deedd585a457fba4e9fe1\n\nhttps://preview.redd.it/77wnn59yge9g1.png?width=638&format=png&auto=webp&s=8ff5fd6c82d54f4e7667a9c7e13c6292d7f328ec\n\n\n\n**Position**: \n\nhttps://preview.redd.it/4al0y29yge9g1.jpg?width=1284&format=pjpg&auto=webp&s=983c22accdeccfd8e9eba94dfe889846e9843077\n\nhttps://preview.redd.it/jve1jf9yge9g1.jpg?width=1284&format=pjpg&auto=webp&s=31fad3d5b434ebe66c5ef59a8954a39762925eac\n\n\n\nI even bought for my TFSA:\n\nhttps://preview.redd.it/90gktw8yge9g1.jpg?width=946&format=pjpg&auto=webp&s=33e483add4a2806cb7bf1682707063b6e6e1cafc\n\n"
    },
    {
        "post_title": "MSTR: Why 2026 Could Be a Massive Year",
        "text": "TL;DR: MicroStrategy (MSTR) is trading below the value of it's Bitcoin holdings. Short-term swings are sentiment-driven, but structurally the company is strong, positioned to benefit from the next Bitcoin bull cycle, and supported by growing institutional adoption.\n\nBitcoin’s Slide & Market Factors -\n\nMacro risk-off: BTC dropped 30-40% from October highs due to higher rates, tech volatility, and a strong USD.\n\nETF outflows & liquidations: Spot Bitcoin ETFs saw $3.4B outflows in Nov 2025; leveraged crypto positions triggered $1B in forced liquidations.\n\nCrypto winter: BTC erased much of its YTD gains. When Bitcoin falls, “Bitcoin proxy” stocks like MSTR often fall even more.\n\nMSTR = Leveraged Bitcoin Exposure -\n\nBitcoin-driven stock: MSTR amplifies BTC moves up or down. During the recent dip, MSTR dropped faster than BTC.\n\nBalance sheet buys: MicroStrategy continues acquiring Bitcoin via stock and debt, giving leverage on BTC rallies while retaining flexibility.\n\nSoftware business: Enterprise analytics platform still grows (Q3 2025 revenue \\~$128.7M, +10.9% YoY; subscription revenue \\~$46M, +65% YoY). Small compared to BTC, but it exists.\n\nBitcoin Holdings & Per-Share Math -\n\nTotal BTC: 671,268 BTC ($58.4B at $87,049/BTC) 87,000/BTC).\n\nShares outstanding (diluted): \\~312,000,000 BTC per share: 671,268 ÷ 312,000,000 ≈ 0.00215 BTC/share\n\nDollar value per share of BTC: 0.00215 × $87,000 ≈ $187/share MSTR trades at \\~$157.88. Each share represents roughly $187 of Bitcoin value, plus a small, growing software business and cash reserves.\n\nMarket cap vs BTC holdings: \\~$46B vs \\~$58.4B,  trading below implied BTC value. Impact of BTC moves: Every $10,000 rise in BTC adds \\~$21.5/share or \\~$6.7B total to MSTR’s BTC holdings.\n\nWhy Bitcoin Could Go Up in 2026 -\n\nPost-halving cycle dynamics: Last Bitcoin halving was in April 2024. Historically, years 2–3 after a halving are strong bull phases (2012, 2016, 2020). Supply growth slows, while demand continues to increase.\n\nInstitutional accumulation: Large institutions and corporate treasuries continue quietly buying Bitcoin on dips, adding structural demand.\n\nBanks entering crypto services: JPMorgan and other major banks are exploring crypto trading, lending, and custody services. Bitcoin can be used as loan collateral, unlocking liquidity without selling BTC.\n\nMore institutional access reduces perceived risk, increases adoption, and supports price stability. Macro tailwinds: If the Fed starts cutting rates or inflation eases, risk assets like BTC historically outperform.\n\nGlobal adoption & limited supply: More users, corporations, and payment integration, combined with a capped supply (21M BTC), drives scarcity and potential upside.\n\nWhy 2026 Could Be Favorable -\n\nBTC leverage: If Bitcoin rallies, MSTR (and MSTU) amplifies the move.\n\nBalance sheet & capital strategy: They can acquire Bitcoin while managing cash and debt.\n\nSoftware + subscriptions: Small recurring revenue provides a floor outside crypto.\n\nStructural advantage: Few public companies combine BTC exposure with access to capital markets.\n\nInstitutional tailwinds: Banks and other institutions adopting crypto services reduce risk perception and expand demand.\n\nBottom line: MSTR and MSTU are leveraged ways to play Bitcoin with corporate backing. Short-term swings are sentiment-driven, but structurally the company is strong. With historical post-halving trends, institutional accumulation, limited supply, and banks beginning to integrate Bitcoin, 2026 could be a favorable year for BTC — and your MSTU position could amplify those gains.\n\nCurrent positions: 2x leverage MSTR Bull (MSTU) - 2890 units @ $9.92. Continuing to DCA\n\nhttps://preview.redd.it/afv01n6kj29g1.png?width=1080&format=png&auto=webp&s=d258ba6db6460298afdb22ea1bc9c38c60a8f321"
    }
]