[
    {
        "post_id": "1qmpwrk",
        "post_title": "Impinj DD - RAIN RFID for consumers?",
        "text": "[](https://preview.redd.it/impinj-dd-rain-rfid-for-consumers-v0-jhvpy0lk8jfg1.png?width=1162&format=png&auto=webp&s=2616fea4997c0090a4024c3d96a251f141cb892a)\n\nMy position details: I own 1,941 shares of Impinj (PI) stock.\n\nhttps://preview.redd.it/jwjs58mb9jfg1.png?width=1080&format=png&auto=webp&s=1e8a1e769ea7a884130345c23ed7527d77813273\n\nPI market cap: $4.8B\n\nImpinj manufactures UHF (RAIN) RFID tag integrated circuits (ICs). They sell more than about 15 billion per year. Impinj might sell a tag IC for $0.005-$0.02. Impinj sells the tag ICs to inlay manufacturers like Avery Denison and others. Inlay manufacturers sell inlays (tag IC + antenna + substrate) to end customers to attach to their products. Tags can be little stickers, adhered to paper clothing tags, sewed nearly invisibly into clothing, hidden inside anything non-metallic or non-liquid, etc. Impinj also manufactures expensive stand-alone RFID readers, but also sells the reader IC used by several other companies who then sell their cheaper readers to end customers. I don't have much to say about their readers.\n\nImpinj competes with NXP in tag ICs/chips. Impinj won lawsuit against NXP in 2024 and receives license fee yearly. Part of settlement beyond the yearly cash is a 10-year agreement to not sue over patents, which is a huge relief for Impinj through 2034. David defeated Goliath once and Impinj has 8 more years before any possible rematches. For the next 8 years, Impinj has freedom to grow aggressively without fear of immediate retaliatory litigation from NXP.\n\nRAIN RFID is currently used in places like: Walmart, Inditex (clothing), UPS (package tracking, package-on-right-truck verification), Delta and United (baggage tracking), medicine tracking, car tires and other parts, etc. Supply chains and clothing, primarily.\n\nRecent investor calls show they're starting to push food with Kroger. Food opportunity for Impinj and tagging is obviously very large compared to their current markets, which may explain their current valuation, which is arguably high. They're starting in the bakery sections now.\n\nEngineering deets you can skip if you're not technical: Tag ICs have been improving in performance, usually about 1-2dB (RF link budget spec for tag sensitivity) per generation / node shrink. This has been essential to the technology's capability and expanded usage. I asked Gemini about next node and it's guessing 20-something nm will be the final node and its reasons are sound, which means tag chip analog performance improvement is nearing its end and the analog circuitry will not get smaller. Impinj knows this. Digital performance/capability/featureset may yet still improve with even smaller nodes. Impinj has been focusing on broadening featureset like cryptography and gen2x and is clearly leading and driving its technology. Also, smaller node = more tag ICs per wafer = cheaper tag ICs, so Impinj still certainly has one more significant margin increase ahead. 20-something nm nodes are well matured at this point and should not have a premium. Impinj requires cheap wafers.\n\nImpinj likes to talk about the European DPP initiative in their investor calls (do your own reading on this). I know Trump is fucking over US-EU relations and is causing EU re-evaluation of large initiatives and regulations, so I have my doubts about DPP ever using RAIN RFID at all, even as a option/backup. HOWEVER, Impinj clearly sees it as a backdoor into the real endgame: retail consumers. Right now, RAIN RFID tags are always killed at checkout. The EU DPP would expand RAIN RFID adoption obviously, but more importantly would necessarily keep tags alive after item purchase. Consumer use is the reason for Impinj's new \"Protected Mode\". Tags with Protected mode look dead and only wake up if given the right PIN. Retailer controls PIN and can transfer PIN to consumer via smartphone, or Kroger could set PIN(s) for all its products and allow consumers to query their groceries' tags at home for pantry inventory, etc. You get the idea.\n\nThere's also insights into Impinj's thoughts from press releases on Gen2x, which extends the protocol the tag ICs use:  \n\"It \\[Gen2x\\] addresses consumer privacy at point-of-sale.. \\[...\\] We are today focused on enterprise use cases, but tomorrow’s emphasis will be on consumer use cases, including consumer safety and item sustainability.\"  \n\"Inhibits tag and item counterfeiting, fraudulent returns, or both.\"  \n\"Impinj Protected Mode tag data protection Makes a RAIN tag invisible to RAIN readers. When necessary, the tag can be returned to normal operation using a secure PIN.\"  \n\"Impinj Authenticity cryptographic authentication Verifies a product’s authenticity using a challenge-response protocol, preventing counterfeits and securing the supply chain.\"\n\nI suspect that authentication requires a centralized database to verify that the tag chip itself is authentic. Impinj must control that. I doubt that Impinj will control the item info itself ('this is a Nike Air shoe, number 123456' for example) but will control authentication and will certainly charge a fee per scan for authentication ('Impinj indeed made this tag IC, it matches code xyzpdq in our authentication database'). So Impinj won't know what the product is (only the brands will, like Walmart or Nike), but Impinj uniquely will be involved in \\*every tag scan for authentication\\*. Impinj will not make ad revenue on item data itself - only end-users like Nike or Kroger would. However, Impinj will certainly charge for authentication events like store purchases/returns. Imagine getting an additional few cents return per tag IC via the authentication service.\n\nImpinj is clearly trying to get into consumer phones. Qualcomm Q-6690 - UHF (RAIN) RFID integrated into mobile processor for the first time. Commercial/industrial device focus only. It's a relatively easy jump to consumer smartphones from here now that a UHF/RAIN RFID radio has been integrated into an IC. That will unlock tons more potential. Smartphone manufactueres may be excited about finally introducing a significant new feature. I see this playing out like so:\n\n1. Consumer enables RFID reading on their household grocery items via Kroger (or their clothing items via Kohls or whoever)\n2. For the first time, companies get information on where items go once they leave the stores and how long they stay there.\n3. Companies know what food is in someone's house and how long it's been there.\n4. Companies know what clothing is in someone's house and how long it's been there.\n5. Fundamentally, Companies know identifying information of any UHF (RAIN) RFID tagged item in anyone's house (if the tag IC is alive and enabled), as long as consumers have a phone that can read them AND as long as consumers allow the tags to be read again with the PIN from the store they bought their stuff from.\n6. Advertiser potential galore for whoever has this information. Impinj won't make money off this directly, but this'll push more tags to be in more things.\n7. Companies will want to tag fucking everything, so Impinj sells 100s of billions of tags per year instead of 15 billion. I'd say >20x growth potential, reasonably, not including the value of authentication services which is fuzzy to me.\n\nWiliot has been brought up as an existential threat to RAIN RFID because it uses Bluetooth (which everyone already has) but I don't see it. Inlays are 2-5x as expensive, read rate is 100x to >1000x slower, tag beacons its info out randomly instead of upon query by a reader/interrogator, tag beaconing interval depends on ambient energy levels which vary everywhere. I'd forget about it.\n\nI think Impinj needs to hit +20% yearly growth by gaining enterprise customers to meet investor expectations and today's valuation. Hitting those high targets will reward Impinj with consistent $200+/share. Consumer market is the moonshot / gamble for long term holders. Authentication, to me, is a positive thing of unknown magnitude/effect, though it'd definitely improve margins.\n\nRisks:  \n\\-Trump's continued antagonizing of Europe (and the world) may harm/kill RAIN RFID consumer adoption via DPP as EU countries reprioritize and/or may create preference for NXP within the EU. Reducing global cooperation is bad for global standards for RAIN RFID.  \n\\-Stock is unusually volatile despite being recently added to S&P smallcap 600. Seems to have a strong yearly cycle based on retail/holiday cycle. Many sudden ups/downs based on enterprise performance and news and whether investors believe in the company's growth as a result. Be patient and only buy in low if you buy in.  \n\\-The timeline to break into the consumer space, if it ever does, may still be long.\n\nObstacles:  \n\\-Tagging metal surfaces (like canned goods or foil-lined bags) can be done and the physics has been solved, but crucially it remains expensive at >$0.60 per tag. A normal RAIN RFID tag (tag IC + inlay) might be $0.035-$0.05. A cost breakthrough for metal surfaces would be big news. Until then, this fundamentally limits RAIN RFID in grocery and remains a barrier for the technology.  \n\\-Breaking into consumer (normal person) smartphones for the high growth trajectory. Impinj is making all the right moves so far, but it's a barrier that hasn't been broken yet.\n\nBulls:  \n\\-If you hear about major new enterprise customers, that's bullish. Imipnj can dream about getting Amazon.  \n\\-If you hear about the launch of an Impinj authentication service, that's bullish.  \n\\-If you hear that RAIN RFID tags for metal surfaces have a cost breakthrough, that's very bullish.  \n\\-If the EU \\*mandates\\* RAIN RFID for DPP, that's very bullish (whereas if RAIN RFID is just an option, that's somewhat bullish).  \n\\-If any major smartphone manufacturer announces UHF (RAIN) RFID capability built into consumer phones, that's extremely bullish.\n\nBears:  \n\\-If Impinj fails to secure new large enterprise accounts, that's bearish.  \n\\-If Impinj's only growth over the next two years is through increasing its market share (like vs NXP) rather than new market growth, that's very bearish.\n\nRecommendation: Diversify your portfolio with Impinj if it dips below \\~$110. Buy a large amount if it ever dips below $70 (like last April) because I'd peg Impinj at roughly $50-$60 without its growth premium at all. Sit on it for 3 years and then re-evaluate.",
        "ticker": "PI"
    },
    {
        "post_id": "1qm4kub",
        "post_title": "Permian Resources ($PR): The \"Grown-Up\" Delaware Basin Play (Landman Perspective)",
        "text": "**Full Disclosure:** I am a landman and have worked with Permian Resources on a contract basis in the past. While this has allowed me to peek under the hood, nothing contained below is privileged information. I just like the stock, the rock, and the management.\n\nPermian Resources has differentiated itself from the Delaware E&P pack through superior execution and a shareholder-friendly capital return framework. With the Q3’25 print confirming record free cash flow and raised production guidance, PR offers a compelling mix of income (**\\~4.8% yield**) and growth at a discount.\n\nCrucially, their recent reorganization (moving to a standard C-Corp) has made this the “grown-up” energy hold for my IRA, removing the complexity discount that kept big funds away.\n\n**1. The \"Why Now\": Corporate Clean-Up**\n\nOn Jan 7, 2026, PR completed a major reorganization. Management and long-term holders exchanged their complicated Class C shares for standard Class A public shares.\n\n* **The Signal:** Management is now in the same boat as public shareholders (\"eating their own cooking\").\n* **The Catalyst:** This removes the \"governance discount.\" Many large institutional funds automatically skip companies with complex Up-C structures. By simplifying, PR widens its buyer pool significantly.\n\n**2. Operations: The \"Ground Game\" Advantage**\n\nThis is where my background matters. While the majors hunt \"elephants\" (massive corporate buyouts), PR is playing a lethal \"ground game.\"\n\n* **Q3 Stats:** They closed **\\~250 small transactions** ($180M) in a single quarter.\n* **Why it works:** They are picking up $100 bills on the sidewalk—singles and doubles that add inventory efficiently without paying the massive M&A premiums seen in headline deals.\n* **The Numbers:** Production is up to **\\~410 Mboe/d**, Leverage is a boringly safe **0.8x**, and FCF hit a record **\\~$469M**.\n\n**3. The 2026 Setup**\n\n* **Inventory:** Street consensus sees 2026 FCF potentially exceeding 2025 levels ($1B+ potential) as capital efficiency improves.\n* **Analyst Action:** Morgan Stanley recently adjusted their PT to $18. With the stock trading \\~ $14.78, that implies **\\~22% upside** just to the target.\n* **Cash Return:** You get paid to wait. The base dividend is $0.15/quarter (\\~4.1% yield on cost), plus a $1B buyback authorization sitting in the chamber.\n\n**4. Risks (The \"Landman\" Reality Check)**\n\nNo well is a guarantee. Here is what I am watching:\n\n* **Waha Gas Pricing:** Delaware Basin gas differentials can be nasty. If takeaway capacity gets tight, realized pricing drops.\n* **Service Costs:** If 2026 drilling activity heats up, rig rates and frac crews get expensive, squeezing margins.\n* **Oil Beta:** Obviously, if WTI crashes to $50, the thesis pauses.\n\n**My Position**\n\n* **Long:** 1,200 shares @ $12.46 Cost Basis.\n* **Plan:** Accumulating on dips. \n* **Next Event:** Q4 Earnings & 2026 Guidance on **Feb 25, 2026**.\n\nNone of this is financial advice and please do your own due diligence.\n\nThat’s all for now. Will update after earnings. Good luck and keep it turning to the right!",
        "ticker": "PR"
    },
    {
        "post_id": "1qio9kc",
        "post_title": "HYMC: Eric Sprott's Historical YOLO/My Biggest Position",
        "text": "**TL;DR:** Hycroft Mining (HYMC) is sitting on what could be the largest undeveloped silver deposit in the United States. Eric Sprott has poured $200M+ into this stock in 6 months and averaged up on a 1000% gain position at 1.5billion dollars.\n\n# Part 1: The Asset — What Hycroft Actually Has\n\n**Old NI 43-101 Resource (2023):** \\- \"Low grade pit/moose pasture\" - Uneconomical to mine at low gold/silver spot prices, call options when spot rises - 10.5 million oz Gold - 400 million oz Silver - Location: Nevada, USA (fully permitted)\n\n**What's NOT in that number yet:** \\- Two new high-grade silver discoveries (Brimstone & Vortex) - Exploration drilling has 90-100% hit rate — every hole finds ore - Deposit is \"open in all directions\" — no boundaries found yet - Geophysics confirmed a 650m x 425m anomaly at depth (Feeder Zone)\n\n**Estimated High-Grade resource (coming in Q1 2026 MRE):** \\- 100-200+ million oz Silver at 400-500 g/t - For context: Cannington (world's largest silver mine) has \\~700 Moz lifetime production\n\n**Alex Davidson (VP Exploration) — What He's Seeing:**\n\n>\n\n**The Geology (Why This Matters):**\n\n|Features Seen|What It Means|\n|:-|:-|\n|**Argentotetrahedrite**|Primary silver mineral — coarse-grained, high-grade|\n|**Chalcopyrite throughout**|Copper sulfide — indicates magmatic source|\n|**IP Anomaly at depth**|Large-scale intrusive body = potential feeder zone|\n|**90%+ hit rate over 14 months**|Not random — continuous mineralized system|\n|**Open in all directions**|No boundaries found — deposit keeps growing|\n\n**Key Drill Intercepts (2025):**\n\n|Hole|Zone|Interval|Grade|Significance|\n|:-|:-|:-|:-|:-|\n|H25D-6070|Vortex|31m|438 g/t Ag|Highest-grade continuous intercept|\n|H25D-6068|Vortex|169m|Mineralized|Remarkable continuous zone|\n|Brimstone 2024|Brimstone|21m|2,400 g/t Ag|Bonanza grades|\n\n# Part 2: The Billionaire — Eric Sprott's $200M+ Bet\n\nEric Sprott made a billion dollars on Kirkland Lake's Fosterville discovery. He's doing the same pattern here.\n\n**His Buying Pattern (June 2025 - Jan 2026):** Look up 2176423 Ontario Ltd sec4 filing\n\n|Date|Shares|Price|Amount|Cumulative Cost|Mkt Value @ Date|What Might Be Known|\n|:-|:-|:-|:-|:-|:-|:-|\n|Jun 2025|6.35M|$3.50|$22M|$22M|$22M|*Initial thesis high grade discovery forming*|\n|Sep 2025|9.34M|$4.28|$40M|$62M|$67M|*IP survey confirms feeder zone*|\n|Oct 2025|7.69M|$6.50|$50M|$112M|$152M|*Early Brimstone drill results*|\n|Nov 2025|1.90M|$9.00|$17M|$129M|$228M|*Met study: 93% Ag recovery*|\n|**Dec 3**|2.34M|$10.30|$24M|$153M|$285M|*More Brimstone hits confirmed*|\n|**Dec 9**|480K|$11.88|$6M|$159M|$329M|—|\n|**Dec 12**|440K|$13.05|$6M|$165M|$370M|—|\n|**Dec 15**|—|—|—|—|—|📢 *Vortex H25D-6070 released (31m @ 438 g/t)*|\n|**Dec 17**|220K|$14.60|$3M|$168M|$418M|*Buying the Vortex news*|\n|**Dec 19**|150K|$16.31|$2M|$170M|$477M|—|\n|**Dec 24**|700K|$23.64|$17M|$187M|$714M|*Brimstone assays returning internally*|\n|**Jan 8**|125K|$26.27|$3M|$190M|$794M|*Estimated resource update likely known*|\n|**Jan 13**|4.67M|$6.00|$28M|$218M|$1.18B|*All warrants exercised — blackout imminent*|\n|**Jan 14**|200K|$33.21|$7M|**$225M**|**$1.17B**|*Final buy before blackout*|\n\n**Total Invested:** \\~$225M+  \n**Current Position:** 36.5 million shares (43% of company)  \n**Current Value:** \\~$1.64 Billion (at $45/share)\n\n**Conviction:** Eric exercised 4.67M warrants on Jan 13 2026, 20 months before expiration for 6$ wiring $30 million to Hycroft, he then **bought** another 200k shares on market open for 6m USD. **\\~36m USD added to a 1.2b position, up 10x and still buying.** He's buying shares as drills are being pulled out of the ground, while he may not know the hard grade numbers, his team is more than likely inspecting every drill bit coming and he throws in millions as the drills leave the earth. At 40% owner, he is the company and sees everything.\n\n# Part 3: The Timeline — Incoming Mineral Resource Update (MRE)\n\n**Management Guidance:** \\- \"Resource update coming out in the first quarter\" (Diane, Jan 20) - \"Two very significant silver discoveries not yet in our resource\" (Diane, Jan 20)\n\n**Expected MRE Release:** Jan 21-31\n\n**What the MRE will likely show:** \\- 100-200 Moz High-Grade Silver (at 400+ g/t) - Separated reporting of High-Grade vs Low-Grade domains - \"Open in all directions\" exploration target statement\n\n**Government:** \\- Silver has been added as a critical mineral for solar, EVs, and military electronics - Hycroft is 100% US-based — no China/Russia exposure - DOE loan program or strategic reserve purchase could be announced\n\n# Part 4: The Catalysts — What's Coming\n\n|Catalyst|Timing|Impact|\n|:-|:-|:-|\n|MRE Update (High-Grade)|Jan 27-31|\\+50-100%|\n|Government Support Announcement|Q1-Q2 2026|\\+30-50%|\n|Pre-Feasibility Study|H2 2026|\\+20-30%|\n|Takeout Offer|2026-2027|\\+30%+|\n\n**The Development Path (If High-Grade Proven):**\n\n`HG MRE Confirmed → Starter Mine → Immediate Cash Flow → No Dilution → Funds $1B Processing CAPEX`\n\n|Step|What Happens|\n|:-|:-|\n|**1. HG MRE releases**|100-200+ Moz @ 400+ g/t confirmed|\n|**2. Starter mine approved**|Small open pit on Brimstone/Vortex (confirmed in interviews)|\n|**3. Heap leach oxide cap**|Quick cash flow from existing infrastructure|\n|**4. Revenue funds development**|Internal funding = no dilution|\n|**5. Build sulfide processing**|Roaster or POX facility for high-grade|\n\n**The Barrick Option (Why Takeover Makes Sense):**\n\n|Factor|Significance|\n|:-|:-|\n|**Barrick's Turquoise Ridge**|Next door in Nevada — literally across the fence|\n|**Under-utilized roasters**|Barrick has excess roasting capacity|\n|**HYMC's sulfide ore**|Perfect feed for Barrick's roasters|\n|**No new CAPEX needed**|Truck ore to existing facility|\n|**Eric's exit strategy**|He's done this before — position for takeout|\n\n**Bottom line**: If the high-grade is real, Hycroft either: 1. **Self-funds** with starter mine cash flow (no dilution), or 2. **Gets acquired** by Barrick who needs feed for their roasters\n\nEither path = massive upside from $45.\n\n# Part 5: The Shareholding Structure — Why There Are No Sell-Offs\n\n**Major Shareholders (SEC Filings):**\n\n|Owner|Shares|% Ownership|Type|\n|:-|:-|:-|:-|\n|Eric Sprott (2176423 Ontario)|36,453,704|41.2%|Strategic|\n|Tribeca Investment Partners|6,615,366|7.9%|Institutional|\n|BlackRock Investment Management (UK)|6,000,000|7.4%|Institutional|\n|Schroder Investment Management|—|\\~%|Institutional|\n|Franklin Equity Group|—|\\~%|Institutional|\n|**Tier 1 Total**|—|**56.8%**|—|\n\n|Owner|Shares|% Ownership|Type|\n|:-|:-|:-|:-|\n|Libra Advisors LLC|—|\\~%|Institutional|\n|APAC Resources Limited|—|\\~%|Institutional|\n|Regal Funds Management|—|\\~%|Institutional|\n|Helikon Investments Limited|—|\\~%|Institutional|\n|Other Institutional + Insiders|—|\\~%|Mixed|\n|**Tier 2 Total**|—|**24.9%**|—|\n\n|Summary|%|\n|:-|:-|\n|**Total Institutional Ownership**|**81.7%**|\n|**True Retail Float**|**\\~18.3%**|\n\n**Why This Structure Matters:**\n\n1. **Sprott is Locked (41%)** — He can't sell, >10% owner means he has a 6 month lockup and selling any meaningful position will crash the stock. He's still buying. His only exit is a full takeover which he always aims for in the past\n2. **BlackRock's 6M Share Position** — This isn't a passive index fund holding and rumoured to be Evy Hambro UK team. BlackRock actively chose to hold 7.4% of a junior miner exploration on a conviction fund/client account.\n3. **Tribeca (7.9%)** — Australian hedge fund specializing in natural resources. They're long-term holders, not day traders.\n4. **81.7% Institutional** — Only \\~18% of shares are held by retail. When institutions own this much and none are selling, there's no supply.\n\n**The Price Dynamics:**\n\n|Factor|Effect|\n|:-|:-|\n|Low float (\\~30M shares)|Small buying pressure = big price moves (what we're seeing)|\n|Sprott adding, not selling|Largest holder is a buyer|\n|No short-term flippers|Patient, thesis-driven holders|\n\n**Why the Stock Doesn't Sell Off:**\n\nWhen a stock rises 13x (from $3.50 to $45), you normally see profit-taking. Not here. Why?\n\n* **Sprott's cost basis is \\~$5/share** — He's up 9x and still buying at $33. No exit pressure.\n* **Institutions bought for the takeover** — They're not selling before the a major is forced to buy\n\n# Part 6: The Risks\n\n|Risk|Mitigation|\n|:-|:-|\n|MRE disappoints|Eric's buying pattern suggests otherwise|\n|Metallurgical issues|Nov 2025 study showed 93% Ag recovery + potential roasting feasibility|\n|Commodity price drop|Silver has structural deficit (5 years)|\n|Execution risk|Diane has track record (built Romarco)|\n|Dilution|Higher stock = less dilution needed|\n\n# Part 7: Price Targets\n\n|Scenario|Share Price|Multiple from $45|\n|:-|:-|:-|\n|MRE Disappointment|$30-35|\\-20% to -30%|\n|MRE Meets Expectations|$70-90|1.5-2x|\n|MRE Beats Expectations|$100-130|2-3x|\n|Takeout (2026-2027)|$130-175|3-4x|\n\n# Positions\n\n\\-11k in shares, 50 in Feb 25$ calls, 45 in May 30$ calls\n\nUp: \\~+300k USD (Positions in SGD)\n\n[SGD - USD - SGD](https://preview.redd.it/inhny1s6smeg1.png?width=502&format=png&auto=webp&s=0355218a7e9680918048d3691e05c90a561f2c3d)\n\n  \n",
        "ticker": "HYMC"
    },
    {
        "post_id": "1qehhhj",
        "post_title": "Why Ironwood $IRWD will Make Your Port Hard (Your Next 3x Biotech/Pharma Play)",
        "text": "So before you go sleuthing through my profile, my 10+ year old account got nuked recently over some mildly controversial comments...So now I have this baby account and I'm not a bot and just want to put that out there first.  \n  \nAnyway, onto the DD...\n\nI'll keep this short, over the past few weeks, IRWD has seen two pieces of news that aren’t huge on their own, but together meaningfully improve the stock.\n\nLinzess sales blowout\n\n* \\-Q3 Linzess sales came in at **\\~$315–350M vs. \\~$250M expected**\n* \\-Ironwood receives **\\~33% of Linzess sales**\n* \\-That translates to **\\~$104M in revenue this quarter**, up from **\\~$85M last quarter**\n* \\-That’s roughly **+$20M per quarter**, or **\\~$80M annually**, above expectations\n* \\-This was a much larger jump than anticipated and strengthens profitability going forward\n\nPediatric label expansion\n\n* \\-Linzess received FDA label expansion for pediatric patients\n* \\-This makes Linzess the first drug available for this pediatric indication\n* \\-Expands the addressable market with limited competition\n* \\-Should further support future sales growth\n\nIn Summery\n\n* \\-Both updates are clearly bullish\n* \\-Revenue is already strong and now has an added tailwind\n* \\-There’s currently very little bearish news in the near term\n* \\-The next key catalyst will be the **upcoming quarterly report**, especially any updates on the pipeline\n* \\-There is mostly upswing with a potential of 2x-3x in the next 6 months. \n\nThat's it, pretty simple and easy play that I can see. \n\nNot financial advice — do your own DD. Good luck!\n\n  \nMy positions: [https://ibb.co/mrc8HRdp](https://ibb.co/mrc8HRdp)",
        "ticker": "IRWD"
    },
    {
        "post_id": "1qcozu0",
        "post_title": "DD: Alaska Airlines ($ALK) – Long dated puts on undisclosed loyalty thefts, and a $180M accounting anomaly",
        "text": "Ticker: $ALK\n\nPositions (proof: [https://imgur.com/a/f1NhZi9](https://imgur.com/a/f1NhZi9) ):\n\n\\- 400x ALK Apr 17 2026 $32.50 Puts @ $0.59\n\n\\- 250x ALK Apr 17 2026 $37.50 Puts @ $1.09\n\n\\- 500x ALK Apr 17 2026 $40.00 Puts @ $1.45\n\n\\- 200x ALK Apr 17 2026 $45.00 Puts @ $2.63\n\nTotal premium at risk: \\~$175k\n\n# Thesis: Crime Scene Investigation\n\nListen up bozos.\n\nYou know what is out of fashion? Competence.\n\nYou know what is in fashion? Organized crime syndicates stealing off Americans to give plane tickets to foreigners so they can fly into JFK in Business Class for $35.\n\nAnd you know who is letting it happen? Alaska Airlines - they know *all about it* but refuses to tell anyone because they are terrified of their own stock chart.\n\nThis isn't an airline. It is a distressed fintech with planes attached, run by cowards who are actively helping criminals cross the border to save their quarterly bonus.\n\n**I am Short Alaska Airlines. Here is the dirt.**\n\nBut if your smooth-brains don't want to read or think, just jam this [report](https://drive.google.com/uc?export=download&id=1YTOzp03oH-S21mcY0ZlbcXdRwcxd9ICq) into your AI and ask it if this is the ravings of a lunatic? It will tell you to short at the double.\n\n# 1. The \"Penalty Box\" Infinite Loop (Tech is F*cked)\n\nIn 2022, some poor guy had his mileage account drained so a random dude could travel in luxury. It was a last-minute ticket, and the hackers changed the notification email so the victim never knew until it was too late. ALK agreed to give his points back as a \"one-time courtesy,\" but then punished the **victim** by permanently banning them from booking online. They have to call a phone line (open 9-5) to use their own points forever.\n\nFast forward 4 years to 2026.\n\nThey haven't fixed a single line of code. It is the exact same robbery. Exact same response. Only now, hackers are running a train on Alaska.\n\nLook at the scoreboard:\n\n370 confirmed hacks on public forums in 2025.\n\n\"370? Who cares?\" you ask, wiping Cheeto dust on your wife's boyfriend's couch.\n\nListen to me. More than half of those came from the absolute nerdiest end of mile-sniffers. 41 came from a niche Chinese-language chat room (US Card Forum) with only 12,000 weekly visitors.\n\nThat is the tip of the iceberg. If 41 guys in a tiny Chinese forum got hit, the real number across the 12 million normies who don't check their accounts daily is in the **tens of thousands**.\n\nAn airline with tech so jacked they can't even stop randomers on the other side of the world from switching your email has no place in the modern world.\n\n# 2. The \"This is America\" Factor\n\nNow, I'm not a complete moron. I know how this works. Leaking 100,000s of data points and letting your best customers get beaten up as scapegoats? Ha, this is America. Nobody will care about that. Equifax leaked the whole country and the stock went up.\n\nBut this is more than that.\n\n# 3. The Accounting Riddle\n\nThings gets worse. The filings around the loyalty program have got lumps all over them too.\n\nALK Market Cap: $5.5B. ALK Loyalty Scheme Value: $12B (2024 investor day said so).\n\nBungle the loyalty scheme, the easiest free money printer you can dream of, and everything goes with it.\n\nWatch how they show the world they have no control of it.\n\nThe Q2 2025 Surprise:\n\nALK suddenly booked a $180M spike in loyalty liabilities out of nowhere. No revenue match. Just $180M dropped from the sky.\n\nThe Receivables Game:\n\nIn the same quarter, their receivables from Bank of America (their credit card daddy) spiked $195M.\n\nTranslation: Did Alaska tried to bill BofA for points for no reason. If they did it looks like BofA told them to pound sand. No explanation so who can say\n\nThe Real Puzzle:\n\nBy Q3, $120M of that receivable vanished from \"Current Assets\" and wormed its way into \"Other Non-Current Assets.\"\n\nLooks like something is being put in the basement hoping the SEC won't check the storage locker. Spoiler: They will.\n\n# 4. The Unapprehended Traveler (The Kill Shot)\n\nThis is the part that should put someone in handcuffs.\n\nAnd make the stock rock soon.\n\nRight now - literally today - there is almost certainly a foreign national jetting in on some poor Alaskan's hard-earned miles. So hard-earned that our hero victim actually spotted it! He called up Alaska! *\"Hey! There is a thief in seat 4A flying to Seattle right now!\"*\n\nThe thief must be a daredevil to take that risk, right? Wait until CBP takes him out back...\n\n**NOPE.**\n\nIt doesn't happen. The thief isn't brave; he's safe. **Because Alaska never tells anyone.**\n\nThere are cases where victims begged Alaska to call the police on a fraudster *who was literally in the air*, and Alaska refused.\n\nWhy?\n\nBecause an arrest creates a Police Report.\n\nA Police Report creates a Public Record.\n\nA Public Record proves a Data Breach.\n\nA Breach crashes the Stock.\n\nThey are choosing to facilitate organized crime and border violations just to keep the share price propped up.\n\nHow you think the Trumpisters gonna play this when they find out...\n\n# The Play\n\nThe assets are unexplained ($180M apparition). The tech is broken (no 2FA). The governance is cowardly (hiding the breach).\n\nPositions (proof: [https://imgur.com/a/f1NhZi9](https://imgur.com/a/f1NhZi9) ):\n\n\\- 400x ALK Apr 17 2026 $32.50 Puts @ $0.59\n\n\\- 250x ALK Apr 17 2026 $37.50 Puts @ $1.09\n\n\\- 500x ALK Apr 17 2026 $40.00 Puts @ $1.45\n\n\\- 200x ALK Apr 17 2026 $45.00 Puts @ $2.63\n\nTotal premium at risk: \\~$175k\n\nEDITED TO ADD:\n\n# DON'T FORGET - YOU DON'T HAVE MANY BRAIN CELLS. DON'T WASTE THEM AND WANG THE FULL THESIS DOWN YOUR LOCAL AI -  [HERE](https://drive.google.com/uc?export=download&id=1YTOzp03oH-S21mcY0ZlbcXdRwcxd9ICq)",
        "ticker": "ALK"
    },
    {
        "post_id": "1qc85ww",
        "post_title": "I Love Red Pussy Cats",
        "text": "\nSecretary of Defense, Hegseth’s drone dominance orders are favoring drone stocks and is a clear no brainer. \n\nThe order removed prior DOD policies from 2021 and 2022 that restricted the U.S. military from buying drones and components made by Chinese companies. It also assigns to combat units authority to buy, test and train with small UAS drones that comply with statutes, according to reports.\n\n\"While our adversaries have produced millions of cheap drones before us we were mired in bureaucratic red tape,\" Hegseth said in the video online. \"Not anymore.\"\n\nThe memo aims to bolster U.S. drone manufacturing by \"approving hundreds of American products\" for military purchase. It also calls to leverage private capital that supports the industry. The DOD plans to arm combat units with a \"variety of low-cost drones\" made by American engineers and AI experts.\n\nThe order will also expand the Blue List of DOD-approved unmanned drones, components and software, as part of a collaboration between the Defense Innovation Unit and the Defense Contract Management Agency, according to reports. The DOD in 2020 established an effort called Blue UAS, which is the process for certifying commercial drones for military use.\n\n\"Modern battlefield innovation demands a new procurement strategy that fuses manufacturers with our front line troops,\" the memo said.\n\nLastly, the DOD plans to integrate drones into relevant combat training starting next year, which includes force-on-force drone wars.\n\n\"Lethality will not be hindered by self-imposed restrictions, especially when it comes to harnessing technologies we invented but were slow to pursue,\" Hegseth wrote in the memo.\n\nThe announcement builds on a June 6 executive order from the White House to invest in drone technology and integrate it into the national airspace.\n\nIn December alone, they delivered 641 systems/drones part of the SRR contract, which the budget has increased from 70M to 800M. And further announced Q4 preliminary guidance of 25M resulting in over 1,800% YoY revenue.  \n\nFollowing news today, RedCat’s Black Widow just got approved for the NATO NSPA Catalogue signaling NATO countries likely to purchase RedCat’s drones. \n\nThey recently did an offering for 170M that got gobbled up by tutes and they exercised underwritten options a few months ago. \n\nIn December alone, they delivered 641 systems/drones. And further announced Q4 preliminary guidance of 25M resulting in over 1,800% YoY revenue. \n\nThere is also speculation that RedCat’s Black Widow involving its visual navigation thanks to Palantir strategic partnership was used to help capture Maduro with its anti-jamming technology. \n\nThey are also tapping in the USV, which I’m sure you’ve heard about as many russian vessels were taken down by these sea drones. Guess which compared acquired that exact product known as the Magura7 and started production in its brand new facility in Georgia? Yup. RedCat. \n\n\n\nTLDR: Drone warfare is here. American drone dominance is here. Plan to outpace China which means $$$$$ for drone industry. RedCat won SRR contract beating 30+ competitors for it. Meeting the supply demand for the contract. \nHas connections to current administration. Approved for NATO. Tapped into USV industry. Speculating to be used for the capture of Maduro. 1,800% YoY increase in revenue\n\nI am 15k shares long. ",
        "ticker": "RCAT"
    },
    {
        "post_id": "1qb1pi2",
        "post_title": "Either I get rich, or we all die. My current trading thesis - REDUX",
        "text": "Mods took down my last post after 200k views. No idea why. Wasn't selling anything, wasn't pumping tickers, just sharing my thinking. Whatever. Trying again with more focus on the macro and less on specific positions since apparently that's a problem.\n\n**What I think is happening:**\n\n* Trump needs the market to rip into midterms. That's it. That's the whole thing. Everything else flows from there.\n* Tax cuts, deregulation, defense spending, rate cuts, cash handouts to the base. He needs wins he can point to, and stock market go up is the easiest win there is.\n* Meanwhile nobody wants to test him right now. Maduro got snatched. That sent a message. Iran's not going to do anything crazy. Putin's going to wait and see. China's playing nice for the moment.\n* That buys a window where risk assets can run.\n\n**Then last night happened:**\n\n* DOJ opened a criminal investigation into Jerome Powell. The stated reason is testimony about some building renovation at the Fed. The actual reason, according to Powell himself, is that Trump wants lower rates.\n* Powell posted a video Sunday night. Direct quote: \"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president.\"\n* He said that. On camera. The Fed Chair publicly accused the President of using the DOJ to intimidate him into cutting rates.\n* Gold hit record highs overnight. Dollar sold off. Futures dumped. \"Sell America\" trade came back.\n* But by midday stocks had mostly recovered. Same pattern as Liberation Day tariffs. Selloff, panic, stabilization, back to business.\n\n**What this means:**\n\n* Short term: volatility. Markets don't like Fed independence being threatened. Chop ahead.\n* Medium term: probably bullish? If Trump gets his rate cuts, whether by breaking Powell or replacing him in May, that's rocket fuel for stocks. Bad for the dollar, bad for inflation eventually, but good for equities through 2026.\n* Long term: this is where it splits into two very different futures.\n\n**Path one, the pump:**\n\n* Trump gets what he wants. Rates come down. Housing unfreezes. Consumer spending picks up.\n* Defense budget passes. $1.5T proposed. Counter-drone, AI infrastructure, domestic manufacturing all eat.\n* Deregulation everywhere. Crypto rips. Tech rips. Everything rips.\n* Market pumps into midterms. People with risk assets do well.\n\n**Path two, the collapse:**\n\n* Trump doesn't stop at pressuring the Fed. He breaks it. Foreign investors lose faith in US institutions.\n* \"Sell America\" stops being a one day trade and becomes a trend. Bonds, dollar, and stocks all falling together.\n* Or he goes further. Starts taking territory, seizing assets from other countries, because the spending isn't sustainable otherwise. World wants to respond but can't, at first, because US military dominance.\n* Internal resistance builds. Coup, paralysis, who knows. Or we stumble into a real conflict. China moves on Taiwan. Russia escalates. Iran miscalculates.\n* Everything falls apart.\n\n**Here's the thing though:**\n\n* Even in path two, some stuff still works. Defense doesn't go down during wars. AI infrastructure still matters. Critical minerals become more critical, not less.\n* Unless it goes nuclear. Then none of this matters and we all have bigger problems than our portfolios.\n\n**Signals I'm watching:**\n\n* Fed independence. If Powell gets indicted or pushed out early, major red flag. Multiple \"Sell America\" days in a row means it's real.\n* Defense budget. $1.5T passes, defense names keep working. Stalls or gets blocked, time to reassess.\n* Supreme Court on Lisa Cook. Arguments this month on whether Trump can fire Fed governors. He wins, Fed independence is done.\n* Credit card cap. Trump floated 10% today. Banks cratered. If this happens, he's willing to break things for short term juice.\n* Foreign treasury holders. China and Japan start dumping in size, that's the real signal.\n* Gold. Already at records. Keeps ripping while stocks chop, smart money is positioning for something.\n\n**When I get out:**\n\n* Fed independence breaks and market prices it in over days, not hours\n* Defense budgets stall\n* Bonds, dollar, stocks all falling together for a week plus\n* Actual military conflict, not just talk\n\n**Where I'm positioned:**\n\n* Themes: defense, AI infrastructure, critical minerals, domestic semis, some housing\n* Mix of shares and longer dated options\n* Stuff that wins if Trump pumps, but doesn't completely die if things get ugly\n\n**Bottom line:**\n\n* Bull case: market pumps into midterms, I take profits in 2026\n* Bear case: system breaks, but defense and infrastructure still work because wars need supplies\n* Worst case: nukes, and nobody cares about stonks anymore\n\nI'm comfortable with those odds.\n\nhttps://preview.redd.it/8vloiyrehycg1.png?width=2001&format=png&auto=webp&s=8f126a3b7dc75338a4b693842129a96fa566b809\n\n",
        "ticker": null
    },
    {
        "post_id": "1qaldgn",
        "post_title": "Figma Bull Case",
        "text": "**I don't know why my post got deleted earlier but I would like to re-post anyway.**\n\nJust sharing my big picture point of view on Figma and get other perspectives from the community here.\n\nI think Figma is no longer the same company that Adobe tried to acquire for $20B. It’s definitely grown bigger (in terms of ARR + suite of AI offerings) and more disruptive than ever in the age of AI.\n\nWhat O365 is for productivity, Figma is for creativity.\n\nBy creativity, I don’t mean just being a design collaboration tool like what most consider it as, but an end to end digital product creation platform which is the anchor to my bullish outlook for this company.\n\nIn my opinion, they have moved past Adobe, Sketch, and others as they are the clear industry leader now in the product design space and have now set their sights on Cursor, Lovable, and other AI coding platforms.\n\nMy big bet is they will win because those tools are largely single-player and code-first with no enterprise lock-in moat.\n\nThis was further solidified when I saw Google invested. Institutions are positioning and the stock seems to have found a floor despite lock-ups expiring.\n\nHere are my supporting theses:\n\n1. **Figma beat Adobe XD, Sketch, and others because it was a multiplayer platform by design, not because it packed more designer features.**\n\n* Browser native\n* Real-time collaboration\n* Design systems \n\nScalable product development is inherently collaborative. This is Figma’s premise, and this is why Cursor, Lovable, and others will hit the ceiling in enterprise environments.\n\n2. **Adobe offered $20B to acquire Figma in 2022, before AI coding platforms became cool.**\n\nAt that time: \n\n* ARR was rougely \\~$400M\n* Figma was just a design collab tool\n* AI wasn’t core to the product story yet \n\nFast forward:\n\n* ARR now \\~$1B+\n* Product suite has expanded massively\n\nThat it is valued below what Adobe was willing to pay then seems interesting. And what led me to frame this POV.\n\n3. **Enterprise Lock-in.** This may be the most under-appreciated part. The enterprise has standardized around Figma which means hiring for positions include (“must know Figma”) along with process and governance changes which are hard to break.\n\nSwitching becomes organizationally painful. This enterprise lock-in is a massive advantage and what will drive them to win despite the early advantages of AI coding platforms. Think how Microsoft Teams won vs Slack, in the end. But this time, with a much bigger value proposition in Figma in its coherent AI strategy and inherent multi-player strength that other platforms won’t be able to compete with. \n\nNot to mention the amount of legal, security, and privacy requirements they need to deal with in order to activate scale in an enterprise. Figma is already there. \n\n4. **Complete AI Co-Creation Suite.** While most companies slap AI on top, Figma does something far more intentional. It is taking the entire product development lifecycle and weaving every step together from ideation (**Figjam**), design & prototyping (**Design**), build (**Make**), and deployment (**Site**) of apps with AI, all with the affordance of human agency and curation in the process.\n\nOne commenter from my earlier post highlighted that Figma have acquired PayLoadCMS last year. This will help them accelerate a \"design to CMS-powered website\" workflow that will eat away from platforms like Wix, Squarespace, and WP.\n\nIf you think about what Cursor and Lovable did is hard. It is really not. What’s hard is integrating features in a way that feels complete, cohesive, and easy-to-use.\n\nHow many enterprises will risk having a disjointed design and development tooling ecosystem when they can have everything in one platform? \n\n5. **The role of the designer and developer are converging.** One way to look at it is, the pool of seats (i.e. TAM) became larger as designers get into engineering work while developers get into design.\n\nThis is powerful as the most value will always come from the most creative of endeavors, not the fastest created but looks cookie-cutter.\n\n6. **A potential acquisition target to big tech giants.** Now this is highly speculative but:\n\n* What if google wanted a true end-to-end product creation stack \n* What if Microsoft wanted to own creation beyond Office\n* What if Amazon wanted a creative + dev OS \n\nThere are very few platforms that sit in the intersection of enterprise, creation, collaboration, AI, and design systems. That scarcity matters. \n\nThe potential for big acquisition is not far-fetched.\n\n**Personal position:** I’ve been accumulating shares since the stock hit its floor at around \\~$34 and believes this will have a big move, once investors catch on to the true potential.\n\nAdding a screenshot of my position just to show that I have skin in the game, and I'm invested for the long-term.\n\nhttps://preview.redd.it/y6ibblhjjucg1.png?width=1510&format=png&auto=webp&s=46c3008b75de95c648a3c80540b0cb65ae6d3ad8\n\n",
        "ticker": "FIG"
    },
    {
        "post_id": "1qad939",
        "post_title": "$RKT 99.99%: MBS God-Candle Lit at $23 🚀",
        "text": "9,020 shares. 99.99% of my account. Not a single share has moved since my [original YOLO](https://www.reddit.com/r/wallstreetbets/comments/1m6vxil/tastes_like_2021_again_130k_yolo_on_rkt_9999_of/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). 💎🙌\n\nI called this at $16. We’ve already lifted to $23, but I’m not even thinking about selling.\n\nThe \"MBS God-Candle\" just ignited. Trump just ordered a $200B mortgage bond buy, pushing 30-year rates under 6% overnight. The Trump administration is perfectly aligned with $RKT because housing affordability is a top agenda item. Institutional giants and advocates like Bill Pulte and Bill Ackman are already vocal about crushing these spreads to force affordability.\n\nThe real alpha for 2026 is Rocket’s transformation into a tech-driven financial powerhouse. By integrating the Redfin search funnel and Mr. Cooper servicing book, they now own the entire Search-to-Close lifecycle. As the market realizes Rocket scales like a SaaS company rather than a cyclical bank, I'm expecting massive multiple expansion.\n\nI like the stock even more than before. I still like rockets. See you regards on the moon. 🚀🚀🚀",
        "ticker": "RKT"
    },
    {
        "post_id": "1qa14rw",
        "post_title": "Silver moonshot yolo on Pan American $PAAS",
        "text": "I'm young and naïve enough to think that this time's parabolic rise in silver is different from the short-lived prior runs like those from 2011 or the Hunt Brothers.\n\nMichael Lynch's work has shown that bullion banks, contrary to their behavior in prior silver spikes, have bought into strength this time around, as opposed to 'selling at the highs' in silver contracts: [https://econanalytics.substack.com/p/bullion-banks-are-a-key-driver-of](https://econanalytics.substack.com/p/bullion-banks-are-a-key-driver-of)\n\nI see this as akin to positioning around the 2008 subprime mortgage crisis, in which many banks initially caught off-sides on credit default swaps, then repositioned to take advantage of the mounting crisis, before the mortgage marks were allowed to hit the tape.\n\nThat the bullion banks are going long into this parabolic rise in silver suggests to me that this could be the prelude to a far more material revaluation in the silver price, after bullion banks have fully repositioned on the long side.\n\nFor further background on the fundamentals of the silver market, I highly recommend reading through Alexander Campbell's Substack, which he generously provides for free drawing upon his experience as commodities head at Bridgewater: [https://www.campbellramble.ai/p/my-meandering-path-to-silver](https://www.campbellramble.ai/p/my-meandering-path-to-silver)\n\n**Why Pan American Silver $PAAS?**\n\n[Handsome Silver Miners](https://preview.redd.it/2sos1n8ueqcg1.png?width=800&format=png&auto=webp&s=7d1db3b82eefef36084f6d782fd8fd8b055393c9)\n\nBecause Rick Rule likes the stock, this is the primary reason. Who is this guy Rick? I can personally attest that commodity stocks he likes have a tendency to levitate without bounds; it doesn't really matter if he uses technical analysis or voodoo magic to divine the trajectories of mining stocks, as long as it works.\n\n[Pan American Founder and real-life Indiana Jones global explorer](https://preview.redd.it/kc04vtineqcg1.png?width=400&format=png&auto=webp&s=c3a5cf554ce0a09d3e05c2150633b2b7cdb3c70a)\n\nThe secondary reason I choose Pan American is that in addition to being a fundamentally strong, high cash flow enterprise, $PAAS holds three massive non-producing silver mega-projects across LATAM: Navidad, Escobal and La Colorada Skarn. While these projects contain ludicrous amounts of silver, they have remained dormant for decades sitting on the company's books because of extraordinary capital intensity as well as regulatory & community based opposition, as a result their incredible value is not appropriately reflected in Pan American's valuation.\n\nHowever recent American big-stick resource 'diplomacy' across the Americas suggests a far more interventionist stance in promoting regional resource extraction irrespective of local opinions. This can be seen in recent American adventures in Venezuela, as well as rhetoric and kinetic asset repositioning around Colombia, Greenland and Mexico.\n\nGiven that silver has incredibly important applications in modern tech from high-performance batteries and solar panels needed to compete with Chinese power infrastructure, as well as silver's critical role in advanced weaponry such as patriot missiles and torpedoes, I would presume that future American adventures in Mexico and other LATAM jurisdictions will involve a certain predisposition towards securing and enabling silver production.\n\nIn terms of moving the needle on regional silver production in the relatively near term, Pan American's three major silver projects sit at the forefront of policy considerations. Escobal was a fully functioning, monster silver mine in decades past, mothballed only due to non-technical, social/legal considerations. La Colorada Skarn is a monster silver deposit right next to ongoing, world-class silver mining operations with excellent regional infrastructure and talent. Navidad is another monster silver deposit under a highly supportive, newly rationalized Argentinian government.\n\nIf America decides it needs to ramp up silver production anytime soon, which I believe should've been yesterday, Pan American Silver's trio of mega-projects may well be among the principal beneficiaries of such industrial policy.\n\n**Disclosure and positions**: I've been long the stock for a while and now hold a fair bit of calls. Take my opinions with a boulder of salt as I am not a financial professional in any capacity.\n\nhttps://preview.redd.it/bbrctcn5gqcg1.png?width=1602&format=png&auto=webp&s=48dcda0264b8aa5abaa88a55711b58113897aebf",
        "ticker": "PAAS"
    },
    {
        "post_id": "1q7avib",
        "post_title": "KO DD: Defensive Cash-Flow Play in a Volatile Market",
        "text": "Picked up 500 shares of KO @ 67.45.\n\n**Thesis:** In a volatile macro environment, capital tends to rotate into defensive names with consistent cash flow. KO generates \\~$10B+ in annual FCF, has pricing power globally, and is a dividend aristocrat.\n\n**Valuation:** Trading \\~23x earnings, roughly in line with historical averages. Dividend yield \\~3%.\n\n**Catalysts:** Rate cuts, defensive rotation, pricing increases in emerging markets.\n\n**Risks:** Strong USD impacts international revenue, declining soda consumption in developed markets.\n\n**Position:** 500 shares @ 67.45 \n\nNot expecting moonshots — just steady returns (even a Swing trade is fine as long as I make small profit). Position attached. Who's with me?\n\nhttps://preview.redd.it/jo8100gsf4cg1.jpg?width=921&format=pjpg&auto=webp&s=dd45c886e797adc76bb2651f091fb0850bdfbec1\n\n  \n",
        "ticker": "KO"
    },
    {
        "post_id": "1q61elv",
        "post_title": "Going balls deep on GOOG thanks to insiders on Polymarket",
        "text": "There was a post here a few weeks ago of the Google insider who predicted the day that Gemini 3 would drop and all of Google’s search trends. They were right.\n\nOn its own, that's nothing magical, but, they also predicted dozens of other markets correctly that could only be known using insider information.\n\nFor example:\n\n* \\#1 most searched movie on Google (8 cents -> 100 cents)\n* Gemini Flash not released by December 15 (23 cents -> 100 cents)\n* \\#1 most searched athlete (35 cents to 100 cents)\n* \\#2 most searched person (21 cents to 100 cents)\n\nThere’s only one explanation, they are a Google employee making bank off insider information.\n\nAnd it just so happens, a few days ago, the same account is back putting money on Gemini getting *at least* a 50% score on FrontierMath’s Benchmark.\n\nhttps://preview.redd.it/21r2mjjovtbg1.png?width=1018&format=png&auto=webp&s=bf1b72e9042f0f961002a4a8997b31253a5eb1f6\n\nSo… that’s all cool and shit but how do I profit? Well let me explain it for you simpletons:\n\nI'm loading up on GOOG calls at open, AI is \\*\\*\\*the\\*\\*\\* market cap driver right now, and with the Gemini 3.0 release, everyone knows Google is slightly ahea\n\nBut, if Gemini can score 70%+ on FrontierMath? That's a whole other ball game. That takes AI from helpful chat assistant to potentially publishing papers.\n\nhttps://preview.redd.it/9j6ely6mvtbg1.png?width=1076&format=png&auto=webp&s=998d5e6ddafc61f817107feb4dba4995b4f64342\n\nhis is a huge deal if this insider is right. They singlehandedly moved the odds from 8 cents to 45 cents. Conviction is balls deep and everyone knows they know something.\n\nEven if they're wrong, Google is mopping the floor with everyone else, it's not even a competition. I'll have to roll my calls over to LEAPs if they don't hit in the next month.\n\nLong live Google, death to NVDA, and thank you Google insider for the free loot.\n\nInsider profile: polymarket user @ beepboopzyx",
        "ticker": "GOOG"
    },
    {
        "post_id": "1q5ji8k",
        "post_title": "FDS (FactSet): The Only FD That Won’t Blow Up Your Account",
        "text": "**TL;DR**\n\nFactSet is being valued as if its core business is weakening, despite decades of consistent, subscription-driven growth and high customer retention. The company continues to generate predictable cash flows through multiple market cycles, while current valuation reflects unusually low expectations. The opportunity here is it is mispriced as risk due to AI, but it will remain durable. \n\n**Background**\n\nFactSet sells financial data and analytics to institutional investors, asset managers, wealth firms, and corporates. Its product is embedded in client workflows, which makes switching painful and churn low. For this reason, retention stays high even when asset managers are under pressure, cutting headcount, or seeing AUM decline.  FactSet’s revenue doesn’t depend on optimism or inflows — it depends on necessity. Most revenue is subscription-based, which gives the business strong visibility and predictability.\n\nThat model has worked for a long time. FactSet has now grown revenue every year for over four decades.\n\n**Recent Earnings**\n\nIn its most recent fiscal year (ended August 31, 2025), FactSet reported:\n\n\t•     Revenue of $2.32B, up about 5% year over year\n\t•\tOrganic Annual Subscription Value (ASV) growth of ~5.7%\n\t•\tNet income of ~$597M, up ~11%\n\t•\tGAAP EPS of $15.55, up nearly 12%\n\t•\tContinued strong free cash flow, alongside dividends and share buybacks\n\nGuidance for FY 2026 calls for 4–6% organic ASV growth and revenue of roughly $2.42–2.45B.\n\n**Why Stock is Low**\n\nMargins have come under pressure, mainly from higher compensation and ongoing technology investment. FactSet, however, isn’t spending defensively — it’s spending to deepen the product and expand how clients use its data.\n\n**Why that Doesn’t Matter**\n\nA key point that gets overlooked is that FactSet owns and curates a large portion of its proprietary data. That matters in an AI-driven environment. Many competitors rely more heavily on third-party data, which limits pricing power and flexibility when new tools are layered on top. FactSet’s approach allows it to integrate AI into workflows without giving away the core asset that clients are paying for.\n\n**Position**\n\n\n\n\n",
        "ticker": "FDS"
    },
    {
        "post_id": "1q5fu67",
        "post_title": "SentinelOne (S) Getting Flexed by CRWD – Holding 500 Shares, might go all-in, Here's Why",
        "text": "\n\nhttps://preview.redd.it/nbn26k51ppbg1.jpg?width=921&format=pjpg&auto=webp&s=5f6256bfd6da5954519af3453169289e73acf5e4\n\nDear Regards,\n\nHolding 500 shares of SentinelOne (S) at $14.57 avg. \n\n2Y chart's a dumpster fire, down from $30 highs, thanks to CrowdStrike's (CRWD) Falcon Flex eating their lunch.\n\nFalcon Flex TL;DR: CRWD's mix-and-match subscription model – fast deployment, lower costs, massive ARR growth ($4.92B, +23% YoY). Crushing competitors like S in endpoint security; MITRE tests show CRWD superior.\n\nThesis: S undervalued, strong AI tech with great clients like Tesla, but short-term pain. Holding for rebound or acquisition.\n\nPosition attached. Thoughts?",
        "ticker": "S"
    },
    {
        "post_id": "1q4qd2q",
        "post_title": "SEZL is the BEST setup for 2026: Flipping the Script on BNPL",
        "text": "TLDR: Sezzle (SEZL) is one of the best setup stocks going into 2026. \\~15 Forward P/E for 2026 w earnings growing \\~30%. Discounted due to subprime BNPL sentiment but it will push through. **I own SEZL and am buying at these levels.**\n\nIt is rare to find a company growing its top line at 76% while maintaining 28% net income margins, and it is even rarer to find it trading at just \\~14x forward earnings. Sezzle (SEZL) is that company. Sezzle provides flexible, consumer focused ‘Buy Now, Pay Later’ financing and credit-building tools specifically designed for the underserved market. While the headlines focus on subprime fears and regulatory noise, Sezzle has executed a profitable growth strategy, pivoting to a high-LTV subscription model that self-funds its own expansion. The setup here looks very attractive. You have a founder-CEO, Charlie, who has his entire net worth in the company, owning roughly 44%, 2.4 million pre-split shares (approx. 14.4m post split), and has never sold a share… plus, he regularly quotes Buffett and Munger:\n\nhttps://preview.redd.it/63d8cbn54kbg1.png?width=1179&format=png&auto=webp&s=87a401c25b749b3fd525cb5fe4f0fad0764ff665\n\n# BNPL vs Credit Cards\n\nProbably contrary to most, I am of the opinion that properly run BNPL is entirely more ethical and consumer supportive than credit cards, but the credit card industry has created a sentiment that using BNPL is somehow buying things that you can’t afford when in reality America lives on credit cards that now charge 28% as a standard when it used to be like 12-15%. The amount of headlines citing BNPL usage while ignoring that BNPL has existed for decades in the form of Credit Cards is mind blowing. Headlines citing BNPL use to buy groceries straight up ignore the fact that the majority of American shoppers are swiping their credit cards for everything.\n\nIf you polled me, nearly 100% of my spending would be using BNPL in the form of credit cards regardless of the fact that I pay them off weekly and do so for added purchase protection, travel rewards, etc.\n\nUnlike a credit card, SEZL refuses to allow additional BNPL purchases if there is an unpaid balance. They also have the ability to remove buying power instantly in the event of a downturn where credit cards typically need to give 45 day notice.\n\n# Consumer-Sided vs. Merchant-Sided\n\nA few years ago, Sezzle switched from the typical “merchant-sided” BNPL model which works primarily through the seller, to a consumer-sided model which differentiates them from competitors like Affirm. SEZL is inherently focused on being a consumer-friendly, consumer driven experience. They charge the consumer. SEZL’s pitch towards consumers is that it is a financial wellness tool - accessible, budget flexibility, and a way to build credit with Sezzle Up vs revolving Credit Card exposure. The app is extremely user friendly and is a promotional store that encourages return to app for browsing - offering promos, price comparisons, featured products etc.\n\n**Merchant Sided**: Driven by merchant access and promotion. Merchants participate to increase sales but the BNPL eats into merchant margins to provide a benefit and has inherently lower margins itself.\n\n**Consumer Sided**: SEZL flipped the script and essentially developed an underwriting and approval process for the consumer. It is consumer-driven rather than merchant-driven.\n\nBecause of this, Sezzle operates in the wallet of the consumer. Things like the Sezzle Anywhere subscription essentially allow it to be used anywhere Visa is accepted, rather than the consumer having to hunt for a merchant where SEZL is accepted.\n\nAnother notable difference to Affirm is that Affirm is focused primarily on merchant partners that have higher value ticket items. Affirm has much longer term product focus that rivals traditional loans etc with 6-12-24 month plans and interest. They do offer the traditional pay-in-4 but its focus is higher ticket. This is why their AOV is significantly higher than SEZL’s.\n\n# Customer\n\nSezzle targets subprime and near-prime consumers, a bit more ‘risky’ but they are very selective in who they approve and are serving a population that is underserved by both credit cards and other BNPL.\n\nThey utilize AI and new infrastructure to risk-assess users that traditional banks reject. SEZL allows users to opt-in for credit reporting and pitch it as a tool to build credit via Sezzle Up. They reward responsible use with increased access, but they have strict usage limits, you cannot use Sezzle if you have an unpaid or overdue balance.\n\nUnlike traditional credit cards that might give a $3,500 limit immediately, Sezzle starts with micro approvals of \\~$50 and allows users to increase their lines of credit with responsible usage. The company is big on promoting Sezzle as a budgeting tool to spread a single cost over 6 weeks, not a way to rack up revolving debt at 28% APR.\n\nSEZL says they differentiate themselves with proprietary non-FICO approval methods, monitoring, limits etc.. there is inherent risk here and it comes down to if that is legit or not - if it’s just talk during good times or it will hold up during tough times.\n\n# Financials\n\nManagement prides themselves on efficient growth, prioritizing profitable growth strategies. One of SEZL core principles though is extremely efficient cost control and expenses. They pride themselves on it to expand leverage. They are a huge turnaround story because their prior business model failed and they had to ruthlessly cut expenses and now they pride themselves on their efficient use of money. On the calls I’ve listened to he regularly refers to how certain companies just burn cash in the name of ‘expansion’\n\nIn Q2 Management recently noted:\n\n“With top line growth of 76% YoY, gross margins of 61% and a net income margin of 28%, we remain well ahead of the Rule of 40 and our own version, the Rule of 100, where we scored a 165 this quarter.”\n\nhttps://preview.redd.it/l7668uj94kbg1.png?width=1026&format=png&auto=webp&s=fd2ccad7ee085ec4ffbe96692e72e62be18d39b0\n\n**History of Raising Guidance**: Split-adjusted guidance for FY24 started at $2.00. It moved to $2.50-$3.00, then $3.25, and recently to $3.52. Preliminary guidance for next year is already at $4.35.\n\n**Valuation\\*:** We are looking at a \\~18.40 TTM and a FWD PE of 14.20 based on FY26 guidance of 4.35 EPS.\n\n**PEG Ratio:** SEZL is trading at a FWD PEG of 0.60. For reference, a PEG of <1 is generally considered undervalued. (PEG ratio is a valuation calculated by dividing a stock’s Price-to-Earnings (PE) ratio by its expected earnings growth rate, adjusting the PE to show whether a company is undervalued or overvalued relative to how fast it is expected to grow earnings.)\n\nhttps://preview.redd.it/uxmvxtoa4kbg1.png?width=1600&format=png&auto=webp&s=cfec125f54babf92714289c4d388a0bb52596354\n\nNOTE: the drop in Sezzle’s (SEZL) Q2 2025 TTM (Trailing Twelve Month) EPS drop is primarily due to a **one-time significant tax benefit in Q2 2024** rolling off the twelve-month calculation. **Operating Income actually grew by 116%** year-over-year (from $16.7M in Q2 ‘24 to $36.1M in Q2 ‘25).\n\nhttps://preview.redd.it/zqfsyuac4kbg1.png?width=1600&format=png&auto=webp&s=50344b30ce3ca167273f1981b2b661925a66ae1e\n\nhttps://preview.redd.it/7sxebcqc4kbg1.png?width=1600&format=png&auto=webp&s=cb19d03a17f2ef8fc5338f663d61f00b99104738\n\nhttps://preview.redd.it/b8ddc15d4kbg1.png?width=1600&format=png&auto=webp&s=0b554168416ac7e29abbe1bc39a92663bdde11cd\n\nUnderlying SEZL’s operational momentum is its balance sheet that separates it from more levered peers. As of Q3, SEZL reports a cash position of $134.7m vs $118m in debt for a net cash position of $16.7m and a healthy Total Debt/EBITDA ratio of 0.76. In addition, the company recently expanded its credit facility to $225m. With an interest coverage ratio of 17x and a Return on Equity of 90%, SEZL is using its capital to efficiently and profitably grow.\n\nWhile Affirm has recently become slightly GAAP profitable, Klarna has shifted back to a net loss. Sezzle differentiates itself with superior capital efficiency, a \\~36% Operating Margin and \\~27% Net Income Margin, providing a cushion against macroeconomic headwinds that its high-volume, thin-margin competitors do not possess.\n\nhttps://preview.redd.it/zn19cv6e4kbg1.png?width=1600&format=png&auto=webp&s=34578669288eaa2584a57455d27430e884e4abc8\n\nAdditionally, SEZL has crossed an inflection point and has been Free Cash Flow positive since Q1 2024 providing ample cash generation for growth and flexibility. To highlight SEZL’s focus on profitability, it is important to note that rapid growth fintech lenders typically have negative cash flow as they send cash out to merchants faster than they receive paybacks. This is not the case with SEZL, despite increasing Gross Merchandise Value by 58%, they continue to post positive cash flow. SEZL’s short payback period of 4-6 weeks allows it to fund organic growth without the need for external cash burn. They are successfully self-funding their 58% GMV growth.\n\nhttps://preview.redd.it/8oayna2f4kbg1.png?width=1600&format=png&auto=webp&s=60da9acfc454778a7184c5b8984b136e269622ab\n\n# Q3 Earnings\n\nI thought results and call were good. There was a slight uptick in provision for credit losses to 3.1%, but with SEZL new customers get higher provisions as they don’t have a history with the company, it’s almost like a CAC/marketing expense.\n\nCharlie clarified it’s right where they anticipate though, that On Demand also increased it a bit due to more new customers, but that their guidance has been clear and they are in line for full year. He basically said ‘we guided full year and we were under it Q1 and Q2 so that implies it will be higher in Q3 and Q4, that should be understood.’\n\n\n\nhttps://preview.redd.it/3fq201kg4kbg1.png?width=498&format=png&auto=webp&s=f059c78eacf910d0e7febae7283a0ec8993a1f64\n\nI also don’t hate small proactive upticks in credit loss provisions, I’d much prefer that than under provisioning for losses as any over provision results in smaller future provisions to balance them out.\n\nMonthly On Demand and Subs (MODS) grew 48% YoY Active consumers grew 11.4%. GMV grew 58.7%\n\nRevenue grew 67% YoY and adjusted net income was $25.4M this quarter, up 53% YoY.\n\n\n\nI also don’t hate small proactive upticks in credit loss provisions, I’d much prefer that than under provisioning for losses as any over provision results in smaller future provisions to balance them out.\n\nMonthly On Demand and Subs (MODS) grew 48% YoY Active consumers grew 11.4%. GMV grew 58.7%\n\nRevenue grew 67% YoY and adjusted net income was $25.4M this quarter, up 53% YoY\n\nhttps://preview.redd.it/tg1h40wi4kbg1.png?width=1179&format=png&auto=webp&s=3f90521cdbf37eb1c45260b4fbbbd086affaf449\n\nhttps://preview.redd.it/lgp4hf9j4kbg1.png?width=1179&format=png&auto=webp&s=c80c2087b6ccbfbf64aaabbf716f503da1eb2e11\n\nhttps://preview.redd.it/uzml2cmj4kbg1.png?width=1179&format=png&auto=webp&s=323fa99713ab0b927c16240d6d7d1ffdd74e16d4\n\n**Why is Revenue growing at >60% but active consumers by 12%?** Active consumers means they have made a purchase on SEZL. The real driver of revenue growth is subscriptions. It’s much more in line growth rate if you view it from that lens - 67% vs 48%. Last quarter it was 62% YoY MODS (monthly on demand and subs). They were marketing on demand big time as a driver they hoped would convert to subs faster. They noticed the conversion wasn’t happening as much as they liked so they cut back on the marketing spend to pivot going forward, noted as a reason for growth change. Refocusing on prioritizing subs. On demand is still accretive and is offered to people hesitant to subscribe but they want to focus more on lifetime value which is in a sub over on demand. In addition - SEZL mgmt lives by the idea of profitable growth. They stress it on all the calls. Q4 is also historically a supercharged growth quarter because holidays etc. so there will likely be a spike in user growth. I think of Active consumers as “the universe that has been introduced to Sezzle” - this pool was built with growth/exposure first in mind - and then they try to transition them into subscribers - growing the pool of high value long term value consumers. So the “active users” can slow down as long as MODS continues to grow as the margin of MODS is much higher than a transaction consumer. The gap remains 2971-784=2,187 Active Users that are not MODS/Subscribers. MODS is currently 26% of actives. Last year Q3 it was 19.8%. So they are eating into this pie, converting to higher value customers which is driving revenue and profit growth with leverage vs active customer growth.\n\nRevenue can grow faster than consumer base with more subscriptions, more transactions (avg purchase growing from 5.4 to 6.5x). Also, the more transactions the more merchant fees so if customers grow 10% but GMV grows 20% the increased volume results in greater revenue growth via transaction fees. GMV grew 58.7%, subscribers made 10x more transactions, and there is cross selling new products (fee for credit building product etc).\n\nSEZL’s Formula for Leveraged Growth: Base consumer growth + conversion to high value subscribers + cross selling products to increase customer LTV + increase usage/GMV + growing take rate = fuel for revenue growth at leverage greater than base consumer growth. Take rate is 11.2%, increasing 60bps YoY.\n\nWith a pivot to higher-margin subscriptions (MODS), a growing take rate (\\~13%), and a rapidly increasing EPS forecast, I feel Sezzle is fundamentally sound.\n\n# Q4/Q1 Accounting\n\nIt is important to note, SEZL has some funky Q4 Holiday Season accounting so it is important to bake it into expectations. There were previous sell-offs seemingly based on investor misinterpretations of this.\n\n**Q4:** In Holiday seasons there is typically **a m**assive GMV spike. Sezzle must provision for losses immediately in Q4 to account for the risk. This depresses the net income for the Q.\n\n**Following Q1,** Revenue is recognized when paid (fees/payments). Since Sezzle is a a 4-6 week BNPL payoff, the revenue from the Q4 holiday spend is actually received and recognized into Q1. Q1 often shows lower GMV but all-time high Revenue.\n\nGAAP accounting requires them to provision for losses in Q4 but not recognize the revenue until Q1. This creates weird QoQ comparisons, but if you look at the cost of transaction processing relative to revenue, gross margins remain north of 60%.\n\nhttps://preview.redd.it/momy2xjl4kbg1.png?width=978&format=png&auto=webp&s=e566298094dfa3d6d3308a24843577e327e4a567\n\n\n\n# Risks\n\nThere is a valid concern regarding consumer pressure and risks associated with subprime focused lenders/BNPLs. This negative sentiment seems to be particularly high lately with spillover from subprime auto and student loan debt headlines. IMO, BNPL is apples and oranges compared to those long-term debts. Obviously increased downward consumer pressure will ultimately affect all credit type products, but in the short term I think the impact is different.\n\nBNPL is very short term in nature - particularly SEZL - and as management would argue, they are “more of a budgeting tool to spread a single cost across 4 weeks,” rather than a traditional credit product.\n\n1. It’s much easier to pay $120 total over 4 weeks than it is to pay $500 car loan or $300 student loan.\n2. Short term in nature provides the ability to resolve in the short term. 4 $30 payments is much more achievable than a recurring $300 and $500 payment monthly for 12-36-indefinite months.\n3. BNPL is a conscious decision to spend $X amount of dollars in a single purchase vs having made a probably inappropriate long term commitment to something that is unaffordable.\n4. There is almost an anti-student loan sentiment with recent grad unemployment and also a build up of unexpected loan repayment following all the talks about forgiveness.\n5. BNPL can also be a symptom/result of those delinquency rates as people turn to non traditional credit as their traditional access is impacted, maxed, or unavailable. And in turn prioritize maintaining access to liquidity of ability to access BNPL for everyday needs by ensuring they pay it off as companies like SEZL do not allow follow up loans without payoff.\n\nUltimately - i am not arguing BNPL is immune but providing some insights on the lack of visible impact right now. I believe there’s a host of financial and psychological reasons from different perspectives that actually make BNPL resilient to the delinquency numbers we see in things like cars/student loans.\n\nAlso - pulling from an old Value Investors Club write-up on SEZL, the author noted that in a conversation with the SVP of IR reflected that: “Sezzle is not afraid of a recession. Their customer is already in distress. Moreover, they expect more people to use BNPL services if the economy goes bad. Because Sezzle’s target is subprime customer they are not afraid of Apple Pay Later or PayPal Pay-in-4 as competition.”\n\n\n\nhttps://preview.redd.it/jaz3eqvm4kbg1.png?width=1179&format=png&auto=webp&s=132bb12f85151297a3abebe31fab16cfaac4998b\n\nNonetheless, despite my above points, there is a real risk in the cyclical nature of BNPLs. A recession or prolonged consumer weakness will impact SEZL via GMV compression and credit degradation. SEZL’s revenue is directly tied to GMV and as such, if customer spending contracts, revenue growth could meaningfully decelerate. And while SEZL’s loss provisioning has remained sufficient in the 2.5-3% range, a true recessionary environment will put their underwriting process and credit provisions to the test. Fortunately, because of wide-spread negative sentiment regarding the subprime space, I feel much of this is presently baked into SEZL’s compressed multiple and the upside outweighs the downside risk.\n\nIf you are interested in SEZL, I think the current price provides a great entry point with significant upside potential, but keep in mind this stock has proven to be very volatile.\n\nAt these valuations SEZZLE is setup to be a potential multibagger.\n\n**ALSO - CFPB agrees BNPL negative sentiment is overstated:**  \nThe CFPB finds that \"BNPL imposes significantly lower direct financial costs on consumers than legacy credit products.\"\n\nhttps://preview.redd.it/t7uku0735kbg1.png?width=529&format=png&auto=webp&s=3e9956e22b13be2c06cb63f5d26de562a66c997c\n\nBNPL losses are now less than half of the legacy credit cards it replaces signifying the strength of the underwriting.\n\nCharge-offs went back to 2020 stimulus-check era lows, but lenders noted the decrease is driven by \"improved credit models\" and \"shifting focus on increasing usage by their existing customers.\"\n\nThis is SEZL exact model.\n\nhttps://preview.redd.it/8o423u365kbg1.png?width=1116&format=png&auto=webp&s=176a366455834d13c999f52641c53dfd740aa412\n\n**I own SEZL and am buying at these levels.**\n\n  \nEDIT: position\n\nhttps://preview.redd.it/cmk2fxztckbg1.png?width=1293&format=png&auto=webp&s=f372628ae8617984f6d635fb72b28c5985cf23a4\n\n",
        "ticker": "SEZL"
    },
    {
        "post_id": "1q21bj4",
        "post_title": "The Most Elaborate Perpetual Pump'n'Dump In Need of Shorting",
        "text": "One day I decided I needed a market edge and so I took a few 50mg Vyvanse broke them off and snorted them to get a faster kick. I then sat for 10 minutes waiting for a DD miracle but nothing happened...\n\nThe problem? Vyvanse is a prodrug and so snorting it won't speed up its effects. You see the Lisdexamphetamine is dextroamphetamine with an attached L-lysine (amino acid) that breaks off in your body using enzymes... thus creating this slow-release mechanism.\n\nI wasn't discouraged and so I took short acting expired Ritalin, crushed it into about 120mg worth of powder and used the same delivery process to give me \"the edge\".\n\n[The delivery process](https://i.redd.it/guhgylvldyag1.gif)\n\nI instantly got hit with \"Writers euphoria\", some people say they see colors, all I saw was a pump'n'dump right in front of my eyes reaching the top of its pump. Perfectly timed using behavioral psychology to create strong FOMO to anyone waiting for their next hit of market open.\n\n**If you haven't figured it out yet, I'm talking about SLS.**\n\nI will attack this pump'n'dump scheme from several different views and maybe some of you will join me on this **'short'** trip.\n\n# Buckle up buckeroos, we're gonna start with fundamentals\n\nCurrently this shitco is trading at a share price giving it a mkt. cap close to USD 600M. First thing that I ask is who is the customer?\n\nIt's a bunch of unlucky people who basically have at most 1-2 years to live with a somewhat uncommon form of cancer: Acute Myleoid Leukemia. If we look at how many people get it globally we're gonna arrive at roughly:\n\n1.5-2.0 persons / 100.000\n\nNow let's look at all cancers (this will be important):\n\n± 200 people / 100.000\n\n**.... HOLY FUCK THE VYVANSE IS KICKING IN.**\n\n( What I didn't realize was that the Vyvanse has still entered my bloodstream and started dislodging the dextroamphetamine into my bloodstream, I have now trasncended into a dopamine and neuroephidephrine fueled state of being.)\n\n\\-----  \nWhy am I mentioning all cancers? Well it's to disrupt the one thing that is being spread through all the pump'n'dump posts: That this is a replacement for **Keytruda** (which was sitting at 25B revenue with 80% gross margins). But here's the first misconception that is being omitted in all the SLS cult posts:\n\nKeytruda is all-purpose, while the shit that SLS is producing **is NOT**. You need to be tested for the presence of WT-1 antigen which is only done for blood disorders/cancers. You may find the presence elsewhere but it says absolutely nothing about it being usable for this (source: I know a few doctors).\n\nThis means that while Keytruda might target the 200 people out of 100... SLS drugs will barely target 1% of that.  Why do I say barely? Well because that these drugs are given to specific people... CDK-9 is effective only for people with a certain (less common) mutation and GPS is given (to my understanding) to people in remission.\n\nSo let's do simple math (before I make you even more depressed):\n\nUSD 25B ---> 1% ---> 250M (let's be optimistic and say that 80% are eligible) --> 200M\n\nBut wait it gets better... however right now my heart is pumping, pupils are needle-point sized and I need to lower the adrenaline in my bloodstream by doing the only sensible thing I learnt from Elon Musk... **low doses of ketamine.**\n\n[Unlocking my full potential](https://i.redd.it/apm2dh6tdyag1.gif)\n\nKeytruda gets administered constantly, unlike GPS which is like <20 injections. So that 200M you were looking at? Yea it's probably way lower.\n\nNow that we've got over the \"HOLY SHIT THIS THING IS WORTH BILLIONS\" let's focus on the flying ponies in front of my eyes warning me about the financials and the CEO's marketing/dilution pattern.\n\n# A Good Modern CEO is always Professional Bullshitter.\n\nIf you've ever worked as a Software Engineer you will always notice two flavors of your average SWE.\n\n1. The technical guy who actually knows shit\n2. The bullshitter who's liked, but does shit and yaps whole day\n\nThe first one if he's career driven will become a good CTO. The second one will become CEO.\n\nThis is true for every profession, reality is that CEO needs to be able to sell, especially bullshit, to keep investors happy and to bring them exit liquidity. It's all a zero-sum game. Nobody wins, especially not the poor cancer patients who are used for advertising just like white-monkeys are in China.\n\nThe CEO SLS is no different to other CEOs except that this guy is a master bullshitter. How do you become a master bullshitter? Ambiguity. Think of the (1) technical guy, he will always be precise in his formulations, because he knows what he's talking about. the (2) bullshitter will always be ambiguous because he wants to sound smart.\n\nThe CEO has a beautiful pattern of selling very ambiguous news, carefully wording them in a way that the SLS cult members (read bagholders and MLM leaders) parrot the \"actual\" but not-factual message to the masses. Just look up the recent posts on bagholder/p'n'd subreddits for SLS. It's all bullshit purposefully pushed by bots and marketing team.\n\nAfter the share price jumps high, the CEO cuts a financing deal that basically tanks the price into oblivion, not including the perpetual warrant inducement plan (which alone makes acquisition very unlikely).\n\nThe best part? The CEO gets paid heftily even though close to 50% shareholders want to lower his above-standard pay. And there's a good reason he's getting such high cash bonuses - he knows it's all bullshit.\n\nAll of this will mean that if this company gets acquired (which is unlikely) it will be sold at a discount and not a premium. Notice the pattern that even after so many dilutions the market drives the price close to $4 a share... with constantly increasing share count it's amplifying the speed at which the company's valuation grows even though they still haven't really presented anything substantial.\n\n# Let's Look at the Recent Catalyst\n\nSo what spiked the current share price above $4? Results of the REGAL study were postponed, which was seen negatively and so the CEO wrote a very ambiguous post saying something on the lines of:\n\n\"We're still waiting for more deaths so that we can conclude the study.\" Which is absolutely hilarious. Because it doesn't say anything about SLS specifically, yet people interpret it in a way that it does and that the SLS specific treatment is actually the good one (it may be, but given the pattern I doubt it will be statistically significant)\n\nThe study includes both BAT (best available treatment) and the SLS drugs. The deaths they are waiting for might well be the BAT ones, while the SLS patients have already died (grim I know). Their argument: Average BAT life expectancy is 8 months or whatever they're saying.\n\nSo why do people think it's \"good news\" for SLS? Because people think they understand statistics when they actually don't. Heck I studied it, specialized in it as a mathematician... and even I will never dare to say that I fully understand statistics. Reality is that the delay might be negative, neutral or positive.  \n**WHY?:**\n\n* Many factors come into patient selection - The study isn't the typical \"let's pick 130 people at day 1 and start our tests\" they come in different cohorts/groups\n* You have high odds of selecting the \"good group\" that could even survive 5 years with bad treatment (this can be 10-15%)\n* All the bull posts you see focus on using the average as proof that this study is going on longer than it should (which is a very misleading statistic, and using it like this is pure bullshit for gullible people)... Average needs to be understood in a way that you will have people who died after 3 months and people who lived those 5 years -> and that will average out, so just looking at number of occurred deaths is not enough to know if there is a statistical significance. Saying that the study is going longer than expected is absolute bullshit, because if you have the healthier group by accident they will survive longer, but it will also be reflected in the final statistical analysis.\n* A small sample size like this is prone to distortions, follow up studies will be needed to know if this really works or not, which btw will definitely lead to more cash burn.\n\n**But most importantly:**\n\n* BAT for AML has significantly improved... and by significantly I mean really significantly. The 8 month figure is somewhat outdated by now as it might be closer to 10-12 months. Increasing the actual statistical significance needed to be observed with GPS.\n\n# Unsustainable Cash Burn and More to Come\n\nThe cash burn of this company is insane and even if they succeed with their tests they will face even higher cash burn due to the necessary shit they need to do to get this drug approved and into production. Given their current free cash, it's more than likely that they will need to raise more money.\n\n# So Why Are You Bearish?\n\nWell I like to think of it in terms of probability / uncertainty, specifically conditional probability. (Let's denote P(event | A ) as Probability of Event conditioned by A happening) Asks yourself this, which probability is higher?:\n\n(1) P( Good News | CEO Bullshitted every single time AND Cash Burn bad )  \n(2) P( Bad News | CEO Bullshitted every single time AND Cash Burn bad )\n\nWhich is more likely to be true? (1) > (2) or (1) < (2)?\n\nI'm gonna go with the likelihood of bad news as probable... This doesn't mean that the drug won't work, I just am certain that they will have to raise cash no matter what and the valuation once actual funds take a look at the revenue projections won't be as high as the current valuation.\n\nThe fact that the Trump Admin is pushing for cheaper drugs, is also pretty negative for any biotech trying to get their life-saving medication out there... This isn't the \"age of biotech\" (un)fortunately.\n\nHence I'm buying puts.\n\n**NOTE:** I'm not a biochemist, I might be wrong and I'm betting only money that I'm willing to lose, so don't follow blindly, do your own DD. Also brace for this post being downvoted by the SLS gang and Indian bots. One last thing... a big middle finger fuck you to anyone who is trying to profit by using dying people as advertisement.\n\nhttps://preview.redd.it/xul15buwdyag1.png?width=892&format=png&auto=webp&s=292f3986d4e479518690dcee02953c68b4212c9d\n\n**My position is small, because I'm locked down in other trades, sharing mostly because I like to do equity research:**\n\nhttps://preview.redd.it/86f0tiv8eyag1.jpg?width=549&format=pjpg&auto=webp&s=971f62f43ea2409f69d90f4b226e6efcc0e59418\n\nEDIT: To the existing and new bots out there, the SLS cult and other believers, yes I will double down if the stock price goes up:) Answering here since I received \"very nice\" DM requests.  ",
        "ticker": "SLS"
    },
    {
        "post_id": "1pznzps",
        "post_title": "Coupang $CPNG is Big Fuk",
        "text": "Disclaimer: This was prepared with the help of a Korean associate. Later we fed it in to AI for translation and formatting purposes.\n\nTL;DR:\nCPNG only trades in the U.S., but the crisis is entirely in Korea: lawmakers are talking perjury and suspension, the public is actively boycotting, and this is a newly profitable, logistics-heavy business that cannot survive disruption. U.S. investors are pricing a PR issue; Korea is treating this as a company-ending legitimacy failure.\n\nCoupang is fuk\n\nThis needs to be viewed as a Korean political and legitimacy crisis, not a U.S. tech stock hiccup — and Korean senators explicitly said that today.\n\nAt the National Assembly hearing, lawmakers directly addressed the gap between how this crisis is reported in Korea versus how it’s framed in U.S. outlets. Domestically, investigators are disputing Coupang’s disclosures, challenging sworn testimony, and raising perjury accusations. Internationally, it’s still framed as a data breach plus compensation. Senators openly questioned why foreign investors are seeing a materially softer narrative, and several explicitly warned that this information gap itself is becoming part of the problem.\n\nThat matters even more because Coupang only trades in the U.S. The Korean platform is owned by a Delaware holding company listed on the NYSE. There is no Korean stock price to reflect domestic outrage, no local shareholder pressure, and no market release valve. All price discovery happens in the U.S., while all political, regulatory, and consumer pressure is happening inside Korea. Lawmakers are clearly aware of this and unhappy about it.\n\nOn the ground, public reaction is not abstract. Lawmakers, civic groups, and labor organizations are openly calling for operational suspension, not just fines or apologies. Korean media coverage has shifted from “breach response” to “whether the company should be allowed to continue operating in its current form.” At the consumer level, large-scale boycott behavior (“탈팡”) is observable, with app-usage trackers and business press reporting declines in daily active users while competitors gained share. In Korea, boycotts are not symbolic — people actually leave platforms, especially when alternatives exist.\n\nThis is existential for Coupang because of its structure. The company only recently became profitable, after years of losses. It is a logistics-heavy business with thin margins that depends on uninterrupted volume, dense routing, and habit-driven repeat usage. A sustained boycott or even a temporary suspension would immediately reverse profitability. Drivers leave. Sellers leave. Customers retrain behavior. This is not a business you can pause and restart.\n\nTwo weeks ago, Coupang installed a U.S.-trained American lawyer as CEO to front the crisis. Domestically, that has been widely interpreted as insulating decision-makers behind U.S. legal optics rather than accepting Korean accountability. That perception has worsened public anger and reinforced the political narrative that the company is evading responsibility rather than confronting it.\n\nThis is why this trade is no longer about valuation, multiples, or growth trajectories.\nIt’s about whether a newly profitable, logistics-dependent company — openly boycotted, politically isolated, under criminal scrutiny, and facing calls for suspension — can survive in a country that actually follows through on public and state pressure.\n\nEven if it was about fundamentals they are shit anyways.\n\nU.S. markets are pricing a bad news cycle.\nKorea is treating this as a company-ending legitimacy failure.\n\nThat disconnect is the thesis.\n\nPositions: About 10k in May 21$ puts",
        "ticker": "CPNG"
    },
    {
        "post_id": "1pyu53u",
        "post_title": "How good actually was the WSB 2025 Outperformance: Statistical Analysis",
        "text": "Obviously a lot of traction of the outperformance of the [2025 WSB picks](https://www.reddit.com/r/wallstreetbets/comments/1puy95u/how_did_wsbs_stock_picks_of_2025_perform/). I wanted to do a slightly more thorough analysis to see if there was any real alpha here.\n\n**TLDR:** *evidence of excess returns, but the performance is best explained by a highly aggressive, factor-loaded portfolio in a strong market environment*\n\nTo evaluate alpha, I used standard asset-pricing models, including CAPM and the Fama-French four-factor model (market, size, value, and momentum). These models help distinguish returns driven by skill from returns driven by exposure to known risk factors such as growth, momentum, or small-cap bias.\n\nThe portfolio was an equal weighted basket of the 10 picks:\n\n* AMD\n* GOOG\n* HOOD\n* META\n* MSTR\n* PLTR\n* RDDT\n* RKLB\n* TSLA\n* WMT\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n(*Note: this analysis is through Nov 28, since Fama-French hasnt published daily returns for December*)\n\n**Descriptive Stats:**\n\n* **Portfolio Return**: 61.2%\n* **SPY Return**: 17.9%\n* **Portfolio Outperformance**: 43.3%\n* **Portfolio Vol**: 44.5%\n* **SPY Vol**: 20.2%\n* **Portfolio Sharpe | Sortino**: 1.85 | 2.82\n* **SPY Sharpe | Sortino**: 0.86 | 1.29\n\n***Interpretation:*** *significant outperformance, with significantly more volatility*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**CAPM Regression**\n\n* **Adj. R-Squared**: 0.718\n* **Market beta**: 1.88\n\n***Interpretation:*** *The portfolio had an extremely high beta. I.e. if the market goes up, all else equal you expect the portfolio to go up 1.88x the market. If it goes down, same thing in reverse*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**Fama-French Four Factor Regression**\n\n* **Mkt-Rf**: 1.59 *(very high market risk)*\n* **SMB**: 0.64 (small cap weighted)\n* **HML**: -0.73 *(strong growth bias)*\n* **MOM**: 0.51 *(significant momentum exposure)*\n\n***Interpretation:*** *Confirms that the portfolio was significantly weighted towards \"levered\" growth names*\n\n*\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_*\n\n**Conclusions:** nothing novel here, WSB tilts towards higher risk, momentum names. If the same exercise is done in 2026, you should expect outperformance if the market goes up and underperformance if the market goes down.\n\n*Sources/Methods: Fama-French Library, yFinance, Python*\n\n*Happy to answer any questions or provide code if people are interested in running it themselves*",
        "ticker": null
    },
    {
        "post_id": "1pyghud",
        "post_title": "The Entire AI Buildout (Google, NVDA, MSFT) Is dependent on this $700m Monopoly - $15 -> $150 PT.",
        "text": "I drew colossus from Starcraft 2 to represent laser beams. And prepared a whole thesis but kept getting automodded for \"low quality\".  So here's the more TLDR version of my thesis:  \n  \nThe Entire AI Industry is shifting to photonics from Google TPU to optical interconnects. \n\nThe entire AI \"Growth\" story ends in 2026 if there's no InP substrates + materials.  \n\nBUT GUESS WHO CONTROLS IT ALL? One Company: $AXTI. \n\nThere's two bottlenecks:\n\nInP Substrates -   \n  \n\\- Hyperscaler optics (TPU pods, etc)   \n\\- Optical transceivers (5g, data)   \n\\- LiDAR (robotaxis, drones, military)   \n\\-Optical Modules (interconnect clusters)   \n\\- Silicon photonics laser dies (Nvidia’s future co-packaged optics and Intel/Broadcom SiPh engines use InP CW laser arrays.)  \n  \nThis is a DUOPOLY  from  \n\\-AXTI (est. \\~30–35%)   \n\\-Sumitomo (est.\\~30%)   \n\\- JX Nippon (est. 10-15%)\n\nIndium Phosphide (the source material for everything): \n\nVital Materials - 35%   \nAXT - 25%  \n  \nBefore, this was a commodity with low TAM just for telecom.\n\nNow they're used for the entire AI buildout. \n\nJust to give u an example $AXTI -> $LITE -> $GOOGL TPU. without any of these members, the program shuts down.   \n  \nGoogle would literally pay $5B (50 TIMES prices + \\~$140m TAM from 2024) DIRECTLY to one of these suppliers -> hand to COHR just so their whole TPU program doesn't stall because Meta decided to buy them out. And this would only be a like a 3-4% added cost to their BOM because this thing was so cheap. If Meta does it first, then Google's TPU program stalls. If Google does it first Microsoft's ASIC problem stalls.   \n  \nTHE WORLD IS AT MAX CAPACITY RIGHT NOW (demand > supply by multiple factors pre-ramp) AND THIS IS GAME THEORY on materials supply chains. \n\nGuess who shows up twice in the WHOLE AI bottleneck? Both as the duopoly bottleneck and the duopoly bottleneck of the bottleneck\n\nAXTI.   \n  \nThis is the holy grail of supply chain analysis + materials research. Nobody's posted about this stock here in the past 5 years, you're welcome. \n\nAnyway I decided to max OTM some spare change on Calls last Friday, because there's a low chance this goes from $15 to $150 if we see the same memory supply stock in 2026. I will buy more shares on Monday when markets open up but wanted to share this at the start as proof. \n\nNFI, there's a chance China sends this to $0 with export controls so don't follow along I just wanted to share my thoughts. But if this goes to $0 so does the entire growth phase of the AI buildout.   \n  \nI just thought this could also easily be a $7B company given they control 1/3rd of the world's entire substrate capacity and then 1/4th of the world's entire materials used for AI buildout.  \n  \nIt's a monopoly in mining -> refining -> substrate production. And a duopoly for InP substrate production and Indium Phosphide. \n\n I just wanted to share as proof in case this becomes legendary.   \n  \nTLDR: THE ENTIRE AI INDUSTRY IS BOTTLENECKED TWO TIMES BY THE SAME COMPANY. \n\nFOUND THE SINGLE POINT OF FAILURE OF THE ENTIRE MANY TRILLION USD WESTERN AI BUILDOUT IS SOME $700m COMPANY CALLED AXTI, WORTH LESS THAN SOME PRE REVENUE LLM STARTUP. ",
        "ticker": "AXTI"
    },
    {
        "post_id": "1pvkk5w",
        "post_title": "Top Quality DD on ETH: High Conviction trade since my last DD on META (hand written not AI)",
        "text": "Alright, regards, if you had been following my last DD on META, you would’ve done really well. Since that DD post, my position has been up moderately + I’ve been getting really good yield on the covered calls written against my longer dated call (I bought back when I’m up 50% and sell another call when the stock rallies with climbing implied volatility). I will still follow my original trade plan in my previous DD post for exits and take profits. \n\n\n\nhttps://preview.redd.it/jy3xm39yge9g1.jpg?width=817&format=pjpg&auto=webp&s=1d127d8387c86d3a4be56e0ad3245b2803e3009e\n\n\n\nTLDR:\n\nFundamentally: Gold and Silver are mainly driven by money supply aka inflation. BTC and ETH are sharing this trend since they were gradually adopted by institutions and mainstream (around 2021 to present). I am arguing that BTC and ETH are acting more and more like commodities since then.\n\nMacro/Policy: The current administration is keeping inflation higher for longer. Bullish for commodities. \n\nThesis: Commodity will move higher with inflation and BTC and ETH in particular will experience a catch up trade as the current cycle isn’t over yet. Short/Medium term catalyst for ETH is the tokenization of stock security and long term catalyst for ETH is stablecoin market cap will 10x by 2030 (according to scott bessent).\n\n  \n\n\nDD starts here:\n\n\n\nI’m here today to make you all a bit more money for Christmas. ETH, some people call it digital silver, some people call it the backbone of Wall Street, some people call it a scam (I think quite a few of these people have lost money on it). Tom Lee has called it the macro trade of the decade, and more people are calling Tom Lee a con artist lately, while others are still amazed at his haircut. All the noise makes it hard to focus on the main issue - is Ethereum worth anything, or is it just fairy dust? \n\n\n\nIn my DD, I want to focus on the first principles of things so you won’t be reading an AI slop or some useless rambling of hopium. \n\n\n\n**What is value?** \n\nThe traditional value investing way of computing the intrinsic value of an asset is by looking at all the future cash flow this asset can yield. Which is why we can value a stock, because owning the stock is partially owning the future cash flow the company generates \n\nBy this metric, gold/silver/BTC/ETH are all the same - they have no intrinsic value as they don’t earn you any money just by holding them. Which leads us to the next question: why are gold and silver doing so well, while BTC and ETH are trading like hot garbage?\n\n  \n\n\n**What is price? How are commodities priced?**\n\nThere are many factors that influence the price of a commodity. The most common factors include: utility, scarcity, trust/credibility, cost to carry, supply and demand, and most importantly market sentiment (mass psychology). \n\n\n\nFor gold and silver specifically, they have limited in supply (on earth) and have been around for a long time where people have trust in them not only as commodities but also as currencies. In terms of utility,  Silver has various industrial utility due to its superior conductivity and gold has a stable demand in many industries shown in the graph below.\n\n\n\nhttps://preview.redd.it/7esvpu8yge9g1.png?width=643&format=png&auto=webp&s=640b729e19b50b04b2b63e341df4996959a14466\n\nHowever, if you just look at supply vs demand, you would realized they are not off by much and it’s not really the driver for gold price (same for silver).\n\nhttps://preview.redd.it/e9rdju8yge9g1.png?width=1485&format=png&auto=webp&s=5d782e6b28112369e9c962ab5abaef0899470575\n\nhttps://preview.redd.it/fsusju8yge9g1.png?width=1477&format=png&auto=webp&s=61646d30d24b79b60dfa7097f7613d49d6d2f4a2\n\n\n\n**What is the real driver for price?**\n\n\n\nAs mentioned earlier, gold and silver have been around long enough for people to trust them not just as commodities, but as currencies. So much so that they are considered risk-off assets (or save haven when shit hits the fan). Central banks build reserves with gold to maintain their monetary system credibility in and preserve national wealth against various economic risks.\n\n\n\nIn other words, gold and silver are strongly linked to fiat currency and we can use money supply as a proxy for gold and silver. (as shown in chart below)\n\nhttps://preview.redd.it/gne2ju8yge9g1.png?width=1600&format=png&auto=webp&s=0264f3cdf05c72fcffdeace0eb8392fc2344cd3d\n\n\n\nLike the stock market, gold and silver prices goes up with the increasing money supply (aka inflation). On top of that, gold and silver has demonstrated to be the safe haven when a crisis happens. Both gold and silver had a massive rally in 2011 during the global financial crisis as everyone thought the U.S. financial system was going to collapse and piled their money into gold and silver for safety. \n\n\n\n**What about BTC and ETH?** \n\nThere are certainly similarities for BTC and ETH when compared to gold and silver. For example, BTC also has a fixed total supply and is the world’s first ever decentralized payment network based on the blockchain (similar to gold, it became a much more volatile version of store of value).\n\n\n\nAnd ETH took blockchain a step further and became a global computing network that allowed programmers to build decentralized applications used to tokenize any assets (sounds like silver when it comes to utility). The photo below illustrates the market value of tokenized assets and transactions on the ETH network in 2024. While ETH only shares a tiny portion of the TAM in these transactions, ETH is definitely a leader in terms of the tokenization of assets. So far, 65% of stablecoin runs via ETH and according to Scott Bessant, the market cap of stablecoin will grow ten fold into 2030. So it definitely sounds like a ton of upside for this network.\n\n\n\nhttps://preview.redd.it/8k5no49yge9g1.png?width=849&format=png&auto=webp&s=49a44a83902c313cb69f5cea5466d9e81fa9987a\n\n\n\nWhile it sounded like a greenflag on paper, I consider the ETH supply to be a red flag. ETH bulls like to say ETH has a burning mechanism on a portion of the transactional fees that creates a deflationary effect on ETH (as projection chart shows below, the total supply of ETH is projected to decline in the coming years + ETH gives a dividend), I find this to be shady and don’t really buy it. On top of that, I think the switching cost is too high given ETH network has a pretty expensive transactional fee aka gas price. But if the supply projection holds true, ETH will be much closer to the digital silver.\n\n  \n\n\nhttps://preview.redd.it/r1tglv8yge9g1.png?width=850&format=png&auto=webp&s=d89317fe2bcb7376ecb745a354e88d6d0894a878\n\n\n\nRegardless of how many gold and silver traits BTC and ETH embodies, the correlation between BTC/ETH and M2 says it all. Both commodities are starting to show correlation with money supply and the stock market since 2021. And the reason why I picked this time frame is because both BTC and ETH started to gain adoption from the mainstream and institutions during the period. \n\n\n\nhttps://preview.redd.it/wsi50w8yge9g1.png?width=1704&format=png&auto=webp&s=8cc48832af48e785de1821f341e3b049df82edb6\n\n\n\nSo why does it feels like BTC and ETH are trading with the stock market like a risk on asset? \n\n\n\nThis explanation is based on an interview by Steve Eisman with Rahul Jindal, a FinTech strategist at Autonomous. Jindal explains that BTC and ETH began trading more like stocks after 2019 because the type of investor holding crypto changed. In the early years, crypto was mostly owned by early adopters who viewed it as a hedge against banks and fiat money, so it was less correlated with equities. After COVID, easier access through exchanges, large retail participation, and excess liquidity caused crypto to be held alongside stocks in investor portfolios. As a result, BTC and ETH became sensitive to money supply and risk appetite, which explains why they have moved closely with the stock market since 2021 rather than behaving like gold.\n\n\n\nThis does not mean BTC and ETH will always trade like high-beta stocks. As adoption matures and ownership shifts further toward institutions and long-term holders, their prices are more likely to be driven by supply constraints, network usage, and monetary demand rather than short-term liquidity cycles. Over time, this would allow BTC and ETH to behave more like commodities, where value is tied to money supply, instead of purely reacting to stock market sentiment.\n\n\n\n**The Inflationary Policy & Macro effects**\n\nTrump has taken extensive measures (manipulating the BLS jobs data and putting pressure on the Fed) to keep the USD weak and interest rate low (to maintain export advantage + service the 38 trillion debt) despite high level of inflation. The promotion of stablecoin also introduces more inflation as people around the globe can now purchase USD backed by treasury (kinda like the U.S can issue debt to the entire world). \n\n\n\nThe end of the quantitative tightening is another catalyst to at least support more liquidity coming into the equity and capital market. Which could be inflationary. \n\n\n\n**Short Term Catalyst for ETH: Tokenization**\n\nIn 2025, the tokenization of stocks reach several milestones, including: \n\n* SEC roundtables on tokenization; platforms like Ondo launch tokenized stocks outside the US.\n* BlackRock explores tokenized ETFs; industry leaders predict massive market growth.\n* Nasdaq files to list tokenized stocks by 2026; Knowpia enables tokenization ahead of Wall Street.\n\nAnd 2026 could see further acceleration to this adoption. CNBC reports stock tokenization running on the ETH network:\n\nhttps://preview.redd.it/mslrjv8yge9g1.png?width=903&format=png&auto=webp&s=2a16e3fa594ab47444ebaa5dba8247fc20315125\n\nTo visualize the true upsides of stock tokenization, the economists of Deutsche Bank offered some great insights on Tokenization below. So far, 90% of tokenized assets are stable coin (which ETH dominates) and the tokenization of stocks could really invite traffic to the ETH network\n\n\n\nhttps://preview.redd.it/88enfv8yge9g1.png?width=1185&format=png&auto=webp&s=fe41fa99bea383057a033c2c8d6513f08f5df34e\n\n\n\n**So why have BTC and ETH traded like hot garbage into year end?**\n\nSince late October, the stock market has been choppy rather than trending. Volatility stayed elevated and trend signals weakened, which caused systematic investors like CTAs and vol-targeting funds to reduce exposure. In this environment, BTC and ETH sold off during equity drawdowns but failed to rally on rebounds, not because of panic, but because risk appetite never fully returned. Positioning stayed light and investors remained cautious.\n\n\n\nSo this looks more like a pause than a breakdown. The stock market has stabilized and pushed to new highs into year-end, which suggests sentiment is still intact. Most notably, the AI sector has remained strong. Earnings from Nvidia and Broadcom were outstanding, showing that growth expectations have not collapsed. As equity volatility compresses and risk-on sentiment improves, this gives the market room to grind higher. If that happens, liquidity and positioning should rotate back into high-beta assets, which is bullish for BTC and ETH heading into early 2026.\n\n\n\nLooking at the ETH chart, the day candle is showing stabilization and I don’t see why it wouldn’t revisit ATH and break above $5,250 in Q1 2026.\n\nhttps://preview.redd.it/uc7g8x8yge9g1.png?width=1600&format=png&auto=webp&s=6523178952726fe7a00ee84149b6d1c2ccebc3f2\n\n\n\n**My expression for this bet: BMNR (I bought deep ITM BMNU calls so my breakeven is 0.4% at the time of purchase)**\n\nAs I think ETH could re-visit 5k in Q1 2026, BMNR is the perfect pick. I pick it for 3 reasons:\n\n1. No debt - so its much less of a fraud such as MSTR (which is also starting to price in not being included into S&P 500).\n2. Premium to NAV expansion - if my thesis plays out, Tom Lee will look like a genius again premium to NAV can revisit higher levels: 1.3x - 1.5x (which is why I picked BMNR over SBET because people give leaders a premium in the treasury holding company world).\n3. I think we are close to a reversal given crypto already being in a bear market with greed and fear recently being in extreme fear. (for reasons I mentioned earlier, the ETH network is doing great, far from a bear market - so the price being in a bear market zone is really just a gift).\n\n\n\nhttps://preview.redd.it/77d20y8yge9g1.png?width=1561&format=png&auto=webp&s=90feb8e9da2ea74e418deedd585a457fba4e9fe1\n\nhttps://preview.redd.it/77wnn59yge9g1.png?width=638&format=png&auto=webp&s=8ff5fd6c82d54f4e7667a9c7e13c6292d7f328ec\n\n\n\n**Position**: \n\nhttps://preview.redd.it/4al0y29yge9g1.jpg?width=1284&format=pjpg&auto=webp&s=983c22accdeccfd8e9eba94dfe889846e9843077\n\nhttps://preview.redd.it/jve1jf9yge9g1.jpg?width=1284&format=pjpg&auto=webp&s=31fad3d5b434ebe66c5ef59a8954a39762925eac\n\n\n\nI even bought for my TFSA:\n\nhttps://preview.redd.it/90gktw8yge9g1.jpg?width=946&format=pjpg&auto=webp&s=33e483add4a2806cb7bf1682707063b6e6e1cafc\n\n",
        "ticker": null
    },
    {
        "post_id": "1pud8fe",
        "post_title": "MSTR: Why 2026 Could Be a Massive Year",
        "text": "TL;DR: MicroStrategy (MSTR) is trading below the value of it's Bitcoin holdings. Short-term swings are sentiment-driven, but structurally the company is strong, positioned to benefit from the next Bitcoin bull cycle, and supported by growing institutional adoption.\n\nBitcoin’s Slide & Market Factors -\n\nMacro risk-off: BTC dropped 30-40% from October highs due to higher rates, tech volatility, and a strong USD.\n\nETF outflows & liquidations: Spot Bitcoin ETFs saw $3.4B outflows in Nov 2025; leveraged crypto positions triggered $1B in forced liquidations.\n\nCrypto winter: BTC erased much of its YTD gains. When Bitcoin falls, “Bitcoin proxy” stocks like MSTR often fall even more.\n\nMSTR = Leveraged Bitcoin Exposure -\n\nBitcoin-driven stock: MSTR amplifies BTC moves up or down. During the recent dip, MSTR dropped faster than BTC.\n\nBalance sheet buys: MicroStrategy continues acquiring Bitcoin via stock and debt, giving leverage on BTC rallies while retaining flexibility.\n\nSoftware business: Enterprise analytics platform still grows (Q3 2025 revenue \\~$128.7M, +10.9% YoY; subscription revenue \\~$46M, +65% YoY). Small compared to BTC, but it exists.\n\nBitcoin Holdings & Per-Share Math -\n\nTotal BTC: 671,268 BTC ($58.4B at $87,049/BTC) 87,000/BTC).\n\nShares outstanding (diluted): \\~312,000,000 BTC per share: 671,268 ÷ 312,000,000 ≈ 0.00215 BTC/share\n\nDollar value per share of BTC: 0.00215 × $87,000 ≈ $187/share MSTR trades at \\~$157.88. Each share represents roughly $187 of Bitcoin value, plus a small, growing software business and cash reserves.\n\nMarket cap vs BTC holdings: \\~$46B vs \\~$58.4B,  trading below implied BTC value. Impact of BTC moves: Every $10,000 rise in BTC adds \\~$21.5/share or \\~$6.7B total to MSTR’s BTC holdings.\n\nWhy Bitcoin Could Go Up in 2026 -\n\nPost-halving cycle dynamics: Last Bitcoin halving was in April 2024. Historically, years 2–3 after a halving are strong bull phases (2012, 2016, 2020). Supply growth slows, while demand continues to increase.\n\nInstitutional accumulation: Large institutions and corporate treasuries continue quietly buying Bitcoin on dips, adding structural demand.\n\nBanks entering crypto services: JPMorgan and other major banks are exploring crypto trading, lending, and custody services. Bitcoin can be used as loan collateral, unlocking liquidity without selling BTC.\n\nMore institutional access reduces perceived risk, increases adoption, and supports price stability. Macro tailwinds: If the Fed starts cutting rates or inflation eases, risk assets like BTC historically outperform.\n\nGlobal adoption & limited supply: More users, corporations, and payment integration, combined with a capped supply (21M BTC), drives scarcity and potential upside.\n\nWhy 2026 Could Be Favorable -\n\nBTC leverage: If Bitcoin rallies, MSTR (and MSTU) amplifies the move.\n\nBalance sheet & capital strategy: They can acquire Bitcoin while managing cash and debt.\n\nSoftware + subscriptions: Small recurring revenue provides a floor outside crypto.\n\nStructural advantage: Few public companies combine BTC exposure with access to capital markets.\n\nInstitutional tailwinds: Banks and other institutions adopting crypto services reduce risk perception and expand demand.\n\nBottom line: MSTR and MSTU are leveraged ways to play Bitcoin with corporate backing. Short-term swings are sentiment-driven, but structurally the company is strong. With historical post-halving trends, institutional accumulation, limited supply, and banks beginning to integrate Bitcoin, 2026 could be a favorable year for BTC — and your MSTU position could amplify those gains.\n\nCurrent positions: 2x leverage MSTR Bull (MSTU) - 2890 units @ $9.92. Continuing to DCA\n\nhttps://preview.redd.it/afv01n6kj29g1.png?width=1080&format=png&auto=webp&s=d258ba6db6460298afdb22ea1bc9c38c60a8f321",
        "ticker": "MSTR"
    },
    {
        "post_id": "1pt8h6f",
        "post_title": "A Pure Gambling Play: LUNR (800% gain so far)",
        "text": "I've explained it once, but badly - if I don't collect my thoughts well in advance it's hard to explain the reasoning behind certain plays. This post is the start of **my redemption ark (in terms of me being capable of explaining my thoughts)**, and so I will try to explain once more but more carefully why I decided to buy \"LUNR tickets\" when it was trading at $8\\~ \n\nI've since then got an 800% gain on my options:\n\n[My position \\(not including the new one I just made\\)](https://preview.redd.it/a8h9skpl3t8g1.png?width=698&format=png&auto=webp&s=53289b9bed2aea9c59df7740495e6d49013bf256)\n\n# It started with a message from a WSB discord user\n\nI'll forever love this dude, he told me about LUNR and an LTV contract, briefly explained why LUNR is going to win the contract and that he has invested into them.\n\nMy initial thoughts were the typical \"yea right, buddy\" thoughts:\n\n* How do I know you're a mechanical/space/whatever engineer that actually understands what is required by NASA?\n* How can you be so sure, that they are the ones to get picked?\n* Have you even checked their financials?\n\n[My brain when I realized what I realized](https://i.redd.it/0qam0x073t8g1.gif)\n\nBut then my ADHD-crippled-monkey inside my brain took over:\n\n* Wait, did you say only three companies selected?\n* Final stage of the contest?\n* Previous collaborations with NASA?\n* Wait, you told me that there's a probability two companies might make the cut?\n* $4.7Bln contract?\n\nThis is a typical 'gambling' game, and every gambling game can be analyzed, simulated and if you do it well enough you can get an edge. You see I used to play poker, and when you want to analyze a hand you do similar techniques that banks use to predict stock market prices.\n\n# Simple Gambling Math\n\nNote: To simplify the text and make it shorter, I'll denote probability as P(event).\n\nImagine that you're playing a simple \"roll the 3-sided dice\" game. Each side has a probability of being rolled equal to 1/3. Now say you're betting $1 on your favorite number and if you win, you get $1.5 back. You could calculate the EV (expected value) of this game by simply calculating:\n\nP(win) \\* amount(won) + P(loss) \\* - amount(loss) = your EV (of discrete probability)\n\nso in our sample game we have:\n\n1/3 \\* $1.5 - 2/3 \\* $1 \\~= $-0,17\n\nRoughly translated to human language -> In the long run, for every time you decided to play this game you effectively lost $0.17\n\nIf we can figure out how this \"LTV contract game\" is played and what are the individual probabilities then we can figure out if it makes sense to play this game or not.\n\n# Monte Carlo Simulations\n\nNow here's what I was thinking, there's a lot of information out there, publicly available. That allows me to guess what might get factored into this decision. So all I need to do is to \"define a game\" and the rules to play this game, run simulations of this game and then approximate the likely probability. Why do I need to do this? To be as independent as possible (and factor in different odds of a decision being made this way).\n\n**So this is the game:**  \nYou have 3 companies at the beginning and in the end (1 or with a certain probability 2 will be picked), you have a set of rules where each rule defines which company scores points with what probability (random events).\n\nAt the start of the game you chose a number equal to the number of rules you'll randomly select from the original set.\n\nAt the start of each simulation you will modify the base probability of a rule (/event) occurring (and you do so randomly).\n\nRun a lot of simulations -> assess conditional probabilities based on results, i.e.:  \n**- P(LUNR win | IF 1 selected)**  \n**- P(LUNR win | IF 2 selected)**\n\nNow of course it gets even better if you start factoring the odds of the market recovering, space age boom, etc. everything slightly improving your odds.\n\n# Results\n\nEven if the chances that 1 company would've been selected, the odds were stacked in your favor as long as you were buying deep OTM calls with long expiry (at the time I bought end of JAN 12.5C for roughly \\~ 45c premium each). The reason for this is that the leverage increases your volatility, but as a result of that you can potentially lose everything you invested into it, standard shares would just fall to a certain price.\n\nHowever when factoring the possibility of 2 companies being selected the eventual probability of LUNR winning became slightly greater than 1/2... meaning that it just didn't make sense \"not to play\" - even if you think they might lose.\n\nAs of right now, if it wasn't made clear that 2 companies would get selected... then buying the deep OTM calls wouldn't pay off (or barely for that matter), mostly because the premiums are already high. However - NASA made clear that they have an intention of awarding two companies, to diversify vendors and prevent vendor lock in, making the calls still lucrative.\n\nHuge insider buying a month or so back also indicated larger odds of winning, further helping the \"narrative\" that this is a valuable play.   \n  \n**Trying to estimate a PT**\n\nThe problem with companies such as LUNR is that it's increasingly hard to estimate a PT. One of the possible ways of trying to guess the potential price is to take the contracts that they signed and just add them to the market cap -> recalculating the price (it's not perfect, it's pretty inaccurate, but it gives you some kind of an estimate). If I just assume that the current price already factors in some of the 4.7B contract then with a mkt cap of around 4.7B you get $40 a share.\n\nI tend to use this number as \"the super-positive estimate\", I then take roughly 1/3 of it and declare it as the \"the super-pessimistic estimate\" .. i.e. $40 / 3 \\~= $13.4  \nPessimistic estimate set as $40/2 = $20\n\nThe middle ground is what I use as the \"average, regular estimate\" i.e. $30  \n\\-----\n\nSo, rough estimates:\n\n**Super-positive estimate: $40+**  \n**Average estimate: $30**  \n**Pessimistic estimate: \\~$20**\n\n\\-----\n\n**Super-pessimistic estimate: $13.4**\n\n\\-----  \nThis kinda makes it clear why I decided to go with $12.5C.\n\nCurrent price - USD 16\\~",
        "ticker": "LUNR"
    },
    {
        "post_id": "1pq8lcf",
        "post_title": "How to Profit from the Great RAM Drought",
        "text": "**TLDR: Dell caught with it's pants down, RAM drought too painful. Dell fuk.**\n\n**EDIT (12/24/2025):**\n\nAdded article for HPQ (on top of existing Lenovo's strategy) announcing during their previous earnings call that they expect to have relatively smoother 2026 because they have a good memory stockpile to soften the blow from the shortage.\n\nAlso, Dell is currently feeling considerably more CSG margin hit absorption than originally forecasted in November, and its accelerating. According to[ techradar article](https://www.techradar.com/pro/dell-reportedly-preparing-massive-price-hikes-for-commercial-clients-and-warns-ordering-today-for-future-delivery-does-not-lock-in-current-pricing):\n\n>[*Dell*](https://www.techradar.com/tag/dell) *is set to increase prices on its commercial products starting December 17, affecting laptops, desktops,* [*mobile workstations*](https://www.techradar.com/news/best-mobile-workstations)*, and AI-enabled workstations.*\n\n>*Internal documents reviewed by* [*Business Insider*](https://africa.businessinsider.com/news/dells-computer-prices-are-about-to-rise-for-corporate-clients-heres-what-to-expect/009gvv5) *revealed models with higher RAM or SSD storage will see the largest increases.*\n\n>*Laptops and desktops with 32GB of memory will rise between $130 and $230, while top-tier 128GB configurations could cost an additional $520 to $765.*\n\n**edit:** This post was deleted by reddit's \"bad url\" filter (gay)\n\n**Who tf is Gom\\_KBull and Why should I listen?**\n\nBack in April when SOXL was trading at 8-11 range, I took out a loan and loaded up every single LEAP i could\n\nThis was [screenshot ](https://www.reddit.com/r/wallstreetbets/comments/1l3fe7r/im_such_a_cxm_slxt_for_soxl/)in June and [screenshot ](https://www.reddit.com/r/wallstreetbets/comments/1lwinga/soxl_creaming/)in July\n\nI've sold off all the LEAPs on these in early November, ending in a 3 bagger... although most of us profited big over that 6 month bull-run.\n\nBack in November 10, i've put out a [warning ](https://www.reddit.com/r/wallstreetbets/comments/1osujpt/comment/no1glz3/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)when shit didnt feel right anymore and the bull run was likely over.\n\nThis is about all I have as far as credibility (so far).\n\n# \n\n# The RAM Shortage Preface\n\n*Alot of this section is basic knowledge, you can skip if this you are already aware of the RAM shortage.*\n\nIn case you've been living under a rock, the price of RAM has been going parabolic.\n\nThis is because AI hyperscalers are offering b00k00 bucks to memory producers for their AI slop generators. So the RAM farmers said \"oh shit, fuck DRAM lets make and sell a metric assload of HBM\"\n\n**There are ONLY 3 major memory producers on planet earth: Samsung, SK Hynix, Micron.**\n\n**DRAM supply ⬇️, DRAM price ⬆️**\n\nBut the reality now and going forward into 2026 is:\n\n**DRAM supply ⬇️⬇️⬇️, DRAM price ⬆️⬆️⬆️**\n\n[Exhibit A](https://preview.redd.it/ipoi7z2gf28g1.png?width=911&format=png&auto=webp&s=7452073b78d27be19971e4168154b1fa6b8f1cc6)\n\n[Exhibit](https://www.reddit.com/r/wallstreetbets/comments/1pm948j/the_ram_i_bought_a_year_ago_is_the_fastest/) B\n\nWhat does this mean?\n\nEVERYTHING in tech is getting squeezed, especially areas that are NOT directly exposed to AI profitability. Everything tech related NEEDS memory, but as long as you're not using HBMs you're going to the second-priority lane.\n\nAmong the roadkill in this RAM storm, the juiciest looks like Dell.\n\n# What is Dell's profitability and exposure looking in this quarter?\n\nhttps://preview.redd.it/4jpc57ilf28g1.png?width=1140&format=png&auto=webp&s=4a306f91e66383b7377fccdc1b6b318c612ffeed\n\nDELL's revenue stream essentially comes half and half for 2025.\n\nOne part is ISG (Infrastructure Solutions Group). This side is from providing AI-related solutions, focusing on infrastructure (hello datacenters).\n\nThe other half is CSG, everytime you see a shiddy DELL laptop, or hardware... this is CSG side.\n\nDell's CSG side of the business is completely fucked (at least for 2026).\n\n*Why?*\n\nBecause Dell is paying 4x for RAM and the cost is only accelerating. Lenovo is hoarding RAM to mitigate this\n\ndamage ( i tried to link evidence but it got flagged by reddit, but they are front page if you google \"Lenovo Hoarding\"), other PC and smartphone companies (MSFT/AAPL and the like) have long term contracts to LOCK IN prices for their supply. Not to mention MSFT and AAPL are already heavily in the AI game... MUCH more than DELL is.\n\nEDIT: Even HPQ (hewlett packard) is stockpiling memory to soften its blow, which DELL has NOT which is absurdly poor planning. [Source](https://finance.yahoo.com/news/ramageddon-lenovo-dell-tipped-raise-202742254.html?guccounter=1&guce_referrer=aHR0cHM6Ly9jbGF1ZGUuYWkv&guce_referrer_sig=AQAAALEjul5qMaQ-zOJjP5eBCLc9jd7qeECpWG5O3uk23JRTz8_OPBncBSmCeQfrsjaMVc5sHdbfYxtcBBsNoQHNW8VMaSQYcirUG5AHqHuLdPwfe-nylo5K-Kj74b4PRmmYQzd8AntMhw2J6AYmvvNsz_50e6A9u78chggJOR7uCwiK):\n\n>*During* [*HP’s earnings call*](https://www.pcmag.com/news/hp-to-raise-prices-lower-configurations-due-to-soaring-memory-costs) *at the end of November, HP CEO Enrique Lores expressed similar sentiments. Though Lores did say that the first half of 2026 should be okay for HP since the company currently has a memory stockpile.* [*Bloomberg reported*](https://www.bloomberg.com/news/articles/2025-11-24/lenovo-stockpiling-pc-memory-due-to-unprecedented-ai-squeeze) *that Lenovo has also begun stockpiling PC memory to get through at least 2026.*\n\n*Does Dell have this security or anything similar?*\n\n**NOPE.**\n\nUp until 2025, Dell has been known to have short term supply arrangements as its key strength. Now in late 2025 to all of 2026... its their **Achilles' tendon**.\n\nThe COO (Jeff Clark) of Dell stated\n\n>*“We’re in a very unique time. It’s unprecedented. We have not seen costs move at the rate that we’ve seen. And by the way, it’s not unique to DRAM, it’s NAND. It is hard drives, leading edge nodes across the semiconductor network,” he told analysts. “I’d categorize it as demand is way ahead of supply, and as we wade our way through that, we’re going to lean on the things that we’ve always done.”*\n\n**This is corporate speak for**\n\n>*\"Oh shit oh shit oh shit. This wasn't supposed to happen. Oh god, we're so fuk\"*\n\nAnd Dell has also noted it plans to raise the prices of their products by 10-30% to offset their costs.\n\nHere's the problem...\n\n***WHO IS PAYING 20%+ more for Dell products?***\n\nThink about it... would corporates (or even individuals) bite their tongue and pay >20% premium for shiddy Dell laptops and PCs? They have already laid off tens of thousands of employees, they are not in a position to easily fork over cash at a premium for bulk PCs/laptops.\n\nThere will be customers (both corporate and individual) who are more than willing to just let their existing hardware tough it out for 2-3 years until prices stabilize (hopefully)... and that's IF they don't just look elsewhere.\n\nAnd personally, I believe Dell won't stop at a 30% increase. If these RAM prices continue to rise as they are, Dell will have no choice but to go farther beyond this.\n\nBut what else CAN they do? They don't have a strategy or countermeasure. This is the last resort when you're supply chain fucks you.\n\nAs for the ISG side, I admit Dell's operating margins are improving quarter over quarter... but this wont do much to outshine the pain CSG side is feeling. In the big picture, their ISG side has a very very small margin for profitability. Its not very profitable for them right now, but they HAVE TO do it to stay relevant in the AI heavy economic environment we are in.\n\n# But what if this is already priced in?\n\nIt is to a small extent I'll admit, my thesis still holds that Wall street does not fully foresee the horror show that will unfold when DELL releases their numbers in February.\n\n**Add onto that, because we don't foresee RAM shortage letting up in 2026-2027, but instead being just as bad or worse for future quarters... They will have to mention that in upcoming guidance.**\n\nhttps://preview.redd.it/fytzlh5nf28g1.png?width=1251&format=png&auto=webp&s=b3fe04f1a9e55caec2d716dad57b26900b5ed672\n\n# How do the Insiders feel?\n\n**According to Quiver Quant:**\n\n>Dell Technologies insiders have traded $DELL stock on the open market 464 times in the past 6 months. Of those trades, **0 have been purchases** and **464 have been sales**.  \nHere’s a breakdown of [recent trading of $DELL stock](https://www.quiverquant.com/stock/DELL/insiders/) by insiders over the last 6 months:\n\n* [MICHAEL S DELL](https://www.quiverquant.com/insiders/908724/Michael-S-Dell) (Chief Executive Officer) has made 0 purchases and 2 sales selling 16,253,968 shares for an estimated **$2,222,753,260**.\n* IV (GP), L.L.C. SLTA has made 0 purchases and 221 sales selling 6,315,957 shares for an estimated **$864,817,529**.\n* V (GP), L.L.C. SLTA has made 0 purchases and 221 sales selling 6,315,957 shares for an estimated **$864,817,529**.\n* [WILLIAM D GREEN](https://www.quiverquant.com/insiders/1232906/William-D-Green) has made 0 purchases and 6 sales selling 272,736 shares for an estimated **$39,695,260**.\n* [ELLEN JAMISON KULLMAN](https://www.quiverquant.com/insiders/1303141/ELLEN-JAMISON-KULLMAN) sold 79,806 shares for an estimated **$12,255,009**\n* [WILLIAM F SCANNELL](https://www.quiverquant.com/insiders/1554376/WILLIAM-F-SCANNELL) (Pres., Glob. Sales & Cust. Ops) sold 91,230 shares for an estimated **$10,803,456**\n* [EGON DURBAN](https://www.quiverquant.com/insiders/1651403/EGON-DURBAN) sold 71,000 shares for an estimated **$9,806,520 . . .**\n\n# External Considerations\n\n* **The fed already booted up QE**\n   * *The fed started reserve management purchases (soft QE?) but its at a much smaller rate than before and only to short dated treasury bills. Beyond providing some health for smallcaps and unfucking the bond yield rates, I don't see this affecting my play for Dell in any meaningful way.*\n* **AI unwind**\n   * This does not rely on the \"AI Bubble\" or \"AI sentiment souring.\" If AI is dying through the market, this will just be added headwind for Dell.\n* **What if the RAM Shortage Ends too soon to matter?**\n   * Its already happening, and Dell is ALREADY feeling the pain... moreso than others in its sector (likely HPQ is going through the same but it doesnt seem to be have much meat left on the bones)\n   * RAM production facilities are being built but will take years to start being operational to matter for this play.\n\n**Positions:**\n\n20x DELL Mar 20 2026 90 Put\n\n80x DELL APR 17, 2026 75 Put\n\n*And I will be accumulating more as we get closer to their earnings in February*\n\n*Since Dell's earnings is in February and Micron's earnings will be in March, i might flip my winnings(if any) between the 2 dates.*\n\n***UPDATE (Jan 5 2026): Added to my positions***\n\nhttps://preview.redd.it/6g2m631szkbg1.png?width=1332&format=png&auto=webp&s=46c20b50c430872f5e7bb00fabbe6e88ed742973\n\n***UPDATE (Jan 8 2026): Trimmed some from my holdings***\n\nhttps://preview.redd.it/55j7gnxi47cg1.png?width=1382&format=png&auto=webp&s=5eb8fd2781244d68dbf9c92fa4432fa9459bab59\n\n",
        "ticker": "DELL"
    },
    {
        "post_id": "1ppd8z1",
        "post_title": "POET: The Photonic Solution to the SSD & RAM Shortage",
        "text": "We're all fully aware of what's going on with the supply chain shortages on RAM and SSD. [Kingston](https://www.pcgamer.com/hardware/memory/kingston-sounds-the-ssd-pricing-alarm-as-the-company-has-seen-a-246-percent-increase-in-nand-wafer-prices-with-the-biggest-increase-within-the-last-60-days/) sent out a warning stating that NAND costs are up 246% since early 2025 and says RAM/SSD prices are likely to keep rising through 2026 rather than come back down. [SK Hynix](https://www.techpowerup.com/344063/sk-hynix-forecasts-tight-memory-supply-lasting-through-2028) is telling investors that the global memory shortage could drag on until 2028, even as they and Samsung print multi year high profits on AI memory. NAND suppliers are already reporting that their 2026 enterprise SSD allocations are basically sold out, with double-digit price hikes locked in. On top of this, hyperscalers are only getting about [70% of the server DRAM they order](https://www.tomshardware.com/pc-components/storage/server-dram-prices-surge-50-percent), even after accepting contract price increases of up to 50% in a single quarter. Then you got Sam Altman doing his best impression of Dr. Evil prebooking [40% of the world's DRAM](https://www.mooreslawisdead.com/post/sam-altman-s-dirty-dram-deal) wafers with money that has yet to be seen.\n\nI say all this to say, HBM/DRAM/flash has become the new oil for AI, and everyone is fighting over the same barrels. What I have come to notice is that real choke point isn’t just how much memory you can buy, it’s how efficiently you can use the memory you already have, and how fast you can shove bits between GPUs, DRAM pools, and SSDs without the copper plumbing melting down and draining power grids of every last drop of electricity they can possibly produce.\n\nIn light of the RAM/SSD shortage, this has become a conversation about **finding solutions that can maximize the compute potential of the currently existing infrastructure to meet current AI demands**\n\nThis is where POET’s photonic engines come in: they don’t manufacture a single RAM chip or SSD, but they act like adding extra lanes to the AI data highway, letting data centers squeeze more training and inference out of every scarce byte of HBM/DRAM/flash.\n\n**So POET has two main products:**\n\n[The Optical Interposer](https://www.poet-technologies.com/technology) \\- think of this as an “optical motherboard tile/chiplet.”\n\n[Starlight](https://www.poet-technologies.com/products/starlight) \\- an external laser farm that feeds those tiles with light.\n\nToday’s optics usually look like this:\n\n* You’ve got a discrete transceiver module in a metal “gold box.”\n* Inside that box: lasers, modulators, drivers, receivers, lenses, fiber alignment, etc.\n* Every module is handheld, robot aligned, and tuned. Slow, expensive, power-hungry.\n\nPOET’s interposer basically says fuck the gold box\n\n* They take silicon and III-V lasers and build everything into a flat wafer-scale platform.\n* Instead of doing micron-level alignment one module at a time, they pattern the waveguides in lithography and drop the chips on with cheap pick-and-place tools.\n* Fibers line up passively, so there's really no heavy and expensive manufacturing process involved\n* The parts on the interposer are configureable, so this gives hyperscalers flexibility to choose which components and tier of components they would like on the interposer. think of the interposer like a complex lego block and you can piece together whichever legos you want to it.\n\nTo visualize, the interposer sits between the hot compute chips (GPUs/ASICs/NPUs) and the outside world (network, memory pools, storage) and replaces a bunch of copper with light paths.\n\n**Starlight is more of a accessory to the interposer.**\n\n* Instead of putting hot, fragile lasers on the GPU/package, they park the lasers off to the side in a dedicated module.\n* That Starlight box pumps clean laser light over fiber into a bunch of POET interposer engines sitting near the compute.\n\n**The benefits are:**\n\n* Keeps lasers away from 700W space heaters (GB200, H100, etc.).\n* One laser farm can feed many engines instead of every module lugging its own lasers.\n* Better reliability, easier maintenance, and lower $/bit because you share the light source across multiple links.\n\n**So together these two components work like this:**\n\nStarlight = shared light source\n\nInterposer = cheap, configurable, mass-produced optical engine tile that is easily scalable. This is probably the biggest sell for me on this product, as this gives hyperscalers more flexibility to customize the interposer\n\n**So how is different from the other companies that offer a photonics solution?**\n\nMost of the big incumbents (Broadcom, Coherent, Lumentum, etc.) are still:\n\n* Shipping discrete pluggable modules (400G/800G, etc.).\n* Using a lot of active alignment and labor-intensive packaging.\n* Typically putting lasers inside every module, which:\n   * Wastes power\n   * Adds heat right where you don’t want it\n   * Doesn’t scale nicely to 1.6T / 3.2T and giant AI fabrics.\n\n**POET’s edge vs “generic” silicon photonics:**\n\n* Wafer-scale, passive alignment which lowers capex, lowers assembly cost, and is easier to ramp volume.\n* Allows hybrid integration: can mix and match best-of-breed lasers with silicon in one platform.\n* Remote lasers (Starlight) which results in fewer total lasers and less heat on the package.\n\nAnd if you're wondering if any of this technology has even been validated, look no further than Marvell Technologies, [who purchased one of POET's largest customers](https://investor.marvell.com/news-events/press-releases/detail/1000/marvell-to-acquire-celestial-ai-accelerating-scale-up-connectivity-for-next-generation-data-centers), Celestial AI, for up to $5+ billion. Marvell's main reason for acquiring Celestial AI was for its Photonic Fabric, an optical interconnect architecture that is built atop POET's Optical Interposer and uses POET’s Starlight as a remote laser source.\n\nIn other words, a serious, blue-chip semi company and at least one hyperscaler ([AWS](https://mlq.ai/earnings/highlight/MRVL-marvell-partners-strategically-with-aws-dd4124/#google_vignette)) have already done the homework on this architecture and decided it’s real enough to bet billions and multi-year roadmaps on. You don’t build a next-gen AI fabric around external lasers and wafer-scale photonics if you’re not confident the vendors in that stack can actually meet the eye diagrams, BER targets, thermal budgets, and manufacturing yields you need at hyperscale. The Marvell/Celestial deal is basically the the big dawgs in the room saying: “Yes, this class of photonic solution is how we’re going to attack the I/O wall.”\n\nAlso, Celestial AI's CEO, [David Lazovsky](https://www.linkedin.com/in/david-lazovsky-734058a), was the Executive Chairman at POET\n\nHow does any of this actually help with the RAM/SSD shortage?\n\nPOET obviously doesn’t fab a single DRAM chip or SSD, so the way they solve the shortage is indirect, but very real: they change the economics of how much useful work you can squeeze out of every byte of memory and every GPU you already own.\n\nRight now, hyperscalers are in a ridiculous situation. They’re paying insane prices for HBM, DRAM, and enterprise SSDs, but a lot of that capacity is effectively stranded. You have GPUs sitting on islands of local HBM, servers with their own DRAM, storage boxes full of flash, and the copper between them can’t move data fast enough. So to keep latency acceptable, the big guys end up replicating the same data all over the place, sharding models, caching datasets on every node, and overbuilding memory just so the network doesn’t become a brick wall. That’s fine when RAM is cheap. It’s a killer when HBM/DRAM/flash prices are up 200% over the last month.\n\nOn the power side, POET’s own FAQ for their 800G/1.6T engines spells out that by using directly modulated lasers and getting rid of extra modulators, wirebonds, and gearbox/DSP overhead, they can cut about **6–8 watts of power per module** versus conventional approaches at these speeds. Six to eight watts doesn’t sound like much until you remember you’re not deploying one module, you’re deploying thousands. At 10,000 modules across a big AI cluster, that’s **60–80 kW of power and cooling you’re not wasting just on the optics layer.** That “freed” power budget can either lower your overall TCO or be reallocated to more GPUs and more memory in the same rack/power envelope.\n\nThen there’s cost. In their Starlight FAQ, POET flat-out says that for Celestial AI, the Starlight external light source is expected to be **up to 75% cheaper than comparable light sources on the market**, thanks to the Optical Interposer’s lower bill of materials and wafer level assembly. Cheap optics are what allow hyperscalers to overspec bandwidth relative to memory, which is exactly what you want when memory itself is the constrained resource.\n\nThere’s also a quiet supply angle baked in: their 1.6T transmitter is the first to efficiently use an electroabsorption modulated laser array in this way, and POET explicitly calls out that it gives a “dramatic capacity increase” for Indium Phosphide electroabsorption modulated lasers at a time when the industry is facing shortages of those lasers. In other words, they’re not just stretching HBM/DRAM/SSD; they’re also stretching scarce laser capacity on the photonics side by packing more usable throughput per laser device.\n\n**Put that together in plain English: a single POET-based engine gives you terabit-class bandwidth in a tiny footprint, saves you several watts per port at 800G/1.6T, cuts your light source cost by as much as three-quarters, and increases the amount of traffic you can push per scarce laser. That’s what makes it a lever against the memory/SSD shortages. this results in:**\n\n* **GPUs spend more time actually computing instead of waiting on I/O.**\n* **You need fewer duplicate copies of data sprayed across the cluster just to hide latency.**\n* **You can justify architecting shared memory pools and far-flash tiers because the fabric is fast and efficient enough to make them usable.**\n\nSo in a world where HBM/DRAM/SSD are the new oil and the barrels are sold out years in advance, POET’s pitch is basically: “Let us give you 1.6 Tbps-class optical engines that burn 6–8 W less per port and slash light-source cost by up to 75%, so you can stop wasting the obscenely expensive memory you already have.” This ultimately maximizes the compute potential of the present AI infrastructure to meet current AI demands and lessens the reliance on more compute power and SSD/RAM.\n\n**TL;DR**\n\nAI has turned HBM/DRAM/flash into the new oil. Prices are ripping, supply is pre-sold years out, and hyperscalers still can’t get all the memory they want – but the real choke point now is how efficiently they can use the insanely expensive RAM/SSD they already have and how fast they can move data between GPUs, DRAM pools, and storage. POET attacks that bottleneck: its Optical Interposer replaces bulky “gold box” optics with a wafer-scale, Lego-style optical tile, and its Starlight module moves the lasers off the hot GPU package into a shared external laser farm, making high-bandwidth links cheaper, cooler, and easier to scale. That lets photonic fabrics deliver terabit-class bandwidth, cut power and light-source cost, and reduce stranded/duplicated data, so you get more training and inference per GPU and per GB of HBM/DRAM/SSD instead of just brute-forcing with more hardware. In a world where memory is scarce and pre-booked, POET doesn’t make bytes – it makes the plumbing that squeezes more value out of every byte, and the Marvell–Celestial AI deal is the big-cap validation that this external-laser, photonic-fabric path is actually where hyperscalers are headed.\n\n**Position:**\n\nhttps://preview.redd.it/r5bsoo1s3v7g1.jpg?width=1290&format=pjpg&auto=webp&s=3f4ee644739ce9eac72992f7d84be909b9c8f6e8\n\n\n\n\nEdit:\n\nInteresting Statement:\n\n“Dave Brown, Vice President of Compute and Machine Learning Services at AWS, commented on Marvell’s acquisition of Celestial AI in their official announcement, stating: “At AWS, we aim to be at the forefront of major technology inflections, and we believe optical interconnects will play an important role in the future of AI infrastructure. Building a scalable, high-performance, and power-efficient cloud starts with an approach built upon differentiated technologies. Celestial AI has made impressive progress, and we expect their combination with a large-scale semiconductor company like Marvell will help further accelerate optical scale-up innovation for next-generation AI deployments.””",
        "ticker": "POET"
    },
    {
        "post_id": "1pope48",
        "post_title": "Long Oil Futures (March Exp) $355k exposure?",
        "text": "I bought a bunch the last two days. These low prices are purely political. Turmp is close with MBS. They have been trading geopolitical favors for a while.\n\nTrump wants oil low, inflation down, MBS has been pumping despite the low prices. Usually this is when OPEC+ will turn it down. \n\n\nChina has benefitted from the Venezuela, Russia, and Iran sanctions for years buying all their sanctioned oil on the discount. It’s not a huge amount, but taking their Venezuela 🇻🇪 production off the market will cause a disruption in this “private” market they have been stocking up on. If China has to start buying in the open market, oil prices are pretty inelastic on the short term. \n\nMy average costs is $56.55 after averaging down some more today. Still have some limit orders if it drops more and will continue to load up.\n\nQuick math but I I own (65 contracts x $6 07 x 9x leverage per contract ) \n\nThat’s like $355,000 of oil futures. It’s a lot of fun with the leverage! \n\n1% in either directions and it’s like $5-10k. 🥭 might go on TV, nuke the Venezuela tankers, and we see a 2-3% movement no problem. \n\nThis is any easy play. I have 3 months to wait this this out for a $20,000-30,000 gain if it hit $60+",
        "ticker": null
    },
    {
        "post_id": "1po9o0z",
        "post_title": "Time-sensitive DD: QTUM ETF rebalance on 19-Dec will hurt RGTI",
        "text": "# ETF Rebalance\n\nRGTI is facing a perfect storm this Friday, December 19th, with massive forced selling incoming. \n\nThe $3.2B Defiance Quantum ETF (QTUM) is rebalancing and must dump $30 million in RGTI shares and another $10 million in IONQ. \n\nThis isn't speculation; it's a mechanical event. RGTI is also in other ETFs rebalancing the same day, meaning even more selling pressure is coming for a stock with a low float.\n\nCalculation:\n\nhttps://preview.redd.it/auvc8qx5yl7g1.png?width=1055&format=png&auto=webp&s=d1825d7be223a21b90c341de0d0d4a177ef7100e\n\nRGTI is part of other ETFs also the one's circled in red will be rebalanced on the 19-Dec and if the calculation is similar they will also sell RGTI is large quantities.\n\nSince most other ETFs are bond+stock type etfs with varied weighting we may see a slightly different outcome, but the point remains - RGTI has gone up over the quarter and unlike other companies it has a P/E that's negative EPS < 0 and stock price too high\n\nhttps://preview.redd.it/aqd5pibjyl7g1.png?width=1288&format=png&auto=webp&s=622bf3a30c890f85a06425d0c19697a13aac7bcb\n\n# Insider Selling continues\n\nhttps://preview.redd.it/j75o7zbbyl7g1.png?width=1377&format=png&auto=webp&s=98433d1b8d2f16c0785481a7ce0d34868aca508f\n\nWhile the ETFs are forced to sell, insiders have been voluntarily bailing for years. There have been **zero insider purchases since June 2022**. The latest sells were just days ago on December 10th. Most damning of all, **the CEO owns zero shares** in the company he runs. The people with all the information are showing zero confidence.  \nLast sell was 7 days ago 9-Dec.\n\nThis is happening to a company with laughable fundamentals. RGTI has a $10 billion market cap but generated less than $2 million in revenue last quarter. It's burning through $43.6 million in cash every 9 months, propped up by selling shares to retail investors. The valuation is a complete fantasy disconnected from reality.\n\nThis Friday, a wave of forced selling is going to crash into a stock that insiders have already abandoned and that has no fundamental support. The correction is going to be brutal.\n\n\n\n**Position: +100 RGTZ. Total of 350 RGTZ.**\n\nhttps://preview.redd.it/f3ai3mfm0m7g1.png?width=725&format=png&auto=webp&s=c862792d93e3bc693fadfec66cfade216154b712\n\n\n\nNFA...obvi.",
        "ticker": "RGTZ"
    },
    {
        "post_id": "1pnrjix",
        "post_title": "CLF Calls 🚀",
        "text": "CLF stock one of the very very few companies in steel industry that’s not up multiple hundred percent in last 5 years. \n\nStock is going to pay massive been bullish and bearish over the years told everyone my strategies for this company.. the time has come… \n\n\\-Very high potential POSCO investment 10-20% stake \n\n\\-Idling and closing low margin plants may have already closed. More to come.\n\n\\- Rare earth mining possibilities in mines they already use for iron, could be huge for US dependence.\n\n\\-Tariffs pushing profits \n\n\\-Fed Powell will be out in may 2026 more interest rate cuts will help with Debt on top of POSCO investment.\n\n\\- Interest free loans for Vehicles will help capitalize on value intensive market\n\nCalls after may to increase potential allowing for another quarterly filing after 10-k in February. Allow for profits to massively increase. Stock prediction pessimistic over $20- optimistic over $30",
        "ticker": "CLF"
    },
    {
        "post_id": "1pnngev",
        "post_title": "Cigs Are Good For You: Why Oral Turns Me on!",
        "text": "TLDR: Altria is a deep value buy. The US cig ecosystem is fundamentally misunderstood. The market doesn't see pouches as a growth vector for companies other than PMI and discounts the future attrition of customers (largely young, non smokers) from pouches to cigs that will inevitably result. If On!’s growth follows historical and grows near 60% CAGR it will account for more than 75% of the company's oral volume and drive the segment to generate more than 20% of Altria’s total revenue in 2029 (versus a negligible 3% total total volume in 2024). Altria bought Helix, which makes on!, for around 610M over two entries starting in 2019 and in 2024 the on! did around 500M in revenue. The market has overlooked on! as a growth driver because its baked into the oral segment in Altria's earning reports, guidance, and financials, but it doesn't behave like an oral segment product -> its not chewing tobacco the same way cigars are not cigs. Once it grows to a point of financial significance in Altria's portfolio the market is going to **re-rate** the stock.\n\n[DCF](https://docs.google.com/spreadsheets/d/1rucQrCYaauu2FyVJHPaUGbGEklXFbKNL2DlBFlravWc/edit?usp=sharing)\n\nAltria Group (MO) has a significant moat in the US cig market (45.8% of US Cigarette Market, 59.3% of US Premium Cigarette Market, 37.5% of US Smokeless Tobacco Market), but the problem is US cig sales have been declining YoY seemingly forever.\n\nhttps://preview.redd.it/m5d0hbj6dg7g1.png?width=1774&format=png&auto=webp&s=bafc219ff278ed4bb0e6ca82c138cd864e75a58c\n\nAnd Altria's revenues reflect this to even more drastic extent.\n\nhttps://preview.redd.it/8kwqez5cdg7g1.png?width=1792&format=png&auto=webp&s=d2cad0c05b5106dbc362823ba458d3ff04693c5e\n\nCigs' share of nicotine market fell to a low of 60% in 2024 down from 90% in 2000. Broad industry growth is now driven exclusively by emerging markets (Altria operates only in the US in which \\~19% of Americans 15 or older currently use tobacco products vs \\~25% of Europeans 15 or olders). Altria's US cig moat and lack of apparent growth driver (they sold IQOS system to PMI -> IQOS is the future of vapes) is starting to be viewed by the market as a liability and as a result its trading at an extreme discount to peers.\n\nhttps://preview.redd.it/jrlj1eqceg7g1.png?width=1884&format=png&auto=webp&s=b7cda30d5734f8478d1cb06d625a577e5e703ae8\n\nBut Altria does have a growth driver, on! Altria bought Helix, which makes on!, for around 610M over two entries starting in 2019 and in 2024 the on! did around 500M in revenue. US Pouch Market grew at an average annual rate of 50% 2020-2024. on! currently outpaces the growth of the US Pouches Market over the last 5 years growing at an average annual rate of 70%. Industry estimates project a US Nicotine Pouches Market CAGR of 28%-50% through 2034 ($250B+ Market). on! trails behind Zyn but still controls 30% market share in a near duopolistic environment.\n\nhttps://preview.redd.it/s5irjit4fg7g1.png?width=1342&format=png&auto=webp&s=3e579c5f4ae549ef1cf392d8cb98495e0d60cd11\n\nThe market (and even Altria itself) is completely ignoring on! because as its stands now it is a inconsequential revenue or growth driver in Altria's portfolio. on!’s numbers are buried in Altria’s financials and earnings reports, combined with chewing tobacco as the total oral segment instead of a standalone “pouches” segment; on! doesn't behave like an oral segment product -> its not chewing tobacco the same way cigars are not cigs. In 2024 on! was only 20% of Altria’s oral units sold and accounted for only 2.4% of revenue. If on!’s historical growth rate of 60% continues through 2029 on! will be 75% of Altria’s oral volume and 25% of total revenue. on!’s trajectory positions it as a core earnings growth driver not yet rated by the market.\n\nhttps://preview.redd.it/2c4hxmlufg7g1.png?width=1412&format=png&auto=webp&s=9d95c83a1f7b363ac65ec07f394669aaf37851eb\n\nhttps://preview.redd.it/8erfronyfg7g1.png?width=1312&format=png&auto=webp&s=8ab8f1b46f66ae868912f00487c5647f9aab37f8\n\nThe problem is that this DD implies a buy and hold and then  wait for the market to catch up and rerate the stock, hoping all the while that the bleeding stops. Except not really. You're more than compensated for your time here. Altria maintains disciplined share repurchases and a stable dividend policy (78.6% Payout). The company has committed up to $2 billion in share repurchasing by the end of 2026, $1.3 billion remaining authorized. So here we get both buybacks and divs in a consumer staple that trades at a discount to peers in a macro environment with fearful sensibilities.\n\nhttps://preview.redd.it/2vtdt51kgg7g1.png?width=828&format=png&auto=webp&s=5fe566e69715631c8098b7350314542187386499\n\nhttps://preview.redd.it/wa98hl2ngg7g1.png?width=1124&format=png&auto=webp&s=d70233abb42a1fbb31bd850d721e0bc8431742ed\n\nAnd despite falling revenues, margins continue to grow with no sight of slowing down. Altria is largely insulated from tariffs given their domestic business model, and as pouches scale, margins will widen there as well.\n\nhttps://preview.redd.it/6tqmrvkygg7g1.png?width=1366&format=png&auto=webp&s=463b82a11af2422c46ff6164b9634567358d2e81\n\nIn fact, the more we look at revenues broadly, the more it looks over played. Not only do they grow margins at every mark, if we excise tax is taken out from COGS, it shows that Altria has cut cost at every corner. + if we read revenues net of excise tax it actually shows revenue growth\n\nhttps://preview.redd.it/bu5y3j4jhg7g1.png?width=1286&format=png&auto=webp&s=0d9e4135d31a0212151d237e13079825986512c1\n\nBut the thing that is most compelling here is that the US tobacco market is just fundamentally misunderstood. The market sees this well observed declining trend (declining consumption of tobacco products) and views it as baked in and linear. They think the future generations wont smoke and that cig is a staple of a dying breed. But this is not the case. It is a highly addictive drug that will continue to grow. The bottom of the sentiment is in. Joe rogan says cigs are good for you. Dr Huberman says cigs are good for you. Cigs are a nootropic that stimulate the mind and actually make you smarter and better looking and better at life. The evil tobacco barons of old couldn't have devised a better psyop to get people to smoke. The product is being authentically re-marketed to younger generations. & pouches growth is a manifestation of this. Pouches are not eating into cig sales in adding more speed to a declining trend, instead the decline is stable and the pouch growth is exponential. This implies significant customer acquisition to newer, non smoking, younger consumers. The research on this is highly contested as pouch research is new, but as these customers are acquired there will be some natural attrition to cigs. Some % (like 1 in 5) of non smoking pouch consumers will ultimately become cig consumers, and in the US Altria controls 50% of the cig market, so that moat that the market views more and more as a liability, will only prove to be more and more of an asset in the coming years. Regardless, the cigs are good for you psyop at the very least signal a bottoming out in the declining tobacco sentiment in the US, indicating the declining trend is a lot less sticky than the market has priced.\n\nhttps://preview.redd.it/40pp2qv0jg7g1.png?width=1170&format=png&auto=webp&s=238841aca72458a42a1159aae7e8a94899a690d4\n\nI did a DCF which I've linked above which gave an intrinsic value of $78 with a MOS of 35%. I then did a sensitivity table under different conditions (bull v bear, see assumptions in the DCF but the primary are revenue broadly and revenue in on!). The DCF only affirmed the thesis. The bull case was achieved with declining revenues in each of Altria’s product lines except on!\n\nhttps://preview.redd.it/jwhbpuqkjg7g1.png?width=1280&format=png&auto=webp&s=c463d34b318325ecc62de2d2836e7899298bb3a0\n\nhttps://preview.redd.it/7l08nezyjg7g1.png?width=944&format=png&auto=webp&s=2424f6d00baec4b0dff00047b119443af105f7ef\n\nhttps://preview.redd.it/d0nw8k81kg7g1.png?width=1232&format=png&auto=webp&s=50280b49003b1a5c06e03222d3ef1d2ac40734da\n\nhttps://preview.redd.it/942pyqd2kg7g1.png?width=1232&format=png&auto=webp&s=6009090b19a6e01bd5d4c394d6b2e8317ddc09c0\n\nfck it i just posted one of the DCFs (base case) cuz idk if the links are gunna work so sorry about that but there you go. Basically the DD shows **BUY** & hold Altria (MO) for 5 Years or until market re-rates the stock as on! becomes a noticeable earnings growth driver and pouch industry customer acquisition growth results in customer attrition back to Altria’s US cigarette moat.\n\n[In-Depth Analysis](https://docs.google.com/document/d/11BsFxiTMIblfpRWofm8hEjjB0LcaWB-ir5zCnzAoez4/edit?usp=sharing)",
        "ticker": "MO"
    },
    {
        "post_id": "1pnjggp",
        "post_title": "DD: McDonald's MCD - Burger Joint Is About to Print Money",
        "text": "**TLDR**: McDonald's isn't a fast-food company. It's a real estate juggernaut and tech company that happens to sell burgers. With 185 million loyalty users, an AI-powered digital transformation, a plan to add 10,000 restaurants by 2027, and 82% operating margins on franchise income, this \"boring boomer stock\" is about to break out. Stock is trading at $316 near all-time highs and analysts have a $335 target. I think $400+ is in play by end of 2026.\n\n\"We Are Not in the Food Business\"\nListen up, you degenerate casino patrons. I know what you're thinking - \"MCD? Really? My grandma owns that stock.\" Well guess what? Your grandma is smarter than you, and she's been collecting 2.24% dividends while you've been bag-holding whatever garbage stock some Discord \"guru\" told you to buy.\nBut here's what most people don't understand about McDonald's. Former CFO Harry Sonneborn literally said: \"We are not technically in the food business. We are in the real estate business. The only reason we sell fifteen-cent hamburgers is because they are the greatest producer of revenue from which our tenants can pay us rent.\"\nThat's right. McDonald's is essentially a $42 BILLION real estate company that uses hamburgers as a rent collection mechanism. The Golden Arches are basically a REIT with extra steps.\n\nThe Numbers That Should Make You Hard\nLet me break down why this stock is criminally undervalued:\nThe Real Estate Empire\n\nMcDonald's owns ~45% of the land and ~70% of the buildings where its 43,000+ restaurants operate\n$42 billion in real estate assets on the balance sheet\n93% of restaurants are franchised - meaning McDonald's just collects rent and royalties\nFranchisees pay 4% royalties PLUS 8-15% of sales in rent\nOperating margin on franchise revenue: 82% (compared to ~16% on company-operated stores)\n\nLet that sink in. When you buy a Big Mac, most of that profit doesn't come from the beef patty - it comes from the franchisee paying rent to corporate McDonald's. They've turned fast food into a landlord simulator.\n2024-2025 Financials\n\nQ3 2025 revenue: $7.078 billion (+3% YoY)\nGlobal comparable sales: +3.6%\nSystemwide sales: $131 billion across 43,000+ locations in 115 markets\nMarket cap: ~$226 billion\nP/E ratio: 27\nDividend yield: 2.24% (they just raised it 6% in Q3 2024)\nFree cash flow machine - they literally print money\n\n\nThe Catalyst Nobody Is Talking About: \"Digitizing the Arches\"\nHere's where it gets spicy. McDonald's isn't just sitting on their laurels counting rent checks. They're in the middle of a \"once-in-a-generation\" digital transformation that is absolutely bonkers:\nAI and Technology Deployment\nMcDonald's partnered with Google Cloud and is rolling out:\n\nRestaurant Platform Edge - Cloud computing inside restaurants enabling real-time AI and IoT. Already live in hundreds of U.S. locations.\nAI-Powered Accuracy Scales - Weighing outgoing orders and flagging missing items BEFORE they leave. Deployed in thousands of restaurants across 12 markets.\nVirtual AI Manager - Introduced January 2025. This thing schedules crews, audits food safety, handles predictive maintenance, and basically runs the restaurant.\nDrive-Thru AI - Early pilots show 27 seconds faster service time, 10% more car throughput, and $65,000 additional annual revenue per store.\n\nDo the math: If they roll this out to even 20,000 locations, that's $1.3 BILLION in additional annual revenue just from faster drive-thrus.\nThe Loyalty Program is Insane\n\n185 million 90-day active users (as of Q2 2025)\nTarget: 250 million by 2027\nU.S. members visit 26 times per year after joining vs. 10.5 times before\nThat's a 147% increase in visits.\n\nThey're not just selling burgers - they're building a consumer data platform that rivals tech companies. And they just started letting users redeem points for things like Snapchat+ subscriptions. This isn't your grandfather's fast food chain.\n\nThe Expansion Play: 50,000 Restaurants by 2027\nMcDonald's is about to experience the fastest unit growth in company history:\n\nOpening ~2,200 new restaurants in 2025\nTarget: 50,000 total restaurants by end of 2027 (up from 43,000 today)\n1,000 new stores in China alone in 2025\nThat's adding roughly the entire Chipotle footprint every 2 years\n\nEach new restaurant = more rent, more royalties, more data for the AI systems.\n\nWhy \"Boring\" = Tendies\n\nMCD has a beta of 0.52. That means when the market crashes, this thing barely moves. When your options portfolio is down 80%, McDonald's will be sitting there like a rock, paying dividends.\nInstitutional ownership sits around 70-75% of shares DCFmodeling.com",
        "ticker": "MCD"
    },
    {
        "post_id": "1pn2xxn",
        "post_title": "MSTR Is Living on Borrowed Time",
        "text": "**TL;DR:**  \n**My take: MSTR doesn’t survive more than \\~3 years in most realistic scenarios.**  \nBTC down → MSTR dies fast.  \nBTC flat → MSTR bleeds out paying dividends + interest.  \nBTC goes mainstream → ETFs kill the premium and dilution stops working.  \nDifferent paths, same ending.\n\nLonger version for anyone who still has attention span:\n\nI’ve been looking at MSTR for a while and I honestly don’t see a future where this thing works long term unless Bitcoin keeps doing insane, volatile bull runs forever *and* the market keeps clapping while getting diluted.\n\nAt this point MSTR isn’t a software company. It’s a leveraged Bitcoin balance sheet with a legacy business taped on. The stock trades like BTC on steroids. That’s great when BTC is ripping. It’s terrible when time passes.\n\nHere’s the part people gloss over: MSTR has real cash bills. Preferred dividends. Interest. Normal company expenses. Roughly a few hundred million a year that has to be paid in cash. The software business doesn’t cover it. So the whole strategy boils down to two options:\n\n* keep issuing stock\n* or eventually sell Bitcoin\n\nIssuing stock only works if MSTR trades at a premium to the Bitcoin it already owns. That premium is the entire engine. Once it shrinks, dilution stops being “genius capital markets strategy” and starts being “why am I getting wrecked every quarter.”\n\nWe already saw MSTR trade close to its BTC value. That’s the model coughing.\n\nEveryone thinks a BTC crash is the risk. I think boring Bitcoin is worse. If BTC just chops sideways for a year or two, volatility dries up, hype fades, and the premium slowly leaks away while dividends and interest keep draining cash. Cash reserves buy time, not survival.\n\nAnd here’s the ironic part: if Bitcoin actually *wins* and becomes mainstream, I still don’t think MSTR wins. In that world, people buy ETFs or hold BTC directly. No dilution. No debt. No CEO risk. MSTR goes from “unique BTC proxy” to “why would I own this instead of IBIT?”\n\nSo take your pick:\n\n* BTC crashes → MSTR blows up\n* BTC goes sideways → MSTR bleeds out\n* BTC becomes fully adopted → MSTR becomes irrelevant\n\nThe only universe where this works long term is one where Bitcoin keeps delivering face-ripping bull runs forever and investors keep accepting dilution indefinitely. That’s not a business model, that’s a belief system.\n\nNot saying it won’t pump again. It probably will. This thing feeds on volatility and vibes.\n\nBut zoom out and it feels less like a company and more like a countdown.\n\nThat’s my take. Flame away.\n\n**Some actual math:**\n\n* **Bitcoin held:** \\~**650,000 BTC** (varies slightly with recent buys; order of magnitude matters)\n* **BTC value (at $90k):** 650,000 × 90,000 ≈ **$58.5B**\n* **Cash on hand / reserve:** \\~**$1.3–1.5B** (company explicitly set this aside for dividends + debt service)\n* **Annual preferred dividends:** ≈ **$85–90M per year** (cash, not optional long term)\n* **Annual interest expense:** Roughly **$200–250M per year** across converts + senior notes\n* **Total fixed cash burn:** ≈ **$300–340M per year** (before software ops, which are roughly breakeven at best)\n* **Runway math (flat BTC, no new dilution):** $1.4B ÷ $320M ≈ **4.3 years**\n* **More realistic runway (assuming some continued buying / volatility):** **\\~2.5–3.5 years**\n* **Important detail:**\n   * Interest on debt → **cannot be skipped** without default\n   * Preferred dividends → can be deferred temporarily, but **they accumulate** and make refinancing harder\n   * Software business → does **not** cover these obligations\n* **Key structural issue:** The moment MSTR trades near or below BTC NAV, issuing stock becomes value-destructive → dilution stops working → cash runway becomes the only clock.\n* **What forces BTC selling:** Flat BTC + compressed premium + fixed cash burn = **selling BTC becomes rational**, not ideological.\n\nPosition: Small position, adding slowly. No options access as a foreign investor so adding MSTZ. Yes, decay sucks — but it’s still the cleanest way for me to play this.\n\nhttps://preview.redd.it/fo4l66bn0f7g1.png?width=933&format=png&auto=webp&s=512a6f701f009864ad1780272d09c0658fec62c4\n\n￼​(DD assisted by AI)",
        "ticker": "MSTR"
    },
    {
        "post_id": "1pmskyv",
        "post_title": "Sweetgreen ($SG) Goat Status",
        "text": "Fast casual has taken a dump and Sweetgreen’s been hit the hardest. But the reality is:\n\n\\- fast casual continues to gain market share, winner over casual dining ($15 salad made to your liking still beats a $15 salad at a sit down where it’s probably all Sysco with a 20% tip)\n\n\\- Sweetgreen just hired an old exec from Chipotle as their DAO to help with margins\n\n\\- $230m cash on hand, enough to get through 2+ years at current burn rates, ignoring the fact they’re slowing down new restaurant openings to help with capital spend, and their 10% layoffs this year and sale of Spyce which took 38 engineers off their payroll\n\n\\- valuation is way off compared to peers, about 1x sales vs 4x for Cava and Chipotle\n\n\\- they now have a 1.2% stake in Wonder, which owns Grubhub and the ghost kitchen space and is going to scale their Infinite Kitchen technology, where sweetgreen retains the license and right to purchase at cost + 5%\n\n\\- ask any AI to rank the top 20 fast casual restaurants and which one has the most premium branding, SG is always on top\n\nBy the way:\n\n\\- 25% short interest\n\n\\- 95% held by institutions and insiders\n\n\\- it’s called “sweetgreen”\n\n\\- there’s an invite-only membership called “goat status” where you get various perks and when you pick up you get a black bag instead of a green one\n\n\\- every Becky I know loves sweetgreen. If you bought lululemon 10 years ago when they were all wearing it you’d be rich now\n\n\\- if you can’t afford an $15 salad then this isn’t for you. Go buy your $12 value meal\n\n\\- no one has ever complained about “sweetgreen shits” like they do with chipotle. Also all the others still use seed oils and make compromises with quality. High rollers can absolutely tell\n\nDO YOUR OWN RESEARCH! NOT FINANCIAL ADVICE.",
        "ticker": "SG"
    },
    {
        "post_id": "1pmng0g",
        "post_title": "Air Traffic Control Union vs Oil Prices🇺🇸",
        "text": "Air traffic controller here in the states. In my off time I enjoy researching economic data. Recently discovered my union has aligned our contracts with historical bottoms in oil prices (really bad for us). These guys would have beaten any trader in the world… One of those things in life that makes no sense but makes you say ‘woah’. There is definitely cyclical nature to it if you dig deeper. \n\nYes our contract is almost 10 years old and we have lost 16% of our purchasing power since 2016. They even extended our slate book contract in 2021 and caught that move which I did not depict. Legendary. \n\nMy goal is this catches fire and we can turn it into a meme indicator. Cheers. \n\nLong a few lots of CL\\_F next contract ink’ing. It will be the only trade you will ever need again. ",
        "ticker": null
    },
    {
        "post_id": "1plkxc7",
        "post_title": "TMUS - It is time",
        "text": "TMUS, probably the most oversold large cap stock in the market. It consistently bounces off its 150 SMA - shown on a weekly chart here - where it finds itself once again. \n\nThe fundamental case of why TMUS can meaningfully appreciate from here:\n\nSustained, above-consensus subscriber growth (volume engine): T-Mobile reported record postpaid customer additions in 2025 (millions of net adds across postpaid phone, other and prepaid from acquisitions), with large quarterly adds cited by the company and industry press. Strong net adds drive recurring service revenue, ARPU stability/upside, and superior churn economics vs. peers. This growth is the primary revenue engine that will compound cash flows.  ￼\n\n5G leadership and network scale that converts into share gains: T-Mobile built a broad mid-band 5G footprint faster than peers after the Sprint merger; that scale is translating to competitive advantage for coverage + performance, especially for price-sensitive consumers and suburban/rural areas. Faster, cheaper 5G motivates upgrades (premium plans, 5G broadband) and supports new services (fixed 5G broadband, enterprise customers). Company commentary and analysts emphasize its network-driven wins.  \n\nDiversifying revenue: broadband & fiber tuck-ins\n\nT-Mobile is not just phones — they’ve added 5G broadband customers and have acquired fiber customers (e.g., Metronet acquisitions) to scale fixed connectivity offerings. Owning both wireless and fiber/fixed broadband increases wallet share per household and improves lifetime value.  ￼\n\nMaterial free-cash-flow (FCF) tailwinds + aggressive capital returns: Management has increased guidance for EBITDA and FCF; the company just authorized a large $14.6B shareholder return program (through 2026) and raised its quarterly dividend — this both reduces share count and returns cash to investors, supporting EPS growth and multiple expansion. Buybacks + dividend increase are direct catalysts for total return.  ￼\n\nRoom for margin expansion (profit curve + operating leverage): As service revenue scales faster than incremental capex (once major 5G build is complete) and as fixed costs are spread over more subscribers, EBITDA margins can improve. Market commentary and management’s guidance point to steady service revenue growth (high-margin) and improving profitability.  ￼\n\nValuation gap + analyst upside: Recent analyst coverage still implies meaningful upside — examples include buy ratings / price targets in the $275–$280 range, suggesting \\~35–45% upside from current levels, supported by the fundamentals above and cash returns. If the market re-rates T-Mobile nearer to those comps, upside is substantial.  ￼\n\nNumbers that matter (evidence-backed):\n\nRecord net adds / scale: company reported multi-million postpaid adds in Q3 2025 (e.g., 3,287,000 postpaid phone & other adds referenced in the release / press). These are eye-popping numbers that materially grow revenue base.  ￼\n\nService revenue growth: management reported double-digit growth in postpaid service revenue and mid/high single-digit on overall service revenue in recent quarters. That’s a high-quality revenue stream.  ￼\n\nShareholder returns: $14.6B authorized program through 2026 + dividend increase to $1.02 per quarter (recently declared), both compress available shares and increase yield/total return.  ￼\n\nValuation framework & target:\n\nBase case (multiple expansion + FCF growth): If TMUS grows EBITDA modestly and continues buybacks that reduce share count \\~3–5% annually, the market could re-apply a telecom / growth multiple lift (say from mid-teens to low-20s on EV/EBITDA) as growth proves durable. That supports a move into the $250–$300 range over 12–24 months. (Analyst targets cluster near $275–$280.)  ￼\n\nConservative case: Execution slows but FCF and buybacks persist → low-double-digit total return from current price (dividend + modest multiple expansion) — downside limited by cash returns and resilient wireless cash flow.\n\nBull case: Continued share gains, ARPU stability, strong fiber/wireless bundling, and aggressive buybacks drive EPS substantially higher — stock re-rates to premium growth multiple → $300+ possible over 18–36 months.",
        "ticker": "TMUS"
    },
    {
        "post_id": "1pkh49q",
        "post_title": "KRMN: The Pick-and-Shovel Space Play",
        "text": "# TL;DR\n\nHere’s the whole thesis: If you believe space launches will increase, if you expect NASA, commercial satellite operators, national-security agencies, and private launch companies to keep expanding activity into orbit, then KRMN is a little-known company you *need* to know.\n\n=================================\n\n# The Short & Sweet\n\nKarman Holdings (**$KRMN**) is a little-known **aerospace and defense** company posting numbers that look nothing like the obscurity of its stock. Revenue up 23% YoY, net income up 191%, and a funded backlog up 35%, with guidance calling for another year *(and beyond)* of **double-digit expansion**. For a company most of you haven’t even heard of, these are eye-popping metrics.\n\nThe driver is straightforward: Karman builds high-spec structures, subsystems, and assemblies for **missiles, hypersonics, and next-gen launch vehicles**.\n\nIts acquisition of Metal Technology Inc. brought capabilities in ultra–high-temperature alloys, for materials used in **strategic missile programs** where steel melts and only special refractory metals survive. That move pushed Karman deeper into **classified supply chains** tied to U.S. rearmament, allied purchases, and the global shift toward tactical missile systems.\n\nKarman also sits inside both of the next-decade launch platforms: **Blue Origin’s New Glenn and ULA’s Vulcan**. Each is designed for national security, deep-space, and commercial missions. And since Karman supplies structural components to *both* vehicles, you don’t need to predict which rocket will win future contracts because the activity itself is the catalyst. **Karman wins either way**.\n\nKarman’s core markets (missile defense, hypersonics, and launch systems) are expanding, not contracting. That makes its recent pullback attractive.\n\n**Takeaway:** Karman is a company that sits inside every major missile and launch trend, and that trend will just accelerate.\n\n=================================\n\nWhat fueled **KRMN's 189% run** since its IPO on February 13?\n\n# The Long & Winding\n\nKarman Holdings (**$KRMN**) is an under-the-radar supplier embedded across some of the most important U.S. **space and missile-defense programs**.\n\nBut before we talk about what this company actually *does*, we start with the trail of evidence buried in its filings. After all, **numbers don’t care about narratives**. They don’t hype. They simply record the truth, especially the kind most people don't pay attention to.\n\nKarman’s disclosures reveal something quietly unusual. A company whose trajectory doesn’t match its obscurity. **Growth hiding behind small-cap camouflage**.\n\n# The Numbers Speak Before the Narrative\n\nWhile the company may be small, the numbers don’t lie. They signal momentum, and momentum in an obscure defense contractor is rarely accidental.\n\n# FY2024: A Record Across the Board\n\nOn April 8, 2025, KRMN reported:\n\n* **Revenue**: $345.3M, **+23% YoY**\n* **Net income**: $12.7M, **+191.3% YoY**\n* **Adjusted EBITDA**: $106.1M, **+29.7% YoY**\n* **Funded backlog**: $579.8M, **+35.2% YoY**\n\nFor a small-cap contractor, these are not ordinary numbers. This is a company stepping into a larger orbit (*get it?*)\n\n# 2025 Outlook: Expansion, Not Consolidation\n\nFor FY2025, Karman expects:\n\n* **Revenue**: $423–$433M\n* **Adjusted EBITDA**: $132–$137M\n\n**Double-digit growth on top of double-digit growth**.\n\n# Q1 2025: The Trend Continued\n\nOn May 13, 2025:\n\n* **EPS**: $0.05 (vs. $0.02 est.)\n* **Revenue**: $100.12M, **+20.6% YoY**\n\nGuidance reaffirmed. No slowdown.\n\nAt this point, some of you might realize that even though you’ve never heard of this company, these numbers look interesting.\n\nAnd they are. Because once you peel back the veil, the reason becomes obvious.\n\n# The CEO Speaks\n\nAfter delivering the [Business Outlook for the Full Year 2025](https://www.businesswire.com/news/home/20250408551721/en/Karman-Space-Defense-Reports-Full-Fiscal-Year-2024-Financial-Results), Tony Koblinski, Karman’s Chief Executive Officer, summarized it this way:\n\n>“Across numerous key metrics, we achieved record performance in 2024 that **positions us very well for growth in 2025 and beyond**.\n\n>Each of our end markets delivered **double-digit topline growth** and remains very well aligned with existing and emerging customer and **national priorities** in missiles, tactical defense systems, and space and launch systems.”\n\n[Karman Space & Defense Full-Fiscal Year 2024 Financial Results](https://www.businesswire.com/news/home/20250408551721/en/Karman-Space-Defense-Reports-Full-Fiscal-Year-2024-Financial-Results).\n\nhttps://preview.redd.it/r0axw9djuo6g1.png?width=2060&format=png&auto=webp&s=5219ac45ca574928c64b4621ec00d5af23d9c826\n\n[](https://preview.redd.it/krmn-the-pick-and-shovel-double-digit-growth-space-play-you-v0-dy38j9wc816g1.png?width=2060&format=png&auto=webp&s=7f7fb15b278bc34d6fada1c530bb23330f0d6276)\n\nKarman is one of the quiet cogs inside **America’s missile defense buildup, hypersonic development race, and next-generation launch ecosystem**. But to understand how deep that goes, we begin with a move that opened new doors.\n\n# The Metallurgical Key\n\nEarlier this year, Karman acquired Metal Technology Inc. (MTI), a company specializing in **ultra-high-temperature refractory alloys** used in strategic missile systems.\n\nMTI works with materials such as Tantalum, Zirconium, Niobium, Vanadium, and Molybdenum.\n\nThese aren’t ordinary metals.\n\nThey are **engineered for environments where temperatures reach levels that melt steel and vaporize conventional alloys**.\n\nWith this acquisition, Karman gained new metallurgical capabilities, access to high-specification missile programs, **deeper integration into classified supply chains**, increased revenue and EBITDA, and expanded design and manufacturing scope.\n\nKRMN reaffirmed that it is not just a supplier, but a *strategic* supplier.\n\n# Missile and Integrated Defense Systems\n\nThe revenue in this segment grew due to key programs entering or continuing production cycles.\n\nWhy? Because U.S. military inventory is being replenished, global conflicts have continued to drive demand, allies are purchasing next-generation tactical systems, and missile defense is entering a new strategic era.\n\nKarman provides the structures, subsystems, and assemblies that make these systems operational.\n\nNow, it’s not about whether there’s a war or not. Of course, I don’t want *any* wars. But even in peacetime, **missile defense isn’t slowing down**.\n\nIt’s accelerating. And now Karman sits closer to the core.\n\n# Hypersonics and Strategic Missile Defense\n\nIt has been called the highest-temperature, highest-priority arms race on Earth.  \n**Hypersonics is the battlefield of the next decade**.\n\nEvery major power is investing, testing, and racing toward Mach-5+ platforms.  \nBut **few companies can build components that survive these temperatures and stresses**.\n\nKarman is one of them.\n\nThis segment’s revenue surged thanks to well-funded programs in both development and production, **backed by aggressive government budgets**.\n\nKarman’s offerings (propulsion, deployable shrouds, launchers, energetic subsystems) are precisely the components required for hypersonic missile systems.\n\nThis is not speculative work. This is strategic infrastructure.\n\n# Space and Launch Systems\n\nThis is **where commercial demand and defense priorities finally converge**. Revenue here increased due to Karman’s involvement in two next-generation launch vehicles.\n\n# Blue Origin’s New Glenn\n\nA heavy-lift reusable orbital rocket whose purpose is to launch satellites, space infrastructure, and future deep-space missions.\n\nIt is still in a development stage. Although, on November 13, 2025, the New Glenn first stage landed successfully for the first time.\n\nThe rocket is scheduled to launch the Blue Moon Mark 1 lunar lander on robotic missions in early 2026 and late 2027.\n\nBlue Origin’s customer base:\n\n* Commercial satellite operators.\n* Government payloads.\n* Potential national-security missions.\n\n[New Glenn](https://www.blueorigin.com/new-glenn) is designed to compete with SpaceX’s Falcon Heavy.\n\nIts reusable first stage, massive payload capacity, and **long-term contract potential with DoD and NASA** make it a cornerstone of the growing commercial and government launch ecosystem.\n\nKarman supplies components used in New Glenn’s structures and launch systems.\n\n# ULA’s Vulcan\n\nA next-generation launch vehicle by United Launch Alliance, a joint venture between Boeing (BA) and Lockheed Martin (LMT).\n\n[Vulcan](https://www.ulalaunch.com/rockets/vulcan-centaur) is the United Launch Alliance successor to Atlas V and Delta IV, the legacy rockets that became the backbone of U.S. national-security launches.\n\nIt has already flown its first successful mission.\n\nThis rocket is built to serve:\n\n* U.S. Space Force.\n* DoD national-security missions.\n* Commercial payloads.\n* NASA deep-space missions.\n\nVulcan is engineered specifically for **National Security Space Launch (NSSL)** contracts: The elite, highest-priority, and highest-specification launches in America’s defense architecture and orbital missions.\n\nIt is expected to be one of the main U.S. rockets for defense-related payloads over the next decade. And Karman is inside that build because Karman supplies structural components and subsystems that go directly into Vulcan’s architecture.\n\n# Whichever Rocket Wins, Karman Wins\n\nThis isn’t about picking sides in the rocket race. It isn’t about tracking which launch vehicle secures more payloads, or which timeline slips, or which program accelerates.\n\nKarman supplies critical hardware to *both* ULA’s Vulcan and Blue Origin’s New Glenn. Karman’s components run through the veins of *both* launch systems.\n\nWhichever rocket wins the next wave of contracts, Karman wins with it.\n\nIf national-security payloads shift in one direction or commercial contracts in another, the outcome is the same: **Karman benefits either way**.\n\n# Understanding the Core of the Play\n\nThis is a crucial hinge of the entire play. **If you understand this one idea**, the rest of the thesis can open itself to you.\n\n**You don’t need to decide whether New Glenn or Vulcan will dominate the next decade**. You don’t have to choose heads or tails.\n\nBecause with Karman, **it isn’t about the side of the coin**. **It’s just about the coin being flipped into the air**.\n\n**As long as rockets are being launched** (commercial, government, national-security, deep-space, doesn’t matter) **Karman benefits**. The rivalry is irrelevant.\n\n**The activity itself is the catalyst**.\n\n# The Short-Term Decline\n\nNow, yes, Karman, like many other growth names, was bruised over the past few weeks. The stock is down –24.80% since the close on November 3, 2025.\n\nPersonally, I bought (and keep buying) the dip *gradually*. There was support in the high $50s (Karman has bounced from there, though), and the stock did ride a +23.37% rally in four days (Nov 21-26), so keep that in mind since this is a company below 10 billion in market cap. Check the chart. Once it runs, it runs north fast.\n\nI did buy a handful of **KRMN Dec 19 2025 80 Calls** for cheap, though. Of course, this one is a cheap, low-risk, high-reward play if it works. Quite simply, the stock can move $10 in a couple of days, and if KRMN even gets in the ballpark to sniff that strike, these become multi-baggers. But, again, the main play is for the long-term.\n\nYou should also know the KRMN play, although great for swings, is mostly meant for the **long term**. This is a **structural story**, not a short-lived trade.\n\n# Why Smart Money Is Interested\n\nOn May 23, portfolio manager [Randy Gwirtzman](https://www.baroncapitalgroup.com/bio/randolph-gwirtzman) of Baron Capital published a Barron’s article highlighting small-cap defense and cybersecurity stocks he believes have strong potential.\n\nHe noted that many investors are shifting away from economically sensitive sectors and toward **companies capable of compounding regardless of macro conditions**.\n\nHis focus, however, is on profitability, a key filter, especially when bond yields spike.\n\nKarman Holdings popped up on his list.\n\nAnd he understands there is a powerful reason this company could **benefit enormously** in the coming years: **Trump’s Golden Dome plans**.\n\nNow, everything in this post has been the backdrop, the scaffolding, the necessary foundation.\n\nIn my next post, if this DD gets approved/noticed, I’ll guide you deeper into the Golden Dome itself, what it is, why it matters, and why a small, overlooked company like Karman is positioned to benefit directly, along with several more developments from KRMN.\n\nHave a nice day.\n\n=================================\n\nShares, cost basis $58.99  \nAnd a handful of **KRMN Dec 19 2025 80 Calls** (these are cheap risk, high reward, though!) because they were dirt cheap, and I know KRMN can move $7-10 in two or three days.  \nHowever, the play is long-term.  ",
        "ticker": "KRMN"
    },
    {
        "post_id": "1pjn3b6",
        "post_title": "Mittal Steel: Decade high breakout + insane fundamentals + play on Ukraine War Ending",
        "text": "Hey All,\n\n  \nTLDR: MT $70 target book value / fundamental value. Catalysts are huge technical breakout, perfect alignment of fundamentals, and possible gasoline on the fire if the Ukraine war ends, or possible announcements on rare earths like everybody else. They have a lot of mines.\n\n  \nI have built a bit of a specialization in steel stocks. Caught the huge run in NUE in 21', the X buyout in '23, and again when it went through among some other trades. I thought I'd share my latest trade idea. Mittal Steel is the largest global steel company outside of China with operations globally. \n\n  \nWeekly Chart: Massive breakout and trading at a 12 year high. Global profile in 2nd screen shot.\n\nhttps://preview.redd.it/bni9j8jesh6g1.png?width=2740&format=png&auto=webp&s=06bb37696be4e0991bc68f4a8d193133f1267f77\n\nhttps://preview.redd.it/o2edmysjsh6g1.png?width=2068&format=png&auto=webp&s=d40a3fcb233b35ee933536e4bf052b350f19ae5d\n\n  \nGeneral notes below.\n\n1. MT\n   1. Target: $70 18X Long Run Earnings conservative, $70.75 Book Value\n   2. Q EPS Growth: 31.36% 255.75% (14.18%) 86.85%\n   3. Q REV Growth: 3.03% (1.99%) (9.11%) 1.11%\n   4. Next Q EPS: 31%, 9%, -5%, 61%\n   5. Next Q REV: 7%, 3% next two years\n   6. Catalysts:\n   7. Technicals\n      1. Technicals very strong. Trading at a decade high. Huge breakout\n      2. IWM huge long term breakout\n      3. Fed QE\n      4. Long hated stock\n   8. Fundamentals\n      1. Probably 2nd best run steel company globally after Steel Dynamics\n      2. Bought back almost 40% of shares in the last 5 years. Huge ongoing buybacks.\n      3. USA, EU, Canada Protections and more seem to be coming to keep China steel out. Everywhere MT operates is looking to protect their industry.\n      4. And over the last four years combined, capital spending amounted to $15.49 billion resulting in $1.9 billion in through cycle EBITDA coming (step change in profitability), Very Cheap,\n      5. M&A target (BHP, RIO, NUE?), 50% of FCF going to buying back shares. Nearly 40% in the last few years. Nice dividend.\n      6. China steel exports may or may not be sustainable. Iron ore prices rising. Massive China Stimulus + recovering market.\n      7. Number 1 global volume outside of China which everybody is putting tariffs on.\n      8. Trading 1/2 of Revenue, 63% of Book Value\n      9. Europe waking up. Massive German/Europe Stimulus. Global stimulus. Back to strength globally from trough? Europe Anti dumping cases. 22% USA Profits.\n      10. Drove at least $3-4 in value taking over Calvert a huge plant when the Nippon deal to acquire U.S. Steel went through. . Strongest price action of all steel companies. New market leader.\n   9. Catalysts\n      1. Massive Technical Breakout + Fundamental factors above.\n      2. If the Ukraine War Ends we will pop massively due to huge steel demand to rebuild. MT has extensive Ukraine and EU assets.\n      3. Any mention of rare earths it could rocket even if it is a gimmick.\n\nPositions \n\nhttps://preview.redd.it/omi4wkr1th6g1.png?width=2152&format=png&auto=webp&s=a90b52f8b334d96355a332c89da047dfa5cf5ad2\n\n",
        "ticker": "MT"
    },
    {
        "post_id": "1pjeq5s",
        "post_title": "NFLX YOLO",
        "text": "The market is using this Warner Bros deal as an excuse for a healthy pull back. But Netflix isn't skipping a beat. \n\nIf WB doesn't take the NFLX deal, they owe NFLX a few billion dollars. Win-win for doing nothing. \n\nToday must have been peak fear. The volume was off the charts. \n\nWish I had more to put in. Putting in what I have. Also put in a few k in my Roth ira.",
        "ticker": "NFLX"
    },
    {
        "post_id": "1phep5q",
        "post_title": "Paramount calls, $50 next year",
        "text": "Cuz fuck it why not ",
        "ticker": "PSKY"
    },
    {
        "post_id": "1ph20v9",
        "post_title": "DD: Housing May Be the 2026 Trade",
        "text": "Remember when Bessent said a housing emergency may be declared?\n\nhttps://www.reuters.com/world/us/bessent-says-trump-administration-will-tackle-high-housing-costs-with-new-2025-09-01/\n\nI think the government shutdown messed with the timing but now I think we have two catalysts that will make a declaration soon be smart from the White House:\n\n1. Road to Housing Act - somehow a bipartisan bill from Tim Scott and Elizabeth Warren. It passed the senate and is attached to the NDAA. Now the house needs to decide if it’s going to add it on their end. \n\nhttps://www.politico.com/news/2025/12/03/ndaa-delays-defense-bill-00676098\n\nhttps://www.banking.senate.gov/newsroom/majority/chairman-scott-statement-on-the-road-to-housing-act-and-ndaa-negotiations\n\nRoad to Housing is huge and if it passes alone makes my trade good. Ask AI to explain it to you and what it does for housing stocks\n\n2. FOMC meeting. With 2.5 days to go until a decision it would be dumb to introduce anything that could be construed as inflationary towards home prices. \n\nIf the rate cut hits and Road to Housing passes, things are a lot easier for the executive to do their whole declare stuff that may or may not stick thing. I don’t fully think materials tariffs will be lowered but Bessent did talk about it.\n\nNow, there’s a wrinkle here. We don’t have enough construction workers. \n\nhttps://www.agc.org/news/2025/08/28/construction-workforce-shortages-are-leading-cause-project-delays-immigration-enforcement-affects\n\nSo from my POV we have two solutions:\n\n1. Lift the cap on H2B workers - which may be done temporarily via executive order, particularly if a housing emergency is declared.\n\n2. Road to Housing act incentivizes localities to relax zoning for manufactured houses. \n\nI think Road To Housing is the key element here. It provides a ton of benefits to manufactured housing, small houses, and cheaper housing. It couldn’t move forward without the government reopening. The government is open and we may get our rate cut. It passed the senate, and the White House wants the house to add it. \n\nI think this ends up being a path of political survival now that it’s clear affordability is what will be driving voters at midterms.\n\nStocks I bought (see screenshots):\n\nBuilders and materials: \nITB QXO DHI LGIH\n\nManufactured:\nCVCO SKY UMH ELS\n\nMore People Buying and Moving:\nRKT Z COMP\n\nI think materials and most builders aren’t ideal for this because the workers shortage is a real bottleneck. Manufactured could be huge here, but DHI and LGIH sell a lot of starter homes. \n\nThe RKT Z COMP stocks do best if rates fall and if the portable mortgages, 40/50 yr mortgage ideas get put in action. If Hassett replaces JP we’ll probably get the lower rates.\n\nUnrelated to all the policy and rate specific stuff, Cathie Wood oddly referenced housing as a good trade 2 days ago:\n\nhttps://youtu.be/S0FHyju1iRs?si=V6OMSC7-SB5mIdfA\n\nI deleted my last DD on this because it was too heavy on materials and didn’t have the manufactured homes builders. I still want to get this up so I can feel good about having told everyone before it all goes off.\n\nNot financial advice.",
        "ticker": null
    }
]